package utils;

import java.util.HashMap;
import java.util.Map;
import java.util.Set;

/**
 * ContentStockConception简介
 * 常量：股票分类，概念
 *
 * @author Administrator
 * @date 2022-02-25 11:34
 */
public class ContStConception {

    /**
     * mapXnyGuangFuHit 新能源：光伏
     * 概念：["HIT电池"];股票个数：16;
     */
    public static Map<String, String> mapXnyGuangFuHit = new HashMap<>();

    static {
        mapXnyGuangFuHit.put("002459", "晶澳科技");//002459	晶澳科技	376	光伏设备	5.88	1506.06	2.23	价格区间: 5日:91.75 	10日:94.18 	20日:83.78 	30日:83.78 	60日:83.49 	120日:81.53 	250日:88.72 		,当前价：94.18	,当前：2022-02-28 14:07:52
        mapXnyGuangFuHit.put("603396", "金辰股份");//603396	金辰股份	361	光伏设备	2.7 	96.15	2.09	价格区间: 5日:93.89 	10日:95.02 	20日:83.29 	30日:60.78 	60日:15.92 	120日:11.73 	250日:31.91 		,当前价：82.68	,当前：2022-02-28 14:07:54
        mapXnyGuangFuHit.put("600546", "山煤国际");//600546	山煤国际	339	煤炭行业	3.26	219.85	3.03	价格区间: 5日:42.67 	10日:53.26 	20日:70.55 	30日:77.43 	60日:80.05 	120日:45.82 	250日:56.08 		,当前价：11.09	,当前：2022-02-28 14:07:55
        mapXnyGuangFuHit.put("002610", "爱康科技");//002610	爱康科技	280	光伏设备	-0.24	182.76	1.95	价格区间: 5日:58.62 	10日:64.18 	20日:71.08 	30日:71.08 	60日:26.22 	120日:25.72 	250日:49.00 		,当前价：4.08	,当前：2022-02-28 14:07:58
        mapXnyGuangFuHit.put("600438", "通威股份");//600438	通威股份	256	光伏设备	1.92	1931.16	1.73	价格区间: 5日:77.41 	10日:83.33 	20日:85.45 	30日:85.45 	60日:51.89 	120日:24.53 	250日:40.96 		,当前价：42.9	,当前：2022-02-28 14:08:01
        mapXnyGuangFuHit.put("600151", "航天机电");//600151	航天机电	221	光伏设备	2.39	166.23	2.42	价格区间: 5日:82.52 	10日:83.49 	20日:65.71 	30日:35.94 	60日:27.06 	120日:43.51 	250日:65.41 		,当前价：11.59	,当前：2022-02-28 14:08:02
        mapXnyGuangFuHit.put("601012", "隆基股份");//601012	隆基股份	221	光伏设备	4.28	4208.57	2.74	价格区间: 5日:99.73 	10日:99.76 	20日:99.79 	30日:75.57 	60日:55.51 	120日:35.87 	250日:48.90 		,当前价：77.75	,当前：2022-02-28 14:08:03
        mapXnyGuangFuHit.put("002129", "中环股份");//002129	中环股份	214	光伏设备	0.88	1548.32	1.64	价格区间: 5日:94.79 	10日:96.75 	20日:97.32 	30日:98.22 	60日:98.24 	120日:56.40 	250日:75.19 		,当前价：47.91	,当前：2022-02-28 14:08:05
    }

    /**
     * 盐湖提锂
     */
    public static Map<String, String> mapYanHuTiLi = new HashMap<>();
    static {
        mapYanHuTiLi.put("600338", "西藏珠峰");//600338 西藏珠峰 295 有色金属
        mapYanHuTiLi.put("600773", "西藏城投");//600773 西藏城投 291 房地产开发
        mapYanHuTiLi.put("000762", "西藏矿业");//000762 西藏矿业 284 采掘行业
        mapYanHuTiLi.put("002240", "盛新锂能");//002240 盛新锂能 269 能源金属
        mapYanHuTiLi.put("600499", "科达制造");//600499 科达制造 263 专用设备
        mapYanHuTiLi.put("002256", "兆新股份");//002256 兆新股份 259 电网设备
        mapYanHuTiLi.put("002466", "天齐锂业");//002466 天齐锂业 251 能源金属
        mapYanHuTiLi.put("000408", "藏格矿业");//000408 藏格矿业 250 化肥行业
        mapYanHuTiLi.put("000546", "金圆股份");//000546 金圆股份 245 水泥建材
        mapYanHuTiLi.put("002140", "东华科技");//002140 东华科技 240 工程建设
        mapYanHuTiLi.put("601068", "中铝国际");//601068 中铝国际 235 工程建设
        mapYanHuTiLi.put("002460", "赣锋锂业");//002460 赣锋锂业 229 能源金属
        mapYanHuTiLi.put("603799", "华友钴业");//603799 华友钴业 229 能源金属
        mapYanHuTiLi.put("601168", "西部矿业");//601168 西部矿业 219 有色金属
        mapYanHuTiLi.put("002594", "比亚迪");  //002594 比亚迪   212 汽车整车
        mapYanHuTiLi.put("601899", "紫金矿业");//601899 紫金矿业 203 贵金属
        mapYanHuTiLi.put("000792", "盐湖股份");//000792 盐湖股份 194 化肥行业
        mapYanHuTiLi.put("002239", "奥特佳");  //002239 奥特佳   175 汽车零部件
        mapYanHuTiLi.put("603867", "新化股份");//603867 新化股份 47 化学制品
        mapYanHuTiLi.put("000920", "沃顿科技");//000920 沃顿科技 6 环保行业
    }

    /**
     * 概念：["新冠检测","新冠药物","体外诊断"];股票个数：34;
     */
    public static Map<String, String> mapYiLiaoXinGuan = new HashMap<>();

    static {
        mapYiLiaoXinGuan.put("002432", "九安医疗");//002432	九安医疗	542	医疗器械	-2.56	311.52	5.06	价格区间: 5日:26.29 	10日:53.49 	20日:58.45 	30日:34.04 	60日:66.13 	120日:70.00 	250日:70.00 		,当前价：65.09	,当前：2022-02-28 10:57:45
        mapYiLiaoXinGuan.put("002349", "精华制药");//002349	精华制药	410	中药    	-0.14	120.34	2.81	价格区间: 5日:23.08 	10日:39.58 	20日:43.29 	30日:28.93 	60日:51.21 	120日:52.14 	250日:54.68 		,当前价：14.4	,当前：2022-02-28 10:57:47
        mapYiLiaoXinGuan.put("605369", "拱东医疗");//605369	拱东医疗	333	医疗器械	0.03	164.09	1.61	价格区间: 5日:82.49 	10日:60.25 	20日:65.19 	30日:63.13 	60日:82.16 	120日:85.56 	250日:91.41 		,当前价：145.69	,当前：2022-02-28 10:57:48
        mapYiLiaoXinGuan.put("002932", "明德生物");//002932	明德生物	320	医疗器械	6.48	84.95	4.56	价格区间: 5日:85.45 	10日:84.51 	20日:65.22 	30日:16.98 	60日:17.91 	120日:31.19 	250日:46.47 		,当前价：81.0	,当前：2022-02-28 10:57:49
        mapYiLiaoXinGuan.put("603392", "万泰生物");//603392	万泰生物	298	医疗器械	-0.69	1531.26	2.99	价格区间: 5日:83.16 	10日:94.19 	20日:95.34 	30日:95.34 	60日:94.83 	120日:90.00 	250日:70.43 		,当前价：252.25	,当前：2022-02-28 10:57:51
        mapYiLiaoXinGuan.put("002603", "以岭药业");//002603	以岭药业	255	中药    	1.42	405.98	4.01	价格区间: 5日:14.16 	10日:59.04 	20日:68.24 	30日:52.13 	60日:68.07 	120日:70.41 	250日:73.00 		,当前价：24.3	,当前：2022-02-28 10:57:52
        mapYiLiaoXinGuan.put("603222", "济民医疗");//603222	济民医疗	252	化学制药	2.81	57.31	2.55	价格区间: 5日:87.32 	10日:92.50 	20日:93.41 	30日:29.51 	60日:33.88 	120日:34.80 	250日:55.62 		,当前价：16.82	,当前：2022-02-28 10:57:53
        mapYiLiaoXinGuan.put("002584", "西陇科学");//002584	西陇科学	248	电子化学品	7.77	59.28	5.17	价格区间: 5日:82.63 	10日:86.26 	20日:86.26 	30日:33.03 	60日:45.89 	120日:54.44 	250日:57.29 		,当前价：10.13	,当前：2022-02-28 10:57:54
    }

    /**
     * mapCro
     */
    public static Map<String, String> mapYiLiaoCro = new HashMap<>();

    static {
        mapYiLiaoCro.put("603456", "九洲药业");//603456	九洲药业	301	化学制药	1.07	401.47	5.81	价格区间: 5日:69.90 	10日:76.56 	20日:76.78 	30日:62.55 	60日:35.23 	120日:37.10 	250日:54.15 		,当前价：48.22	,当前：2022-02-28 11:10:56
        mapYiLiaoCro.put("603127", "昭衍新药");//603127	昭衍新药	296	医疗服务	-1.61	439.92	3.52	价格区间: 5日:79.07 	10日:85.06 	20日:86.45 	30日:86.45 	60日:46.65 	120日:29.34 	250日:35.31 		,当前价：115.39	,当前：2022-02-28 11:10:57
        mapYiLiaoCro.put("002821", "凯莱英  ");//002821	凯莱英  	283	医疗服务	-0.79	902.15	2.08	价格区间: 5日:67.59 	10日:81.05 	20日:82.39 	30日:60.24 	60日:28.70 	120日:28.70 	250日:36.49 		,当前价：341.28	,当前：2022-02-28 11:10:59
        mapYiLiaoCro.put("603259", "药明康德");//603259	药明康德	225	医疗服务	-0.1	3053.29	2.52	价格区间: 5日:69.11 	10日:83.82 	20日:67.59 	30日:54.24 	60日:31.29 	120日:27.20 	250日:23.12 		,当前价：103.3	,当前：2022-02-28 11:11:00
    }

    /**
     * mapShiYou 概念：["可燃冰","油气设服","页岩气","氦气概念","天然气","油价相关"];股票个数：97;
     */
    public static Map<String, String> mapShiYou = new HashMap<>();

    static {
        mapShiYou.put("600021", "上海电力");//600021	上海电力	341	电力行业	1.92	305.68	7.1 	价格区间: 5日:84.39 	10日:64.04 	20日:42.07 	30日:29.08 	60日:35.72 	120日:47.98 	250日:50.49 		,当前价：11.68	,当前：2022-02-28 09:47:54
        mapShiYou.put("600348", "华阳股份");//600348	华阳股份	335	煤炭行业	1.36	287.16	3.03	价格区间: 5日:34.23 	10日:42.06 	20日:70.20 	30日:70.20 	60日:53.58 	120日:34.09 	250日:63.31 		,当前价：11.94	,当前：2022-02-28 09:47:55
        mapShiYou.put("601969", "海南矿业");//601969	海南矿业	307	钢铁行业	-0.99	223.40	2.2 	价格区间: 5日:27.71 	10日:56.20 	20日:70.59 	30日:65.16 	60日:21.62 	120日:9.05  	250日:29.64 		,当前价：11.05	,当前：2022-02-28 09:47:56
        mapShiYou.put("603619", "中曼石油");//603619	中曼石油	307	采掘行业	3.34	68.04	4.63	价格区间: 5日:59.54 	10日:66.26 	20日:78.52 	30日:78.52 	60日:83.15 	120日:80.80 	250日:83.27 		,当前价：17.01	,当前：2022-02-28 09:47:57
        mapShiYou.put("600759", "洲际油气");//600759	洲际油气	306	石油行业	4.56	72.66	6.21	价格区间: 5日:80.85 	10日:85.00 	20日:89.53 	30日:89.53 	60日:91.09 	120日:46.94 	250日:57.55 		,当前价：3.21	,当前：2022-02-28 09:47:58
        mapShiYou.put("000723", "美锦能源");//000723	美锦能源	304	煤炭行业	-3.09	601.68	5.17	价格区间: 5日:30.37 	10日:30.37 	20日:56.68 	30日:36.83 	60日:17.85 	120日:41.95 	250日:56.79 		,当前价：14.09	,当前：2022-02-28 09:48:00
        mapShiYou.put("600256", "广汇能源");//600256	广汇能源	298	石油行业	1.56	468.79	3.98	价格区间: 5日:64.47 	10日:75.45 	20日:83.83 	30日:83.83 	60日:80.00 	120日:45.23 	250日:67.16 		,当前价：7.14	,当前：2022-02-28 09:48:01
    }

    /**
     * mapShiShuZiHuoBi 概念：["数字货币"];股票个数：24;
     */
    public static Map<String, String> mapShiShuZiHuoBi = new HashMap<>();

    static {
        mapShiShuZiHuoBi.put("603123", "翠微股份");//603123	翠微股份	400	商业百货	0.77	156.31	4.26	价格区间: 5日:6.70  	10日:6.19  	20日:19.02 	30日:40.67 	60日:52.86 	120日:54.78 	250日:54.78 		,当前价：19.57	,当前：2022-02-28 10:32:47
        mapShiShuZiHuoBi.put("003040", "楚天龙");  //003040	楚天龙  	330	通信设备	2.02	116.62	6.8 	价格区间: 5日:35.11 	10日:23.19 	20日:30.41 	30日:15.90 	60日:15.90 	120日:25.82 	250日:48.28 		,当前价：25.29	,当前：2022-02-28 10:32:49
        mapShiShuZiHuoBi.put("002268", "卫士通");  //002268	卫士通  	326	软件开发	-0.76	376.26	2.93	价格区间: 5日:62.48 	10日:69.24 	20日:73.17 	30日:49.70 	60日:35.08 	120日:28.00 	250日:58.57 		,当前价：44.46	,当前：2022-02-28 10:32:50
        mapShiShuZiHuoBi.put("002537", "海联金汇");//002537	海联金汇	316	汽车零部件	10.06	101.44	6.09	价格区间: 5日:75.54 	10日:46.46 	20日:52.55 	30日:58.28 	60日:63.11 	120日:74.36 	250日:74.84 		,当前价：8.64	,当前：2022-02-28 10:32:51
        mapShiShuZiHuoBi.put("002049", "紫光国微");//002049	紫光国微	274	半导体  	5.8 	1362.96	4.16	价格区间: 5日:84.13 	10日:86.73 	20日:75.21 	30日:66.49 	60日:66.20 	120日:61.42 	250日:81.92 		,当前价：224.6	,当前：2022-02-28 10:32:56
        mapShiShuZiHuoBi.put("002152", "广电运通");//002152	广电运通	172	计算机设备	1.03	293.54	4.83	价格区间: 5日:26.42 	10日:22.95 	20日:37.89 	30日:32.09 	60日:32.09 	120日:52.85 	250日:58.27 		,当前价：11.82	,当前：2022-02-28 10:33:10
    }

    /**
     * mapXnyGuangFuHit 概念：科技-"虚拟数字人";股票个数：13;
     */
    public static Map<String, String> mapChuanMeiYuanYuZhou = new HashMap<>();
    static {
        mapChuanMeiYuanYuZhou.put("002354", "天娱数科");//002354	天娱数科	377	游戏    	6.44	87.93	1.35	价格区间: 5日:72.37 	10日:72.03 	20日:72.03 	30日:52.55 	60日:49.60 	120日:57.37 	250日:59.70 		,当前价：5.29	,当前：2022-03-04 13:54:57
        mapChuanMeiYuanYuZhou.put("603466", "风语筑  ");//603466	风语筑  	352	文化传媒	7.12	101.57	1.19	价格区间: 5日:83.08 	10日:85.33 	20日:34.59 	30日:19.18 	60日:36.00 	120日:47.16 	250日:51.15 		,当前价：24.07	,当前：2022-03-04 13:54:58
        mapChuanMeiYuanYuZhou.put("000810", "创维数字");//000810	创维数字	336	家电行业	-0.52	142.69	0.8 	价格区间: 5日:68.20 	10日:74.14 	20日:76.01 	30日:54.12 	60日:69.66 	120日:75.00 	250日:75.00 		,当前价：13.42	,当前：2022-03-04 13:55:00
        mapChuanMeiYuanYuZhou.put("000681", "视觉中国");//000681	视觉中国	322	文化传媒	2.53	113.35	1.47	价格区间: 5日:62.12 	10日:43.48 	20日:30.72 	30日:7.73  	60日:7.20  	120日:26.11 	250日:31.64 		,当前价：16.18	,当前：2022-03-04 13:55:01
        mapChuanMeiYuanYuZhou.put("002241", "歌尔股份");//002241	歌尔股份	235	消费电子	-2.65	1354.57	1.55	价格区间: 5日:4.49  	10日:3.70  	20日:3.05  	30日:1.92  	60日:1.31  	120日:2.33  	250日:43.52 		,当前价：39.65	,当前：2022-03-04 13:55:16
        mapChuanMeiYuanYuZhou.put("002230", "科大讯飞");//002230	科大讯飞	154	软件开发	0.18	1141.01	1.14	价格区间: 5日:28.09 	10日:20.69 	20日:68.02 	30日:68.84 	60日:47.21 	120日:34.27 	250日:22.24 		,当前价：49.09	,当前：2022-03-04 13:56:10
    }
    /**
     * mapYiLiao 医疗
     */
    public static Map<String, String> mapYiLiao = new HashMap<>();

    static {
        mapYiLiao.putAll(mapYiLiaoXinGuan);
        mapYiLiao.putAll(mapYiLiaoCro);
    }

}
