package utils;

import ttjj.service.KlineService;
import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：资源
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStZiYuan {

    /**
     * ["可燃冰"]：8;
     */
    public static Map<String, String> keRanBing = new HashMap<>();

    static {
        keRanBing.put("002353", "杰瑞股份");//268	专用设备	2.37	422.61	2.72	价格区间: 5日:52.18 	10日:51.24 	20日:51.24 	30日:51.24 	60日:55.05 	120日:43.37 	250日:60.53 		,当前价：44.12	,当前：2022-03-18 10:18:33
        keRanBing.put("600098", "广州发展");//211	电力行业	0.46	230.36	1.81	价格区间: 5日:61.04 	10日:42.73 	20日:38.84 	30日:26.55 	60日:15.56 	120日:13.43 	250日:23.29 		,当前价：6.5	,当前：2022-03-18 10:18:34
        keRanBing.put("601808", "中海油服");//202	采掘行业	2.56	650.85	4.1 	价格区间: 5日:53.01 	10日:24.91 	20日:22.72 	30日:22.72 	60日:22.72 	120日:22.72 	250日:28.16 		,当前价：13.64	,当前：2022-03-18 10:18:35
    }

    /**
     * ["油价相关"]：10;
     */
    public static Map<String, String> youJiaXiangGuan = new HashMap<>();
    static {
        youJiaXiangGuan.put("000822", "山东海化");//268	化学原料	0.61	59.43	2.89	价格区间: 5日:65.38 	10日:37.78 	20日:32.28 	30日:28.81 	60日:28.81 	120日:5.44  	250日:19.52 		,当前价：6.64	,当前：2022-03-18 10:22:47
        youJiaXiangGuan.put("600777", "新潮能源");//251	石油行业	3.03	138.73	5.36	价格区间: 5日:87.10 	10日:45.00 	20日:44.26 	30日:44.26 	60日:41.54 	120日:20.45 	250日:35.58 		,当前价：2.04	,当前：2022-03-18 10:22:49
        youJiaXiangGuan.put("601111", "中国国航");//207	航空机场	0.74	1391.48	2.86	价格区间: 5日:82.35 	10日:65.97 	20日:56.25 	30日:41.31 	60日:42.99 	120日:58.28 	250日:65.24 		,当前价：9.58	,当前：2022-03-18 10:22:51
        youJiaXiangGuan.put("601808", "中海油服");//202	采掘行业	2.56	650.85	4.1 	价格区间: 5日:50.60 	10日:23.77 	20日:21.69 	30日:21.69 	60日:21.69 	120日:21.69 	250日:27.20 		,当前价：13.64	,当前：2022-03-18 10:22:52
        youJiaXiangGuan.put("600115", "中国东航");//193	航空机场	3.33	1053.19	2.74	价格区间: 5日:95.24 	10日:81.63 	20日:64.52 	30日:57.14 	60日:60.00 	120日:63.19 	250日:69.54 		,当前价：5.58	,当前：2022-03-18 10:22:53
        youJiaXiangGuan.put("600688", "上海石化");//190	石油行业	1.42	386.41	3.83	价格区间: 5日:65.12 	10日:33.73 	20日:31.11 	30日:30.77 	60日:23.53 	120日:15.30 	250日:20.10 		,当前价：3.57	,当前：2022-03-18 10:22:54
        youJiaXiangGuan.put("601857", "中国石油");//189	石油行业	2.34	9608.60	6.15	价格区间: 5日:48.05 	10日:31.62 	20日:30.33 	30日:30.33 	60日:31.45 	120日:31.89 	250日:51.35 		,当前价：5.25	,当前：2022-03-18 10:22:55
    }

    /**
     * gangTie_diTanYeJin ["低碳冶金"]：9;
     */
    public static Map<String, String> gangTie_diTanYeJin = new HashMap<>();

    static {
        gangTie_diTanYeJin.put("600581", "八一钢铁");//346	钢铁行业     -0.64	119.72	3.11	价格区间: 5日:94.74 	10日:97.14 	20日:97.36 	30日:97.61 	60日:97.61 	120日:97.61 	250日:60.74 		,当前价：7.81	,当前：2022-04-15 10:09:14
        gangTie_diTanYeJin.put("000959", "首钢股份");//295	钢铁行业     3.3 	400.97	3.29	价格区间: 5日:98.04 	10日:98.84 	20日:99.08 	30日:60.49 	60日:60.49 	120日:48.06 	250日:32.01 		,当前价：5.94	,当前：2022-04-15 10:09:15
        gangTie_diTanYeJin.put("000928", "中钢国际");//259	工程咨询服务 -3.27	79.55	1.59	价格区间: 5日:5.88  	10日:4.88  	20日:4.88  	30日:3.87  	60日:2.62  	120日:1.45  	250日:0.78  		,当前价：6.21	,当前：2022-04-15 10:09:17
        gangTie_diTanYeJin.put("600307", "酒钢宏兴");//239	钢铁行业     10.17	162.85	8.6 	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:78.16 	250日:46.67 		,当前价：2.6	,当前：2022-04-15 10:09:18
        gangTie_diTanYeJin.put("601618", "中国中冶");//217	工程建设     -0.52	785.43	1.75	价格区间: 5日:28.57 	10日:33.33 	20日:44.44 	30日:20.45 	60日:20.45 	120日:20.45 	250日:26.74 		,当前价：3.79	,当前：2022-04-15 10:09:19
        gangTie_diTanYeJin.put("002002", "鸿达兴业");//215	化学原料     -1.54	140.18	4.53	价格区间: 5日:20.69 	10日:11.76 	20日:7.69  	30日:5.04  	60日:4.00  	120日:2.94  	250日:28.41 		,当前价：4.49	,当前：2022-04-15 10:09:20
    }

    /**
     * jinShu_jiBenJinShu ["基本金属"]：37;
     */
    public static Map<String, String> jinShu_jiBenJinShu = new HashMap<>();

    static {
        jinShu_jiBenJinShu.put("002738", "中矿资源");//420	小金属       0.94	255.43	1.61	价格区间: 5日:27.66 	10日:16.96 	20日:12.47 	30日:9.69  	60日:43.36 	120日:46.04 	250日:64.61 		,当前价：78.43	,当前：2022-04-13 11:29:26
        jinShu_jiBenJinShu.put("600338", "西藏珠峰");//371	有色金属     -0.21	219.04	2.13	价格区间: 5日:33.44 	10日:20.24 	20日:13.92 	30日:9.25  	60日:7.94  	120日:6.05  	250日:34.55 		,当前价：23.96	,当前：2022-04-13 11:29:27
        jinShu_jiBenJinShu.put("000807", "云铝股份");//351	有色金属     5.47	448.06	1.85	价格区间: 5日:82.28 	10日:41.67 	20日:45.02 	30日:28.38 	60日:39.06 	120日:42.77 	250日:24.15 		,当前价：12.92	,当前：2022-04-13 11:29:29
        jinShu_jiBenJinShu.put("600367", "红星发展");//343	化学原料     -5   	66.27	3.19	价格区间: 5日:36.91 	10日:47.58 	20日:56.48 	30日:42.17 	60日:63.17 	120日:65.52 	250日:76.67 		,当前价：22.6	,当前：2022-04-13 11:29:30
        jinShu_jiBenJinShu.put("002182", "云海金属");//341	小金属       6.74	127.02	2.29	价格区间: 5日:66.38 	10日:55.27 	20日:36.54 	30日:21.05 	60日:18.70 	120日:34.36 	250日:47.89 		,当前价：19.65	,当前：2022-04-13 11:29:31
        jinShu_jiBenJinShu.put("603799", "华友钴业");//322	能源金属     0.67	1022.43	3.79	价格区间: 5日:19.64 	10日:15.19 	20日:11.87 	30日:7.08  	60日:6.75  	120日:4.85  	250日:21.40 		,当前价：83.71	,当前：2022-04-13 11:29:32
    }

    /**
     * meiTan_meiHuaGong ["煤化工"]：57;
     */
    public static Map<String, String> meiTan_meiHuaGong = new HashMap<>();

    static {
        meiTan_meiHuaGong.put("000422", "湖北宜化");//482	化学原料     -0.88	213.60	2.93	价格区间: 5日:60.92 	10日:75.10 	20日:82.41 	30日:84.81 	60日:85.50 	120日:40.14 	250日:63.86 		,当前价：23.79	,当前：2022-04-15 09:56:18
        meiTan_meiHuaGong.put("600096", "云天化  ");//456	化肥行业     -1.05	534.24	3.75	价格区间: 5日:74.45 	10日:77.45 	20日:83.95 	30日:85.09 	60日:91.15 	120日:83.86 	250日:72.17 		,当前价：29.1	,当前：2022-04-15 09:56:20
        meiTan_meiHuaGong.put("600123", "兰花科创");//428	煤炭行业     1.73	181.76	6.87	价格区间: 5日:92.06 	10日:95.05 	20日:96.22 	30日:96.52 	60日:96.99 	120日:97.02 	250日:97.95 		,当前价：15.91	,当前：2022-04-15 09:56:21
        meiTan_meiHuaGong.put("601101", "昊华能源");//427	煤炭行业     5.39	143.04	18.46	价格区间: 5日:91.67 	10日:91.67 	20日:94.97 	30日:95.11 	60日:96.42 	120日:90.65 	250日:80.51 		,当前价：11.92	,当前：2022-04-15 09:56:23
        meiTan_meiHuaGong.put("600188", "兖矿能源");//425	煤炭行业     0.7 	1988.39	4.89	价格区间: 5日:84.65 	10日:86.51 	20日:92.36 	30日:93.02 	60日:95.84 	120日:95.98 	250日:97.37 		,当前价：40.18	,当前：2022-04-15 09:56:23
        meiTan_meiHuaGong.put("000933", "神火股份");//400	有色金属     0.98	349.58	9.75	价格区间: 5日:81.43 	10日:81.43 	20日:85.80 	30日:87.48 	60日:88.85 	120日:91.33 	250日:74.67 		,当前价：15.53	,当前：2022-04-15 09:56:25
        meiTan_meiHuaGong.put("600277", "亿利洁能");//380	化学原料     -1.52	185.15	2.22	价格区间: 5日:12.50 	10日:7.55  	20日:3.39  	30日:2.55  	60日:20.93 	120日:28.34 	250日:48.83 		,当前价：5.2	,当前：2022-04-15 09:56:25
    }


    /**
     * qingNengYuan ["氢能源"]：91;
     */
    public static Map<String, String> qiTi_qingNengYuan = new HashMap<>();

    static {
        qiTi_qingNengYuan.put("002537", "海联金汇");//437	汽车零部件	1.29	138.42	2.39	价格区间: 5日:33.79 	10日:32.95 	20日:65.75 	30日:69.51 	60日:72.57 	120日:78.66 	250日:78.89 		,当前价：11.79	,当前：2022-04-06 14:34:18
        qiTi_qingNengYuan.put("600277", "亿利洁能");//402	化学原料	2.51	218.27	3.73	价格区间: 5日:58.33 	10日:19.21 	20日:11.93 	30日:28.43 	60日:44.70 	120日:57.20 	250日:64.27 		,当前价：6.13	,当前：2022-04-06 14:34:20
        qiTi_qingNengYuan.put("000980", "*ST众泰 ");//392	汽车整车	1.28	200.74	2.38	价格区间: 5日:61.76 	10日:69.23 	20日:62.96 	30日:38.06 	60日:14.33 	120日:7.85  	250日:11.91 		,当前价：3.96	,当前：2022-04-06 14:34:20
        qiTi_qingNengYuan.put("600860", "京城股份");//378	通用设备	2.67	97.05	2.55	价格区间: 5日:100.00	10日:44.51 	20日:60.97 	30日:61.94 	60日:59.88 	120日:67.92 	250日:69.51 		,当前价：20.01	,当前：2022-04-06 14:34:22
        qiTi_qingNengYuan.put("603938", "三孚股份");//364	化肥行业	-0.9	96.69	1.81	价格区间: 5日:10.24 	10日:45.90 	20日:63.07 	30日:68.71 	60日:75.89 	120日:68.80 	250日:45.12 		,当前价：49.53	,当前：2022-04-06 14:34:23
        qiTi_qingNengYuan.put("002060", "粤水电  ");//356	工程建设	4.29	114.09	3.68	价格区间: 5日:82.23 	10日:86.77 	20日:91.42 	30日:91.70 	60日:92.18 	120日:92.28 	250日:93.78 		,当前价：9.49	,当前：2022-04-06 14:34:24
        qiTi_qingNengYuan.put("600141", "兴发集团");//347	化肥行业	-0.09	371.98	1.61	价格区间: 5日:11.59 	10日:14.81 	20日:9.00  	30日:6.33  	60日:29.81 	120日:14.80 	250日:44.68 		,当前价：33.46	,当前：2022-04-06 14:34:25
        qiTi_qingNengYuan.put("600032", "浙江新能");//341	电力行业	-1   	289.54	1.63	价格区间: 5日:28.31 	10日:34.68 	20日:56.01 	30日:56.01 	60日:56.01 	120日:36.38 	250日:62.56 		,当前价：13.92	,当前：2022-04-06 14:34:26
        qiTi_qingNengYuan.put("002639", "雪人股份");//332	通用设备	2.99	87.92	2   	价格区间: 5日:91.96 	10日:26.75 	20日:50.09 	30日:50.09 	60日:30.59 	120日:43.98 	250日:48.84 		,当前价：11.38	,当前：2022-04-06 14:34:27
    }
    /**
     * qiTi_haiQi ["氦气概念"]：3;
     */
    public static Map<String, String> qiTi_haiQi = new HashMap<>();

    static {
        qiTi_haiQi.put("002639", "雪人股份");//353	通用设备     -5.58	91.55	4.42	价格区间: 5日:56.62 	10日:42.32 	20日:53.81 	30日:53.81 	60日:32.86 	120日:45.81 	250日:50.44 		,当前价：11.85	,当前：2022-04-11 14:34:44
        qiTi_haiQi.put("002549", "凯美特气");//279	化学制品     -1.69	94.49	3.92	价格区间: 5日:24.42 	10日:14.33 	20日:14.92 	30日:22.49 	60日:28.44 	120日:49.27 	250日:68.34 		,当前价：15.15	,当前：2022-04-11 14:34:46
        qiTi_haiQi.put("002430", "杭氧股份");//219	专用设备     -3.13	258.50	9.75	价格区间: 5日:11.86 	10日:8.29  	20日:21.62 	30日:21.62 	60日:15.99 	120日:29.19 	250日:15.38 		,当前价：26.3	,当前：2022-04-11 14:34:47
    }

    /**
     * huaGong_huaGongYuanLiao ["化工原料"]：44;
     */
    public static Map<String, String> huaGong_huaGongYuanLiao = new HashMap<>();

    static {
        huaGong_huaGongYuanLiao.put("000422", "湖北宜化");//509	化学原料     9.93	224.65	2.57	价格区间: 5日:98.81 	10日:99.13 	20日:99.23 	30日:99.28 	60日:99.31 	120日:46.30 	250日:67.94 		,当前价：25.02	,当前：2022-04-08 11:48:39
        huaGong_huaGongYuanLiao.put("600096", "云天化  ");//478	化肥行业     8.76	551.50	2.21	价格区间: 5日:94.36 	10日:95.45 	20日:96.01 	30日:96.29 	60日:97.81 	120日:89.39 	250日:75.66 		,当前价：30.04	,当前：2022-04-08 11:48:40
        huaGong_huaGongYuanLiao.put("000683", "远兴能源");//391	化学原料     1.83	367.71	1.1 	价格区间: 5日:81.82 	10日:78.40 	20日:88.56 	30日:88.56 	60日:89.51 	120日:92.46 	250日:68.66 		,当前价：10.01	,当前：2022-04-08 11:48:42
        huaGong_huaGongYuanLiao.put("600141", "兴发集团");//382	化肥行业     10   	414.56	3.77	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:52.54 	60日:64.44 	120日:31.99 	250日:53.67 		,当前价：37.29	,当前：2022-04-08 11:48:43
        huaGong_huaGongYuanLiao.put("600389", "江山股份");//354	农药兽药     6.54	144.19	2.4 	价格区间: 5日:96.77 	10日:97.62 	20日:98.81 	30日:98.81 	60日:94.06 	120日:94.84 	250日:63.81 		,当前价：48.55	,当前：2022-04-08 11:48:44
        huaGong_huaGongYuanLiao.put("600596", "新安股份");//333	农药兽药     4.99	232.34	2.3 	价格区间: 5日:99.23 	10日:76.95 	20日:85.16 	30日:85.09 	60日:90.13 	120日:54.56 	250日:47.13 		,当前价：28.39	,当前：2022-04-08 11:48:45
    }

    /**
     * huaGong_taiBaiFen ["钛白粉"]：8;
     */
    public static Map<String, String> huaGong_taiBaiFen = new HashMap<>();

    static {
        huaGong_taiBaiFen.put("002386", "天原股份");//260	化学原料     3.15	81.76	1.64	价格区间: 5日:51.69 	10日:54.26 	20日:66.41 	30日:29.93 	60日:27.07 	120日:18.16 	250日:34.59 		,当前价：10.47	,当前：2022-04-08 12:23:24
        huaGong_taiBaiFen.put("603826", "坤彩科技");//240	非金属材料   2.04	325.96	1.97	价格区间: 5日:73.72 	10日:78.46 	20日:83.10 	30日:83.10 	60日:88.04 	120日:88.20 	250日:89.17 		,当前价：69.65	,当前：2022-04-08 12:23:25
        huaGong_taiBaiFen.put("603067", "振华股份");//231	化学原料     2.01	56.89	1.37	价格区间: 5日:36.46 	10日:23.97 	20日:25.56 	30日:12.47 	60日:22.73 	120日:25.84 	250日:57.64 		,当前价：11.19	,当前：2022-04-08 12:23:26
        huaGong_taiBaiFen.put("600727", "鲁北化工");//226	化学原料     5.49	54.81	2.96	价格区间: 5日:88.60 	10日:91.28 	20日:92.49 	30日:81.22 	60日:73.06 	120日:37.04 	250日:37.34 		,当前价：10.37	,当前：2022-04-08 12:23:27
        huaGong_taiBaiFen.put("000629", "攀钢钒钛");//216	钢铁行业     1.59	329.50	2.53	价格区间: 5日:70.97 	10日:70.97 	20日:61.82 	30日:40.00 	60日:36.17 	120日:44.83 	250日:57.43 		,当前价：3.83	,当前：2022-04-08 12:23:28
    }

    /**
     * huaGong_youJiGui ["有机硅"]：11;
     */
    public static Map<String, String> huaGong_youJiGui = new HashMap<>();

    static {
        huaGong_youJiGui.put("603938", "三孚股份");//383	化肥行业     2.38	104.97	1.57	价格区间: 5日:88.16 	10日:92.86 	20日:95.13 	30日:95.40 	60日:96.82 	120日:87.77 	250日:52.51 		,当前价：53.77	,当前：2022-04-08 12:27:44
        huaGong_youJiGui.put("600141", "兴发集团");//382	化肥行业     10   	414.56	3.77	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:52.54 	60日:64.44 	120日:31.99 	250日:53.67 		,当前价：37.29	,当前：2022-04-08 12:27:45
        huaGong_youJiGui.put("600596", "新安股份");//333	农药兽药     4.99	232.34	2.3 	价格区间: 5日:99.23 	10日:76.95 	20日:85.16 	30日:85.09 	60日:90.13 	120日:54.56 	250日:47.13 		,当前价：28.39	,当前：2022-04-08 12:27:46
        huaGong_youJiGui.put("002709", "天赐材料");//306	化学制品     -0.56	876.40	1.02	价格区间: 5日:12.11 	10日:8.59  	20日:5.62  	30日:30.73 	60日:30.73 	120日:8.94  	250日:35.51 		,当前价：91.05	,当前：2022-04-08 12:27:47
        huaGong_youJiGui.put("603260", "合盛硅业");//292	非金属材料   1.16	1053.33	1.42	价格区间: 5日:21.20 	10日:8.69  	20日:6.24  	30日:4.96  	60日:4.96  	120日:3.13  	250日:25.75 		,当前价：98.06	,当前：2022-04-08 12:27:48
    }

    /**
     * huaGong_foHuaGong ["氟化工"]：21;
     */
    public static Map<String, String> huaGong_foHuaGong = new HashMap<>();

    static {
        huaGong_foHuaGong.put("600096", "云天化  ");//464	化肥行业     6.08	518.64	6.68	价格区间: 5日:89.25 	10日:92.71 	20日:93.84 	30日:93.84 	60日:96.69 	120日:78.05 	250日:70.11 		,当前价：28.25	,当前：2022-04-07 11:36:33
        huaGong_foHuaGong.put("002326", "永太科技");//455	化学制品     0.16	323.98	1.48	价格区间: 5日:15.81 	10日:33.07 	20日:64.07 	30日:64.07 	60日:44.16 	120日:19.22 	250日:38.76 		,当前价：36.96	,当前：2022-04-07 11:36:35
        huaGong_foHuaGong.put("002738", "中矿资源");//424	小金属       -0.32	285.03	1.61	价格区间: 5日:11.83 	10日:7.91  	20日:7.08  	30日:4.92  	60日:56.27 	120日:59.16 	250日:72.67 		,当前价：87.52	,当前：2022-04-07 11:36:37
        huaGong_foHuaGong.put("600141", "兴发集团");//353	化肥行业     2.68	379.65	2.22	价格区间: 5日:44.58 	10日:33.60 	20日:27.85 	30日:14.35 	60日:35.82 	120日:17.78 	250日:46.24 		,当前价：34.15	,当前：2022-04-07 11:36:39
        huaGong_foHuaGong.put("002759", "天际股份");//350	家电行业     0.3 	106.89	2.61	价格区间: 5日:8.81  	10日:6.42  	20日:42.52 	30日:42.52 	60日:42.52 	120日:19.52 	250日:34.74 		,当前价：26.58	,当前：2022-04-07 11:36:41
    }

    /**
     * huaGong_linHuaGong ["磷化工"]：26;
     */
    public static Map<String, String> huaGong_linHuaGong = new HashMap<>();

    static {
        huaGong_linHuaGong.put("000422", "湖北宜化");//486	化学原料     -2.23	212.44	1.9 	价格区间: 5日:63.57 	10日:75.79 	20日:80.56 	30日:81.82 	60日:82.65 	120日:38.80 	250日:63.40 		,当前价：23.66	,当前：2022-04-12 11:02:18
        huaGong_linHuaGong.put("600096", "云天化  ");//449	化肥行业     -0.94	523.41	2.16	价格区间: 5日:65.03 	10日:75.96 	20日:79.34 	30日:80.81 	60日:88.54 	120日:81.45 	250日:71.55 		,当前价：28.51	,当前：2022-04-12 11:02:19
        huaGong_linHuaGong.put("002895", "川恒股份");//402	化肥行业     0.4 	123.58	4.53	价格区间: 5日:89.64 	10日:90.16 	20日:91.81 	30日:78.09 	60日:70.47 	120日:22.19 	250日:36.95 		,当前价：25.3	,当前：2022-04-12 11:02:20
        huaGong_linHuaGong.put("600141", "兴发集团");//379	化肥行业     -1.3	414.78	2.33	价格区间: 5日:82.90 	10日:83.36 	20日:83.36 	30日:57.76 	60日:66.64 	120日:33.08 	250日:54.24 		,当前价：37.31	,当前：2022-04-12 11:02:21
        huaGong_linHuaGong.put("600596", "新安股份");//324	农药兽药     -2.81	220.39	1.98	价格区间: 5日:20.81 	10日:31.74 	20日:56.07 	30日:56.21 	60日:71.01 	120日:42.99 	250日:42.95 		,当前价：26.93	,当前：2022-04-12 11:02:23
    }

    /**
     * huaGong 化工
     */
    public static Map<String, String> huaGong = new HashMap<>();

    static {
        huaGong.putAll(huaGong_foHuaGong);//氟化工
        huaGong.putAll(huaGong_huaGongYuanLiao);//化工原料
        huaGong.putAll(huaGong_taiBaiFen);//钛白粉
        huaGong.putAll(huaGong_youJiGui);//有机硅
        huaGong.putAll(huaGong_linHuaGong);//磷化工
    }

    /**
     * nongYe_shuiChanYangZhi ["水产养殖"]：6;
     */
    public static Map<String, String> nongYe_shuiChanYangZhi = new HashMap<>();

    static {
        nongYe_shuiChanYangZhi.put("001313", "粤海饲料");//286	农牧饲渔     7.41	95.34	0.85	价格区间: 5日:100.00	10日:51.61 	20日:19.83 	30日:19.63 	60日:53.35 	120日:53.35 	250日:53.35 		,当前价：13.62	,当前：2022-04-18 10:07:26
        nongYe_shuiChanYangZhi.put("002385", "大北农  ");//257	农牧饲渔     1.85	364.43	0.58	价格区间: 5日:93.81 	10日:81.98 	20日:86.67 	30日:81.09 	60日:58.42 	120日:39.61 	250日:48.56 		,当前价：8.8	,当前：2022-04-18 10:07:28
        nongYe_shuiChanYangZhi.put("600438", "通威股份");//245	光伏设备     0.53	1787.11	0.77	价格区间: 5日:80.85 	10日:25.95 	20日:20.08 	30日:18.47 	60日:34.26 	120日:16.39 	250日:30.72 		,当前价：39.7	,当前：2022-04-18 10:07:29
    }
    /**
     * 农业-转基因 ["转基因"]：8;
     */
    public static Map<String, String> nongYe_zhuanJiYin = new HashMap<>();
    static {
        nongYe_zhuanJiYin.put("600313", "农发种业");//367	农牧饲渔     9.98	96.64	2.18	价格区间: 5日:100.00	10日:79.92 	20日:87.78 	30日:89.28 	60日:89.35 	120日:89.66 	250日:90.56 		,当前价：8.93	,当前：2022-04-18 10:12:23
        nongYe_zhuanJiYin.put("600596", "新安股份");//322	农药兽药     0.04	231.11	1.39	价格区间: 5日:62.66 	10日:71.94 	20日:71.76 	30日:78.74 	60日:85.82 	120日:51.95 	250日:46.19 		,当前价：28.24	,当前：2022-04-18 10:12:24
        nongYe_zhuanJiYin.put("002041", "登海种业");//276	农牧饲渔     3.68	215.86	0.86	价格区间: 5日:76.70 	10日:72.76 	20日:83.49 	30日:86.29 	60日:86.29 	120日:55.68 	250日:69.29 		,当前价：24.53	,当前：2022-04-18 10:12:25
        nongYe_zhuanJiYin.put("002100", "天康生物");//263	农牧饲渔     4.85	161.14	0.66	价格区间: 5日:91.01 	10日:55.97 	20日:47.89 	30日:63.00 	60日:64.76 	120日:76.83 	250日:82.24 		,当前价：11.9	,当前：2022-04-18 10:12:26
        nongYe_zhuanJiYin.put("002385", "大北农  ");//257	农牧饲渔     1.85	364.43	0.58	价格区间: 5日:93.81 	10日:81.98 	20日:86.67 	30日:81.09 	60日:58.42 	120日:39.37 	250日:48.15 		,当前价：8.8	,当前：2022-04-18 10:12:28
    }

    /**
     * nongYe_caoGanLin ["草甘膦"]：10;
     */
    public static Map<String, String> nongYe_caoGanLin = new HashMap<>();

    static {
        nongYe_caoGanLin.put("600141", "兴发集团");//382	化肥行业     10   	414.56	null	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:52.54 	60日:64.44 	120日:31.99 	250日:53.67 		,当前价：37.29	,当前：2022-04-08 10:59:36
        nongYe_caoGanLin.put("600389", "江山股份");//354	农药兽药     5.31	142.53	null	价格区间: 5日:92.97 	10日:94.95 	20日:97.54 	30日:97.54 	60日:90.14 	120日:91.48 	250日:62.71 		,当前价：47.99	,当前：2022-04-08 10:59:37
        nongYe_caoGanLin.put("600596", "新安股份");//333	农药兽药     4.55	231.36	null	价格区间: 5日:93.42 	10日:67.96 	20日:79.38 	30日:79.35 	60日:86.33 	120日:52.11 	250日:46.25 		,当前价：28.27	,当前：2022-04-08 10:59:38
        nongYe_caoGanLin.put("603077", "和邦生物");//267	化学原料     2.03	309.98	null	价格区间: 5日:36.36 	10日:48.15 	20日:41.27 	30日:27.96 	60日:26.26 	120日:34.82 	250日:55.52 		,当前价：3.51	,当前：2022-04-08 10:59:39
    }

    /**
     * nongYe_zhuRou ["猪肉概念"]：26;
     */
    public static Map<String, String> nongYe_zhuRou = new HashMap<>();

    static {
        nongYe_zhuRou.put("603363", "傲农生物");//390	农牧饲渔     4.26	179.30	2.66	价格区间: 5日:90.61 	10日:90.61 	20日:94.59 	30日:95.50 	60日:96.28 	120日:97.38 	250日:97.69 		,当前价：25.96	,当前：2022-04-18 10:14:29
        nongYe_zhuRou.put("603477", "巨星农牧");//368	农牧饲渔     5.6 	127.79	1.88	价格区间: 5日:89.49 	10日:57.23 	20日:64.97 	30日:70.11 	60日:77.75 	120日:83.43 	250日:85.46 		,当前价：25.25	,当前：2022-04-18 10:14:30
        nongYe_zhuRou.put("002100", "天康生物");//263	农牧饲渔     4.85	161.14	0.66	价格区间: 5日:94.38 	10日:57.86 	20日:49.30 	30日:64.00 	60日:65.71 	120日:77.45 	250日:82.72 		,当前价：11.9	,当前：2022-04-18 10:14:31
        nongYe_zhuRou.put("002385", "大北农  ");//257	农牧饲渔     1.85	364.43	0.58	价格区间: 5日:96.91 	10日:84.68 	20日:88.67 	30日:82.59 	60日:59.50 	120日:40.10 	250日:48.97 		,当前价：8.8	,当前：2022-04-18 10:14:32
        nongYe_zhuRou.put("002124", "天邦股份");//255	农牧饲渔     1.62	161.67	2.12	价格区间: 5日:87.18 	10日:81.60 	20日:87.41 	30日:89.09 	60日:89.12 	120日:89.12 	250日:61.23 		,当前价：8.79	,当前：2022-04-18 10:14:34
    }
    /**
     * nongYe_jiRou ["鸡肉概念"]：13;
     */
    public static Map<String, String> nongYe_jiRou = new HashMap<>();

    static {
        nongYe_jiRou.put("603477", "巨星农牧");//368	农牧饲渔     5.6 	127.79	1.88	价格区间: 5日:95.40 	10日:50.71 	20日:60.89 	30日:66.63 	60日:75.16 	120日:81.51 	250日:83.77 		,当前价：25.25	,当前：2022-04-18 09:58:22
        nongYe_jiRou.put("002100", "天康生物");//263	农牧饲渔     4.85	161.14	0.66	价格区间: 5日:82.35 	10日:49.06 	20日:42.72 	30日:59.33 	60日:61.27 	120日:74.53 	250日:80.48 		,当前价：11.9	,当前：2022-04-18 09:58:24
        nongYe_jiRou.put("002567", "唐人神  ");//240	农牧饲渔     4.68	126.75	1.52	价格区间: 5日:94.38 	10日:59.15 	20日:65.59 	30日:72.44 	60日:77.43 	120日:83.83 	250日:85.07 		,当前价：10.51	,当前：2022-04-18 09:58:25
        nongYe_jiRou.put("002746", "仙坛股份");//235	农牧饲渔     4.42	75.21	1.54	价格区间: 5日:65.82 	10日:26.80 	20日:26.80 	30日:32.38 	60日:18.48 	120日:42.42 	250日:43.61 		,当前价：8.74	,当前：2022-04-18 09:58:26
        nongYe_jiRou.put("002234", "民和股份");//228	农牧饲渔     7.3 	66.13	1.09	价格区间: 5日:88.44 	10日:73.27 	20日:83.00 	30日:85.42 	60日:85.42 	120日:84.56 	250日:86.20 		,当前价：18.95	,当前：2022-04-18 09:58:28
        nongYe_jiRou.put("000876", "新希望  ");//219	农牧饲渔     2.05	718.58	1.31	价格区间: 5日:72.17 	10日:34.30 	20日:45.92 	30日:61.12 	60日:51.76 	120日:49.12 	250日:59.57 		,当前价：15.95	,当前：2022-04-18 09:58:29
    }

    /**
     * nongYe_shengTaiNongYe ["生态农业"]：21;
     */
    public static Map<String, String> nongYe_shengTaiNongYe = new HashMap<>();

    static {
        nongYe_shengTaiNongYe.put("000893", "亚钾国际");//455	化肥行业     6.93	300.11	3.67	价格区间: 5日:91.30 	10日:93.99 	20日:96.13 	30日:96.13 	60日:97.00 	120日:97.43 	250日:97.94 		,当前价：39.65	,当前：2022-04-07 11:41:23
        nongYe_shengTaiNongYe.put("002539", "云图控股");//285	化肥行业     2.93	142.12	1.37	价格区间: 5日:72.83 	10日:85.80 	20日:89.88 	30日:76.29 	60日:71.61 	120日:37.03 	250日:38.04 		,当前价：14.07	,当前：2022-04-07 11:41:25
        nongYe_shengTaiNongYe.put("000505", "京粮控股");//278	农牧饲渔     -4.42	77.06	2.99	价格区间: 5日:28.06 	10日:48.35 	20日:59.77 	30日:59.77 	60日:61.99 	120日:62.15 	250日:62.15 		,当前价：10.6	,当前：2022-04-07 11:41:26
//        nongYe_shengTaiNongYe.put("002470", "ST金正  ");//272	化肥行业     1.13	88.07	1.69	价格区间: 5日:50.00 	10日:21.74 	20日:37.50 	30日:37.50 	60日:42.00 	120日:46.79 	250日:63.33 		,当前价：2.68	,当前：2022-04-07 11:41:27
        nongYe_shengTaiNongYe.put("000902", "新洋丰  ");//259	化肥行业     3.74	239.12	1.2 	价格区间: 5日:90.13 	10日:94.38 	20日:96.01 	30日:96.01 	60日:96.01 	120日:72.34 	250日:42.01 		,当前价：18.33	,当前：2022-04-07 11:41:28
    }

    /**
     * nongYe_huangChongFangZhi ["蝗虫防治"]：10;
     */
    public static Map<String, String> nongYe_huangChongFangZhi = new HashMap<>();

    static {
        nongYe_huangChongFangZhi.put("600389", "江山股份");//354	农药兽药     6.54	144.19	2.4 	价格区间: 5日:96.77 	10日:97.62 	20日:98.81 	30日:98.81 	60日:94.06 	120日:94.84 	250日:63.81 		,当前价：48.55	,当前：2022-04-08 12:12:00
        nongYe_huangChongFangZhi.put("000009", "中国宝安");//290	综合行业     -2.14	271.59	1.29	价格区间: 5日:12.67 	10日:10.61 	20日:9.36  	30日:4.51  	60日:4.08  	120日:1.61  	250日:9.17  		,当前价：10.53	,当前：2022-04-08 12:12:01
    }

    /**
     * nongYe_nongYeZhongZhi ["农业种植"]：30;
     */
    public static Map<String, String> nongYe_nongYeZhongZhi = new HashMap<>();

    static {
        nongYe_nongYeZhongZhi.put("002326", "永太科技");//449	化学制品     -2.82	313.64	3.24	价格区间: 5日:25.80 	10日:21.14 	20日:45.86 	30日:56.23 	60日:42.01 	120日:16.86 	250日:36.98 		,当前价：35.78	,当前：2022-04-11 13:44:30
        nongYe_nongYeZhongZhi.put("600313", "农发种业");//326	农牧饲渔     9.67	83.44	4.03	价格区间: 5日:30.74 	10日:55.17 	20日:62.44 	30日:63.02 	60日:63.26 	120日:64.35 	250日:67.44 		,当前价：7.71	,当前：2022-04-11 13:44:31
        nongYe_nongYeZhongZhi.put("000937", "冀中能源");//322	煤炭行业     -1.6	260.42	7.14	价格区间: 5日:48.53 	10日:60.67 	20日:80.11 	30日:72.68 	60日:81.27 	120日:81.27 	250日:55.54 		,当前价：7.37	,当前：2022-04-11 13:44:32
        nongYe_nongYeZhongZhi.put("002717", "岭南股份");//304	环保行业     1.36	63.01	3.87	价格区间: 5日:92.31 	10日:93.33 	20日:94.12 	30日:55.81 	60日:23.88 	120日:42.91 	250日:42.91 		,当前价：3.74	,当前：2022-04-11 13:44:34
        nongYe_nongYeZhongZhi.put("002539", "云图控股");//298	化肥行业     -1.95	147.68	13.01	价格区间: 5日:68.47 	10日:77.70 	20日:82.12 	30日:82.12 	60日:82.12 	120日:48.42 	250日:42.72 		,当前价：14.62	,当前：2022-04-11 13:44:35
        nongYe_nongYeZhongZhi.put("002041", "登海种业");//277	农牧饲渔     7.9 	218.77	2.92	价格区间: 5日:84.94 	10日:84.94 	20日:92.68 	30日:92.68 	60日:92.68 	120日:59.80 	250日:72.14 		,当前价：24.86	,当前：2022-04-11 13:44:36
    }

    /**
     * nongYe 农业:转基因,草甘膦,水产养殖,磷化工,鸡肉概念,猪肉概念,生态农业
     */
    public static Map<String, String> nongYe = new HashMap<>();

    static {
        nongYe.putAll(nongYe_zhuanJiYin);//转基因
        nongYe.putAll(nongYe_caoGanLin);//草甘膦
        nongYe.putAll(nongYe_shuiChanYangZhi);//水产养殖
        nongYe.putAll(nongYe_jiRou);//鸡肉概念
        nongYe.putAll(nongYe_zhuRou);//猪肉概念
        nongYe.putAll(nongYe_shengTaiNongYe);//生态农业
        nongYe.putAll(nongYe_huangChongFangZhi);//蝗虫防治
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(keRanBing);//可燃冰
        all.putAll(youJiaXiangGuan);//油价相关
        all.putAll(gangTie_diTanYeJin);//低碳冶金
        all.putAll(jinShu_jiBenJinShu);//基本金属
        all.putAll(qiTi_qingNengYuan);//氢能源
        all.putAll(qiTi_haiQi);//氦气概念
        all.putAll(meiTan_meiHuaGong);//煤化工
        all.putAll(huaGong);//化工
        all.putAll(nongYe); //农业:转基因,草甘膦,水产养殖,磷化工
    }

    public static void main(String[] args) {
        String spDate = null;
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);
//                String date = "2022-04-07";
//                String spDate = "2022-04-08";//特定日期：下一交易日
        KlineService.checkMaDemo(all, date,spDate);// all   huaGong   huaGong_linHuaGong
    }
}
