package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：科技-传媒
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStKeJiChuanMei {
    /**
     * yuanYuZhou["元宇宙概念"]：31;
     */
    public static Map<String, String> yuanYuZhou = new HashMap<>();

    static {
        yuanYuZhou.put("000665", "湖北广电");//395	文化传媒	10.05	88.86	25.36	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:86.42 	60日:42.63 	120日:56.87 	250日:56.87 		,当前价：8.76	,当前：2022-03-28 13:15:47
        yuanYuZhou.put("002354", "天娱数科");//375	游戏    	4.98	87.60	29.28	价格区间: 5日:71.72 	10日:73.83 	20日:59.85 	30日:65.13 	60日:33.67 	120日:56.47 	250日:57.79 		,当前价：5.27	,当前：2022-03-28 13:15:49
        yuanYuZhou.put("000810", "创维数字");//370	家电行业	-2.01	155.24	4.02	价格区间: 5日:51.85 	10日:77.06 	20日:77.65 	30日:82.43 	60日:81.31 	120日:86.55 	250日:86.55 		,当前价：14.6	,当前：2022-03-28 13:15:50
        yuanYuZhou.put("603466", "风语筑  ");//365	文化传媒	3.6 	97.26	8.43	价格区间: 5日:67.21 	10日:78.87 	20日:72.78 	30日:70.34 	60日:24.28 	120日:41.90 	250日:46.76 		,当前价：23.05	,当前：2022-03-28 13:15:51
        yuanYuZhou.put("002036", "联创电子");//318	光学光电子	-3.63	163.57	6.41	价格区间: 5日:5.08  	10日:35.88 	20日:20.17 	30日:18.18 	60日:8.97  	120日:8.26  	250日:35.44 		,当前价：15.39	,当前：2022-03-28 13:15:52
    }
    /**
     * guangDian ["广电"]：13;
     */
    public static Map<String, String> guangDian = new HashMap<>();

    static {
        guangDian.put("000665", "湖北广电");//395	文化传媒	10.05	88.86	25.36	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:86.42 	60日:42.63 	120日:56.87 	250日:56.87 		,当前价：8.76	,当前：2022-03-28 13:11:22
        guangDian.put("600996", "贵广网络");//376	文化传媒	10.03	92.34	4.05	价格区间: 5日:100.00	10日:100.00	20日:52.00 	30日:41.56 	60日:60.03 	120日:63.87 	250日:63.87 		,当前价：8.78	,当前：2022-03-28 13:11:24
        guangDian.put("000810", "创维数字");//370	家电行业	-2.01	155.24	4.02	价格区间: 5日:51.85 	10日:77.06 	20日:77.65 	30日:82.43 	60日:81.31 	120日:86.55 	250日:86.55 		,当前价：14.6	,当前：2022-03-28 13:11:25
    }
    /**
     * huaWeiOLa ["华为欧拉"]：2;
     */
    public static Map<String, String> huaWeiOLa = new HashMap<>();

    static {
        huaWeiOLa.put("002261", "拓维信息");//251	软件开发	6.99	91.73	17.11	价格区间: 5日:71.43 	10日:72.97 	20日:43.20 	30日:31.21 	60日:19.71 	120日:16.17 	250日:25.63 		,当前价：7.35	,当前：2022-03-28 12:13:22
        huaWeiOLa.put("600536", "中国软件");//196	互联网服务	2.23	197.18	3.41	价格区间: 5日:49.82 	10日:68.42 	20日:25.87 	30日:25.87 	60日:16.61 	120日:13.96 	250日:9.61  		,当前价：39.87	,当前：2022-03-28 12:13:24
    }
    /**
     * hongMeng ["鸿蒙概念"]：12;
     */
    public static Map<String, String> hongMeng = new HashMap<>();

    static {
        hongMeng.put("000681", "视觉中国");//345	文化传媒	4.88	111.46	10.45	价格区间: 5日:77.17 	10日:86.00 	20日:82.01 	30日:55.93 	60日:18.71 	120日:25.54 	250日:31.11 		,当前价：15.91	,当前：2022-03-28 12:03:32
        hongMeng.put("002268", "卫士通  ");//329	软件开发	-4.4	362.13	3.81	价格区间: 5日:2.20  	10日:31.83 	20日:37.90 	30日:41.96 	60日:29.20 	120日:21.91 	250日:54.66 		,当前价：42.79	,当前：2022-03-28 12:03:34
        hongMeng.put("003032", "传智教育");//262	教育    	10.03	63.55	11.2	价格区间: 5日:100.00	10日:100.00	20日:44.12 	30日:34.80 	60日:22.86 	120日:16.11 	250日:7.73  		,当前价：15.79	,当前：2022-03-28 12:03:35
        hongMeng.put("000158", "常山北明");//261	综合行业	9.97	109.35	37.4	价格区间: 5日:100.00	10日:100.00	20日:63.11 	30日:43.50 	60日:41.33 	120日:34.62 	250日:23.72 		,当前价：6.84	,当前：2022-03-28 12:03:36
        hongMeng.put("002261", "拓维信息");//252	软件开发	6.99	91.73	17.11	价格区间: 5日:71.43 	10日:72.97 	20日:43.20 	30日:31.21 	60日:19.71 	120日:16.17 	250日:25.63 		,当前价：7.35	,当前：2022-03-28 12:03:37
        hongMeng.put("002624", "完美世界");//236	游戏    	1.09	251.03	3.74	价格区间: 5日:22.55 	10日:70.52 	20日:70.52 	30日:59.25 	60日:18.62 	120日:14.98 	250日:13.10 		,当前价：12.94	,当前：2022-03-28 12:03:38
        hongMeng.put("002123", "梦网科技");//214	通信服务	1.27	102.28	5.25	价格区间: 5日:50.56 	10日:55.97 	20日:24.51 	30日:20.72 	60日:11.85 	120日:7.24  	250日:5.68  		,当前价：12.75	,当前：2022-03-28 12:03:39
        hongMeng.put("000997", "新大陆  ");//200	互联网服务	0.24	169.26	3.1 	价格区间: 5日:17.44 	10日:13.23 	20日:26.57 	30日:26.57 	60日:24.93 	120日:39.00 	250日:54.02 		,当前价：16.4	,当前：2022-03-28 12:03:40
    }
    /**
     * netGaiNian ["NFT概念"]：13;
     */
    public static Map<String, String> nft = new HashMap<>();

    static {
        nft.put("603466", "风语筑  ");//365	文化传媒	3.37	97.05	8.43	价格区间: 5日:75.97 	10日:84.52 	20日:77.99 	30日:75.37 	60日:26.01 	120日:43.23 	250日:48.03 		,当前价：23.0	,当前：2022-03-28 09:59:27
        nft.put("000681", "视觉中国");//339	文化传媒	2.97	109.43	10.45	价格区间: 5日:60.87 	10日:76.00 	20日:72.87 	30日:49.69 	60日:16.62 	120日:23.63 	250日:29.35 		,当前价：15.62	,当前：2022-03-28 09:59:28
        nft.put("600986", "浙文互联");//322	文化传媒	2.15	81.73	4.39	价格区间: 5日:46.58 	10日:70.90 	20日:73.47 	30日:73.47 	60日:23.38 	120日:38.54 	250日:41.49 		,当前价：6.18	,当前：2022-03-28 09:59:30
    }

    /**
     * ["虚拟数字人"]：9;
     */
    public static Map<String, String> xunNiShuZiRen = new HashMap<>();

    static {
        xunNiShuZiRen.put("002354", "天娱数科");//370	游戏    	3.78	86.60	29.28	价格区间: 5日:85.86 	10日:86.92 	20日:70.45 	30日:74.34 	60日:38.44 	120日:59.60 	250日:60.82 		,当前价：5.21	,当前：2022-03-28 09:55:38
        xunNiShuZiRen.put("603466", "风语筑  ");//365	文化传媒	3.37	97.05	8.43	价格区间: 5日:77.60 	10日:85.56 	20日:78.96 	30日:76.31 	60日:26.34 	120日:43.48 	250日:48.21 		,当前价：23.0	,当前：2022-03-28 09:55:39
        xunNiShuZiRen.put("600986", "浙文互联");//322	文化传媒	2.15	81.73	4.39	价格区间: 5日:46.58 	10日:70.90 	20日:73.47 	30日:73.47 	60日:23.38 	120日:38.54 	250日:41.49 		,当前价：6.18	,当前：2022-03-28 09:55:41
        xunNiShuZiRen.put("002059", "云南旅游");//299	旅游酒店	-0.91	66.11	3.09	价格区间: 5日:62.71 	10日:64.76 	20日:67.83 	30日:43.33 	60日:46.22 	120日:53.75 	250日:55.64 		,当前价：6.53	,当前：2022-03-28 09:55:42
        xunNiShuZiRen.put("002230", "科大讯飞");//150	软件开发	-0.71	1072.68	3.21	价格区间: 5日:14.54 	10日:45.56 	20日:35.23 	30日:31.38 	60日:25.61 	120日:17.47 	250日:11.34 		,当前价：46.15	,当前：2022-03-28 09:55:52
    }

    /**
     * all:NFT概念,虚拟数字人,鸿蒙概念,华为欧拉,广电
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(nft);//NFT概念
        all.putAll(xunNiShuZiRen);//虚拟数字人
        all.putAll(hongMeng);//鸿蒙概念
        all.putAll(huaWeiOLa);//华为欧拉
        all.putAll(guangDian);//广电
        all.putAll(yuanYuZhou);//元宇宙概念
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStKeJiChuanMei.all, date);//all nongYe
    }
}
