package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：科技
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStKeJi {

    /**
     * xinNengYuan_dianChi ["固态电池"]：11;
     */
    public static Map<String, String> xinNengYuan_guTaiDianChi = new HashMap<>();

    static {
        xinNengYuan_guTaiDianChi.put("601127", "小康股份");//386	汽车整车	4.53	611.97	2.07	价格区间: 5日:99.84 	10日:99.22 	20日:99.39 	30日:82.71 	60日:35.53 	120日:20.25 	250日:39.42 		,当前价：45.0	,当前：2022-04-01 10:47:40
        xinNengYuan_guTaiDianChi.put("002466", "天齐锂业");//344	能源金属	0.65	1210.04	1.57	价格区间: 5日:61.52 	10日:44.49 	20日:40.79 	30日:27.58 	60日:21.51 	120日:14.88 	250日:45.82 		,当前价：81.92	,当前：2022-04-01 10:47:41
        xinNengYuan_guTaiDianChi.put("600884", "杉杉股份");//317	电子元件	0.82	603.23	2.31	价格区间: 5日:75.25 	10日:75.25 	20日:82.91 	30日:67.86 	60日:41.60 	120日:18.47 	250日:49.95 		,当前价：28.15	,当前：2022-04-01 10:47:42
        xinNengYuan_guTaiDianChi.put("002709", "天赐材料");//312	化学制品	3.6 	937.33	2.85	价格区间: 5日:77.67 	10日:39.50 	20日:60.08 	30日:60.08 	60日:42.67 	120日:17.47 	250日:44.17 		,当前价：97.38	,当前：2022-04-01 10:47:44
        xinNengYuan_guTaiDianChi.put("000009", "中国宝安");//294	综合行业	1.97	294.29	2.45	价格区间: 5日:48.81 	10日:32.80 	20日:33.99 	30日:21.25 	60日:19.10 	120日:7.34  	250日:13.40 		,当前价：11.41	,当前：2022-04-01 10:47:45
        xinNengYuan_guTaiDianChi.put("002594", "比亚迪  ");//273	汽车整车	2.71	6871.17	1.98	价格区间: 5日:96.83 	10日:58.34 	20日:71.16 	30日:62.70 	60日:42.25 	120日:23.87 	250日:51.01 		,当前价：236.03	,当前：2022-04-01 10:47:46
        xinNengYuan_guTaiDianChi.put("002091", "江苏国泰");//271	贸易行业	3.78	158.70	4.12	价格区间: 5日:89.83 	10日:43.09 	20日:33.94 	30日:20.36 	60日:11.67 	120日:11.67 	250日:36.42 		,当前价：10.15	,当前：2022-04-01 10:47:47
        xinNengYuan_guTaiDianChi.put("002460", "赣锋锂业");//266	能源金属	1.73	1837.39	2.6 	价格区间: 5日:85.99 	10日:70.08 	20日:51.24 	30日:34.70 	60日:34.70 	120日:19.75 	250日:31.61 		,当前价：127.82	,当前：2022-04-01 10:47:48
        xinNengYuan_guTaiDianChi.put("002074", "国轩高科");//264	电池    	0.84	577.65	1.37	价格区间: 5日:55.56 	10日:28.80 	20日:50.64 	30日:24.37 	60日:13.82 	120日:8.14  	250日:12.48 		,当前价：34.7	,当前：2022-04-01 10:47:49
    }

    /**
     * xinNengYuan_daoPianDianChi ["刀片电池"]：4;
     */
    public static Map<String, String> xinNengYuan_daoPianDianChi = new HashMap<>();

    static {
        xinNengYuan_daoPianDianChi.put("002466", "天齐锂业");//344	能源金属     0.65	1213.44	1.38	价格区间: 5日:34.18 	10日:26.09 	20日:39.98 	30日:20.08 	60日:20.08 	120日:10.83 	250日:44.03 		,当前价：82.15	,当前：2022-04-07 11:33:00
        xinNengYuan_daoPianDianChi.put("002824", "和胜股份");//332	有色金属     -2.15	60.61	1.01	价格区间: 5日:4.61  	10日:2.83  	20日:27.67 	30日:19.53 	60日:12.13 	120日:10.84 	250日:46.73 		,当前价：32.81	,当前：2022-04-07 11:33:02
//      xinNengYuan_daoPianDianChi.put("603032", "*ST德新 ");//300	铁路公路     -1.82	99.57	1.02	价格区间: 5日:0.16  	10日:0.09  	20日:35.83 	30日:32.17 	60日:17.95 	120日:42.61 	250日:58.95 		,当前价：59.5	,当前：2022-04-07 11:33:04
        xinNengYuan_daoPianDianChi.put("002594", "比亚迪  ");//274	汽车整车     -0.17	7030.12	2.22	价格区间: 5日:79.31 	10日:65.53 	20日:76.14 	30日:67.08 	60日:53.17 	120日:25.54 	250日:52.08 		,当前价：241.49	,当前：2022-04-07 11:33:06
    }



    /**
     * dianLi_chouShuiXuNeng ["抽水蓄能"]：19;
     */
    public static Map<String, String> dianLi_chouShuiXuNeng = new HashMap<>();

    static {
        dianLi_chouShuiXuNeng.put("002060", "粤水电  ");//368	工程建设	10.02	113.49	3.53	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：9.44	,当前：2022-03-30 13:50:13
        dianLi_chouShuiXuNeng.put("600032", "浙江新能");//358	电力行业	1.89	302.64	4.62	价格区间: 5日:57.58 	10日:64.41 	20日:71.43 	30日:71.43 	60日:71.43 	120日:46.39 	250日:66.95 		,当前价：14.55	,当前：2022-03-30 13:50:15
        dianLi_chouShuiXuNeng.put("000400", "许继电气");//326	电网设备	7.79	195.41	4.47	价格区间: 5日:88.08 	10日:65.38 	20日:42.64 	30日:39.75 	60日:19.72 	120日:15.80 	250日:33.62 		,当前价：19.38	,当前：2022-03-30 13:50:16
        dianLi_chouShuiXuNeng.put("000875", "吉电股份");//313	电力行业	0.78	251.12	1.07	价格区间: 5日:57.58 	10日:34.55 	20日:60.87 	30日:65.88 	60日:67.42 	120日:70.36 	250日:75.98 		,当前价：9.0	,当前：2022-03-30 13:50:17
        dianLi_chouShuiXuNeng.put("601669", "中国电建");//290	工程建设	5.19	1115.30	3.55	价格区间: 5日:93.10 	10日:73.97 	20日:41.83 	30日:25.70 	60日:20.25 	120日:34.03 	250日:57.48 		,当前价：7.29	,当前：2022-03-30 13:50:18
        dianLi_chouShuiXuNeng.put("600956", "新天绿能");//266	燃气    	-0.07	562.75	0.89	价格区间: 5日:26.98 	10日:49.45 	20日:44.60 	30日:44.60 	60日:26.22 	120日:15.25 	250日:23.76 		,当前价：13.44	,当前：2022-03-30 13:50:20
        dianLi_chouShuiXuNeng.put("600875", "东方电气");//262	电源设备	3.46	438.22	1.96	价格区间: 5日:34.90 	10日:28.42 	20日:25.87 	30日:24.52 	60日:9.82  	120日:8.57  	250日:29.93 		,当前价：14.05	,当前：2022-03-30 13:50:22
        dianLi_chouShuiXuNeng.put("002202", "金风科技");//210	风电设备	3.24	564.89	1.95	价格区间: 5日:52.03 	10日:41.29 	20日:23.44 	30日:23.19 	60日:16.16 	120日:7.76  	250日:23.13 		,当前价：13.37	,当前：2022-03-30 13:50:27
    }

    /**
     * shuZiHuoBi 概念：["数字货币"];股票个数：24;
     */
    public static Map<String, String> shuZi_shuZiHuoBi = new HashMap<>();

    static {
        shuZi_shuZiHuoBi.put("603123", "翠微股份");//454	商业百货     -1.48	138.10	0.99	价格区间: 5日:12.45 	10日:23.83 	20日:30.48 	30日:30.48 	60日:33.40 	120日:46.17 	250日:46.17 		,当前价：17.29	,当前：2022-04-12 10:50:27
        shuZi_shuZiHuoBi.put("003040", "楚天龙  ");//432	通信设备     -1.58	108.97	2.06	价格区间: 5日:50.44 	10日:74.61 	20日:74.61 	30日:74.61 	60日:39.94 	120日:39.94 	250日:35.21 		,当前价：23.63	,当前：2022-04-12 10:50:29
        shuZi_shuZiHuoBi.put("002537", "海联金汇");//428	汽车零部件   -1.04	122.33	1.11	价格区间: 5日:15.96 	10日:10.24 	20日:33.71 	30日:42.66 	60日:54.08 	120日:64.18 	250日:64.66 		,当前价：10.42	,当前：2022-04-12 10:50:30
        shuZi_shuZiHuoBi.put("002268", "卫士通  ");//337	软件开发     0.91	355.44	1.4 	价格区间: 5日:4.89  	10日:6.62  	20日:16.03 	30日:23.50 	60日:28.89 	120日:15.81 	250日:51.67 		,当前价：42.0	,当前：2022-04-12 10:50:31
        shuZi_shuZiHuoBi.put("000948", "南天信息");//302	软件开发     2.14	64.05	3.23	价格区间: 5日:75.00 	10日:80.85 	20日:80.85 	30日:80.85 	60日:50.67 	120日:56.73 	250日:68.08 		,当前价：16.24	,当前：2022-04-12 10:50:32
        shuZi_shuZiHuoBi.put("002987", "京北方  ");//296	软件开发     -0.56	71.73	0.82	价格区间: 5日:10.07 	10日:10.07 	20日:10.07 	30日:10.07 	60日:5.63  	120日:28.80 	250日:33.68 		,当前价：31.89	,当前：2022-04-12 10:50:33
        shuZi_shuZiHuoBi.put("002197", "证通电子");//289	计算机设备   -3.1	67.27	1.71	价格区间: 5日:14.35 	10日:22.81 	20日:19.42 	30日:14.53 	60日:30.38 	120日:41.38 	250日:41.43 		,当前价：10.95	,当前：2022-04-12 10:50:34
        shuZi_shuZiHuoBi.put("000676", "智度股份");//284	文化传媒     0.49	79.27	1.5 	价格区间: 5日:5.17  	10日:5.17  	20日:5.17  	30日:3.87  	60日:1.94  	120日:13.88 	250日:25.67 		,当前价：6.21	,当前：2022-04-12 10:50:35
        shuZi_shuZiHuoBi.put("002104", "恒宝股份");//276	通信设备     -1.16	77.36	0.8 	价格区间: 5日:8.94  	10日:7.84  	20日:7.84  	30日:25.40 	60日:39.49 	120日:44.75 	250日:47.06 		,当前价：11.1	,当前：2022-04-12 10:50:36
        shuZi_shuZiHuoBi.put("002049", "紫光国微");//260	半导体       3.95	1096.96	3.56	价格区间: 5日:17.38 	10日:14.92 	20日:12.46 	30日:10.32 	60日:8.38  	120日:8.35  	250日:53.05 		,当前价：180.76	,当前：2022-04-12 10:50:37
        shuZi_shuZiHuoBi.put("002123", "梦网科技");//244	通信服务     -6.02	96.50	4.57	价格区间: 5日:65.60 	10日:65.60 	20日:52.90 	30日:37.44 	60日:24.08 	120日:14.13 	250日:11.36 		,当前价：12.03	,当前：2022-04-12 10:50:38
        shuZi_shuZiHuoBi.put("002649", "博彦科技");//235	互联网服务   0.69	69.05	0.98	价格区间: 5日:9.45  	10日:9.45  	20日:9.45  	30日:8.09  	60日:5.11  	120日:15.95 	250日:40.87 		,当前价：11.67	,当前：2022-04-12 10:50:39
    }

    /**
     * shuZi_shuJuAnQuan
     */
    public static Map<String, String> shuZi_shuJuAnQuan = new HashMap<>();

    static {
        shuZi_shuJuAnQuan.put("002268", "卫士通  ");//348	软件开发	6.4 	382.86	4.06	价格区间: 5日:70.77 	10日:54.69 	20日:63.20 	30日:63.64 	60日:41.94 	120日:30.98 	250日:59.93 		,当前价：45.24	,当前：2022-03-30 14:52:57
        shuZi_shuJuAnQuan.put("603636", "南威软件");//295	互联网服务	1.2 	84.37	1   	价格区间: 5日:6.44  	10日:3.11  	20日:41.35 	30日:42.02 	60日:45.82 	120日:49.54 	250日:49.54 		,当前价：14.28	,当前：2022-03-30 14:52:58
        shuZi_shuJuAnQuan.put("002104", "恒宝股份");//266	通信设备	4.1 	83.07	1.08	价格区间: 5日:75.50 	10日:35.51 	20日:48.89 	30日:24.57 	60日:46.99 	120日:51.63 	250日:53.62 		,当前价：11.92	,当前：2022-03-30 14:53:00
    }

    /**
     * shuZi_dianZiShenFenZheng ["电子身份证"]：6;
     */
    public static Map<String, String> shuZi_dianZiShenFenZheng = new HashMap<>();

    static {
        shuZi_dianZiShenFenZheng.put("603636", "南威软件");//275	互联网服务   -1.5	69.77	1.13	价格区间: 5日:2.15  	10日:1.30  	20日:0.55  	30日:19.55 	60日:25.13 	120日:30.79 	250日:30.79 		,当前价：11.81	,当前：2022-04-12 11:13:48
        shuZi_dianZiShenFenZheng.put("002232", "启明信息");//246	互联网服务   -0.26	63.20	1.06	价格区间: 5日:16.52 	10日:18.34 	20日:36.27 	30日:28.76 	60日:15.83 	120日:25.72 	250日:25.72 		,当前价：15.47	,当前：2022-04-12 11:13:49
        shuZi_dianZiShenFenZheng.put("000997", "新大陆  ");//199	互联网服务   0.41	152.64	0.91	价格区间: 5日:6.39  	10日:6.61  	20日:3.43  	30日:3.43  	60日:3.26  	120日:3.26  	250日:26.93 		,当前价：14.79	,当前：2022-04-12 11:13:50
        shuZi_dianZiShenFenZheng.put("002152", "广电运通");//181	计算机设备   1.89	254.55	0.86	价格区间: 5日:27.55 	10日:30.39 	20日:26.96 	30日:13.42 	60日:8.47  	120日:11.61 	250日:12.62 		,当前价：10.25	,当前：2022-04-12 11:13:51
    }

    /**
     * shuZi_huaWeiShengTeng ["华为昇腾"]：4;
     */
    public static Map<String, String> shuZi_huaWeiShengTeng = new HashMap<>();

    static {
        shuZi_huaWeiShengTeng.put("000158", "常山北明");//247	综合行业     0.16	98.00	1.23	价格区间: 5日:9.64  	10日:6.84  	20日:6.84  	30日:6.40  	60日:4.59  	120日:4.59  	250日:15.18 		,当前价：6.13	,当前：2022-04-12 11:16:50
        shuZi_huaWeiShengTeng.put("002261", "拓维信息");//245	教育         1.14	77.50	1.41	价格区间: 5日:12.05 	10日:6.90  	20日:6.90  	30日:5.08  	60日:2.90  	120日:2.47  	250日:2.09  		,当前价：6.21	,当前：2022-04-12 11:16:52
        shuZi_huaWeiShengTeng.put("002152", "广电运通");//181	计算机设备   1.89	254.55	0.86	价格区间: 5日:25.51 	10日:28.43 	20日:25.22 	30日:12.55 	60日:7.92  	120日:11.35 	250日:12.38 		,当前价：10.25	,当前：2022-04-12 11:16:53
    }

    /**
     * yanHuTiLi ["盐湖提锂"]：19;
     */
    public static Map<String, String> yanHuTiLi = new HashMap<>();

    static {
        yanHuTiLi.put("000762", "西藏矿业");//370	采掘行业    	0.79	206.24	1.65	价格区间: 5日:29.60 	10日:22.56 	20日:17.99 	30日:8.43  	60日:6.01  	120日:4.24  	250日:35.25 		,当前价：39.6	,当前：2022-04-07 11:28:25
        yanHuTiLi.put("600338", "西藏珠峰");//364	有色金属    	-0.42	237.05	1.46	价格区间: 5日:14.59 	10日:9.17  	20日:7.90  	30日:3.79  	60日:3.79  	120日:2.75  	250日:38.75 		,当前价：25.93	,当前：2022-04-07 11:28:26
        yanHuTiLi.put("002240", "盛新锂能");//349	能源金属    	1.81	436.92	1.33	价格区间: 5日:26.71 	10日:17.54 	20日:34.47 	30日:34.16 	60日:45.63 	120日:29.69 	250日:53.64 		,当前价：50.49	,当前：2022-04-07 11:28:27
        yanHuTiLi.put("000546", "金圆股份");//344	水泥建材    	9.98	128.20	3.93	价格区间: 5日:100.00	10日:100.00	20日:80.95 	30日:54.08 	60日:64.13 	120日:75.50 	250日:81.94 		,当前价：16.42	,当前：2022-04-07 11:28:28
        yanHuTiLi.put("002466", "天齐锂业");//344	能源金属    	0.65	1213.44	1.38	价格区间: 5日:35.77 	10日:27.31 	20日:40.74 	30日:20.46 	60日:20.46 	120日:11.03 	250日:44.12 		,当前价：82.15	,当前：2022-04-07 11:28:29
        yanHuTiLi.put("600499", "科达制造");//342	专用设备    	-0.99	341.05	5.55	价格区间: 5日:25.36 	10日:18.68 	20日:18.68 	30日:11.60 	60日:11.60 	120日:22.96 	250日:51.91 		,当前价：18.06	,当前：2022-04-07 11:28:30
        yanHuTiLi.put("000408", "藏格矿业");//341	化肥行业    	3.67	490.57	1.27	价格区间: 5日:50.17 	10日:38.05 	20日:20.64 	30日:16.23 	60日:22.90 	120日:36.06 	250日:67.33 		,当前价：31.04	,当前：2022-04-07 11:28:31
        yanHuTiLi.put("600773", "西藏城投");//341	房地产开发  	-0.64	153.77	1.49	价格区间: 5日:20.00 	10日:13.92 	20日:11.41 	30日:6.96  	60日:3.92  	120日:3.45  	250日:33.69 		,当前价：18.76	,当前：2022-04-07 11:28:32
        yanHuTiLi.put("603799", "华友钴业");//337	能源金属    	-0.93	1152.75	1.61	价格区间: 5日:17.21 	10日:15.68 	20日:44.47 	30日:23.25 	60日:23.25 	120日:16.24 	250日:34.81 		,当前价：94.38	,当前：2022-04-07 11:28:33
    }

    /**
     * shuZi_dongShuXiSuan ["东数西算"]：21;
     */
    public static Map<String, String> shuZi_dongShuXiSuan = new HashMap<>();

    static {
        shuZi_dongShuXiSuan.put("002837", "英维克  ");//402	专用设备	0.92	124.53	0.97	价格区间: 5日:27.44 	10日:63.52 	20日:63.52 	30日:62.78 	60日:48.44 	120日:41.59 	250日:61.21 		,当前价：37.25	,当前：2022-03-24 13:55:16
        shuZi_dongShuXiSuan.put("600510", "黑牡丹  ");//376	房地产开发	1.36	132.88	0.9 	价格区间: 5日:19.09 	10日:8.25  	20日:28.26 	30日:52.05 	60日:55.23 	120日:55.23 	250日:58.49 		,当前价：12.69	,当前：2022-03-24 13:55:18
        shuZi_dongShuXiSuan.put("600996", "贵广网络");//365	文化传媒	-1   	83.61	1.88	价格区间: 5日:44.30 	10日:32.73 	20日:12.21 	30日:25.49 	60日:47.57 	120日:52.61 	250日:52.61 		,当前价：7.95	,当前：2022-03-24 13:55:19
        shuZi_dongShuXiSuan.put("002354", "天娱数科");//330	游戏    	-3.2	75.47	1.53	价格区间: 5日:16.28 	10日:20.27 	20日:11.36 	30日:23.03 	60日:11.90 	120日:42.19 	250日:44.89 		,当前价：4.54	,当前：2022-03-24 13:55:20
        shuZi_dongShuXiSuan.put("000815", "美利云  ");//328	造纸印刷	2.9 	115.90	1.26	价格区间: 5日:27.05 	10日:31.47 	20日:53.72 	30日:68.34 	60日:68.97 	120日:70.49 	250日:71.57 		,当前价：16.67	,当前：2022-03-24 13:55:22
    }

    /**
     * shuZi_guoZiYun ["国资云概念"]：9;
     */
    public static Map<String, String> shuZi_guoZiYun = new HashMap<>();

    static {
        shuZi_guoZiYun.put("000815", "美利云  ");//286	造纸印刷	-1.54	93.65	2.2 	价格区间: 5日:22.18 	10日:10.24 	20日:6.98  	30日:40.31 	60日:51.20 	120日:53.58 	250日:55.28 		,当前价：13.47	,当前：2022-04-06 11:10:38
        shuZi_guoZiYun.put("600602", "云赛智联");//283	软件开发	-0.37	111.19	1.19	价格区间: 5日:26.47 	10日:7.00  	20日:22.15 	30日:26.91 	60日:45.31 	120日:53.95 	250日:56.70 		,当前价：8.13	,当前：2022-04-06 11:10:39
        shuZi_guoZiYun.put("603881", "数据港  ");//260	互联网服务	0.45	116.87	1.49	价格区间: 5日:59.16 	10日:18.86 	20日:12.57 	30日:10.20 	60日:18.51 	120日:34.54 	250日:43.05 		,当前价：35.53	,当前：2022-04-06 11:10:41
        shuZi_guoZiYun.put("000158", "常山北明");//256	综合行业	0.15	108.07	2.12	价格区间: 5日:35.29 	10日:56.00 	20日:61.40 	30日:39.55 	60日:37.76 	120日:37.76 	250日:22.89 		,当前价：6.76	,当前：2022-04-06 11:10:42
        shuZi_guoZiYun.put("002152", "广电运通");//181	计算机设备	3.25	267.96	5.92	价格区间: 5日:91.40 	10日:91.84 	20日:62.50 	30日:29.90 	60日:24.59 	120日:27.18 	250日:26.94 		,当前价：10.79	,当前：2022-04-06 11:10:46
    }

    /**
     * teGaoYa ["特高压"]：33;
     */
    public static Map<String, String> teGaoYa = new HashMap<>();

    static {
        teGaoYa.put("002459", "晶澳科技");//386	光伏设备	3.29	1382.31	3.8 	价格区间: 5日:47.44 	10日:30.52 	20日:24.13 	30日:58.95 	60日:58.33 	120日:66.02 	250日:79.65 		,当前价：86.39	,当前：2022-03-23 10:33:37
        teGaoYa.put("600522", "中天科技");//350	通信设备	2.89	632.08	4.33	价格区间: 5日:38.46 	10日:54.72 	20日:45.74 	30日:59.27 	60日:68.74 	120日:82.58 	250日:84.45 		,当前价：18.52	,当前：2022-03-23 10:33:39
        teGaoYa.put("601126", "四方股份");//347	电网设备	5.26	115.47	8.83	价格区间: 5日:65.69 	10日:61.97 	20日:30.53 	30日:30.53 	60日:11.82 	120日:10.03 	250日:38.58 		,当前价：14.2	,当前：2022-03-23 10:33:41
        teGaoYa.put("601677", "明泰铝业");//331	有色金属	2.97	284.36	0.66	价格区间: 5日:87.17 	10日:91.08 	20日:57.57 	30日:57.57 	60日:57.57 	120日:67.35 	250日:79.80 		,当前价：41.66	,当前：2022-03-23 10:33:43
        teGaoYa.put("000400", "许继电气");//317	电网设备	4.74	195.92	5.7 	价格区间: 5日:76.96 	10日:84.03 	20日:46.88 	30日:38.12 	60日:18.68 	120日:18.24 	250日:35.55 		,当前价：19.43	,当前：2022-03-23 10:33:46
        teGaoYa.put("002545", "东方铁塔");//285	钢铁行业	-0.09	142.57	3.99	价格区间: 5日:73.38 	10日:68.61 	20日:53.68 	30日:63.54 	60日:70.07 	120日:73.96 	250日:78.68 		,当前价：11.46	,当前：2022-03-23 10:33:48
        teGaoYa.put("601669", "中国电建");//275	工程建设	0.96	1126.01	2.5 	价格区间: 5日:71.11 	10日:45.75 	20日:42.68 	30日:22.15 	60日:22.15 	120日:34.26 	250日:58.44 		,当前价：7.36	,当前：2022-03-23 10:33:49
    }





    /**
     * shuZi_esim ["eSIM"]：5;
     */
    public static Map<String, String> shuZi_esim = new HashMap<>();

    static {
        shuZi_esim.put("002104", "恒宝股份");//276	通信设备     -1.87	76.80	0.8 	价格区间: 5日:5.96  	10日:5.32  	20日:5.32  	30日:23.36 	60日:38.71 	120日:44.03 	250日:46.38 		,当前价：11.02	,当前：2022-04-12 11:12:07
        shuZi_esim.put("002881", "美格智能");//276	消费电子     -1.47	55.72	1.58	价格区间: 5日:3.36  	10日:2.05  	20日:1.61  	30日:1.04  	60日:0.93  	120日:0.98  	250日:33.94 		,当前价：30.17	,当前：2022-04-12 11:12:08
        shuZi_esim.put("002049", "紫光国微");//254	半导体       2.97	1086.64	3.56	价格区间: 5日:16.11 	10日:13.83 	20日:11.55 	30日:9.56  	60日:7.76  	120日:7.74  	250日:52.79 		,当前价：179.06	,当前：2022-04-12 11:12:09
    }

    /**
     * shuZi_shuZiJingJi ["数字经济"]：19;
     */
    public static Map<String, String> shuZi_shuZiJingJi = new HashMap<>();

    static {
        shuZi_shuZiJingJi.put("603466", "风语筑  ");//347	文化传媒     -1.71	87.30	1.5 	价格区间: 5日:0.69  	10日:0.69  	20日:17.65 	30日:17.65 	60日:5.99  	120日:26.71 	250日:33.91 		,当前价：20.69	,当前：2022-04-12 11:20:58
        shuZi_shuZiJingJi.put("002354", "天娱数科");//343	游戏         0.8 	83.61	2.55	价格区间: 5日:13.70 	10日:11.11 	20日:43.66 	30日:42.96 	60日:37.33 	120日:52.46 	250日:52.46 		,当前价：5.03	,当前：2022-04-12 11:20:59
        shuZi_shuZiJingJi.put("002268", "卫士通  ");//337	软件开发     -0.67	349.86	1.4 	价格区间: 5日:4.07  	10日:5.88  	20日:15.48 	30日:23.00 	60日:28.56 	120日:15.63 	250日:51.56 		,当前价：41.34	,当前：2022-04-12 11:21:01
        shuZi_shuZiJingJi.put("002987", "京北方  ");//296	软件开发     0.44	72.45	0.82	价格区间: 5日:7.50  	10日:7.50  	20日:7.50  	30日:7.50  	60日:4.19  	120日:27.72 	250日:32.67 		,当前价：32.21	,当前：2022-04-12 11:21:02
        shuZi_shuZiJingJi.put("603636", "南威软件");//275	互联网服务   -1.5	69.77	1.13	价格区间: 5日:1.72  	10日:1.04  	20日:0.44  	30日:19.46 	60日:25.04 	120日:30.71 	250日:30.71 		,当前价：11.81	,当前：2022-04-12 11:21:03
    }

    /**
     * shuZi_etc ["ETC"]：13;
     */
    public static Map<String, String> shuZi_etc = new HashMap<>();

    static {
        shuZi_etc.put("003040", "楚天龙  ");//444	通信设备     3.54	114.64	2.06	价格区间: 5日:47.60 	10日:73.15 	20日:73.15 	30日:73.15 	60日:39.16 	120日:39.16 	250日:34.82 		,当前价：24.86	,当前：2022-04-12 11:24:44
        shuZi_etc.put("002941", "新疆交建");//343	工程建设     6.26	129.27	4.97	价格区间: 5日:86.39 	10日:87.03 	20日:87.03 	30日:88.21 	60日:90.75 	120日:91.48 	250日:92.06 		,当前价：20.04	,当前：2022-04-12 11:24:46
        shuZi_etc.put("002484", "江海股份");//309	电子元件     -2.68	144.66	1.4 	价格区间: 5日:1.97  	10日:1.73  	20日:1.00  	30日:0.82  	60日:0.82  	120日:0.75  	250日:29.96 		,当前价：17.42	,当前：2022-04-12 11:24:47
        shuZi_etc.put("000948", "南天信息");//308	软件开发     3.14	64.68	3.23	价格区间: 5日:65.28 	10日:73.40 	20日:73.40 	30日:73.40 	60日:46.50 	120日:53.07 	250日:65.38 		,当前价：16.4	,当前：2022-04-12 11:24:48
        shuZi_etc.put("002104", "恒宝股份");//276	通信设备     -1.87	76.80	0.8 	价格区间: 5日:4.30  	10日:3.92  	20日:3.92  	30日:22.22 	60日:38.27 	120日:43.63 	250日:46.00 		,当前价：11.02	,当前：2022-04-12 11:24:49
        shuZi_etc.put("002049", "紫光国微");//254	半导体       2.97	1086.64	3.56	价格区间: 5日:13.28 	10日:11.40 	20日:9.56  	30日:7.92  	60日:6.43  	120日:6.41  	250日:52.20 		,当前价：179.06	,当前：2022-04-12 11:24:50
    }

    /**
     * shuZiJingJi 数字经济：数字货币,电子身份证,数据安全,东数西算,国资云概念
     */
    public static Map<String, String> shuZi = new HashMap<>();

    static {
        shuZi.putAll(shuZi_shuZiHuoBi);//数字货币
        shuZi.putAll(shuZi_dianZiShenFenZheng);//电子身份证
        shuZi.putAll(shuZi_esim);//eSIM
        shuZi.putAll(shuZi_huaWeiShengTeng);//华为昇腾
        shuZi.putAll(shuZi_shuZiJingJi);//数字经济
        shuZi.putAll(shuZi_shuJuAnQuan);//数据安全
        shuZi.putAll(shuZi_dongShuXiSuan);//东数西算
        shuZi.putAll(shuZi_guoZiYun);//国资云概念
        shuZi.putAll(shuZi_etc);//ETC
    }

    /**
     * ["绿色电力"]：67;
     */
    public static Map<String, String> lvSeDianLi = new HashMap<>();

    static {
        lvSeDianLi.put("002053", "云南能投");//401	化学原料	9.99	135.68	7.01	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：17.83	,当前：2022-03-18 10:41:56
        lvSeDianLi.put("600821", "金开新能");//397	电力行业	1.01	122.60	1.14	价格区间: 5日:39.85 	10日:28.96 	20日:28.65 	30日:25.73 	60日:9.76  	120日:23.01 	250日:41.02 		,当前价：7.98	,当前：2022-03-18 10:41:57
        lvSeDianLi.put("600021", "上海电力");//357	电力行业	2.8 	278.20	1.83	价格区间: 5日:54.27 	10日:33.58 	20日:33.58 	30日:22.14 	60日:12.66 	120日:25.18 	250日:38.75 		,当前价：10.63	,当前：2022-03-18 10:41:59
        lvSeDianLi.put("002256", "兆新股份");//356	电网设备	1.43	66.64	1.78	价格区间: 5日:65.00 	10日:49.06 	20日:32.91 	30日:32.91 	60日:14.73 	120日:13.52 	250日:41.65 		,当前价：3.54	,当前：2022-03-18 10:42:00
    }
    /**
     * dianLi 电力：抽水蓄能
     */
    public static Map<String, String> dianLi = new HashMap<>();

    static {
        dianLi.putAll(dianLi_chouShuiXuNeng);//抽水蓄能
        dianLi.putAll(lvSeDianLi);//绿色电力
    }

    /**
     * yuanYuZhou["元宇宙概念"]：31;
     */
    public static Map<String, String> chuanMei_yuanYuZhou = new HashMap<>();

    static {
        chuanMei_yuanYuZhou.put("000665", "湖北广电");//395	文化传媒	10.05	88.86	25.36	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:86.42 	60日:42.63 	120日:56.87 	250日:56.87 		,当前价：8.76	,当前：2022-03-28 13:15:47
        chuanMei_yuanYuZhou.put("002354", "天娱数科");//375	游戏    	4.98	87.60	29.28	价格区间: 5日:71.72 	10日:73.83 	20日:59.85 	30日:65.13 	60日:33.67 	120日:56.47 	250日:57.79 		,当前价：5.27	,当前：2022-03-28 13:15:49
        chuanMei_yuanYuZhou.put("000810", "创维数字");//370	家电行业	-2.01	155.24	4.02	价格区间: 5日:51.85 	10日:77.06 	20日:77.65 	30日:82.43 	60日:81.31 	120日:86.55 	250日:86.55 		,当前价：14.6	,当前：2022-03-28 13:15:50
        chuanMei_yuanYuZhou.put("603466", "风语筑  ");//365	文化传媒	3.6 	97.26	8.43	价格区间: 5日:67.21 	10日:78.87 	20日:72.78 	30日:70.34 	60日:24.28 	120日:41.90 	250日:46.76 		,当前价：23.05	,当前：2022-03-28 13:15:51
        chuanMei_yuanYuZhou.put("002036", "联创电子");//318	光学光电子	-3.63	163.57	6.41	价格区间: 5日:5.08  	10日:35.88 	20日:20.17 	30日:18.18 	60日:8.97  	120日:8.26  	250日:35.44 		,当前价：15.39	,当前：2022-03-28 13:15:52
    }
    /**
     * guangDian ["广电"]：13;
     */
    public static Map<String, String> chuanMei_guangDian = new HashMap<>();

    static {
        chuanMei_guangDian.put("000665", "湖北广电");//395	文化传媒	10.05	88.86	25.36	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:86.42 	60日:42.63 	120日:56.87 	250日:56.87 		,当前价：8.76	,当前：2022-03-28 13:11:22
        chuanMei_guangDian.put("600996", "贵广网络");//376	文化传媒	10.03	92.34	4.05	价格区间: 5日:100.00	10日:100.00	20日:52.00 	30日:41.56 	60日:60.03 	120日:63.87 	250日:63.87 		,当前价：8.78	,当前：2022-03-28 13:11:24
        chuanMei_guangDian.put("000810", "创维数字");//370	家电行业	-2.01	155.24	4.02	价格区间: 5日:51.85 	10日:77.06 	20日:77.65 	30日:82.43 	60日:81.31 	120日:86.55 	250日:86.55 		,当前价：14.6	,当前：2022-03-28 13:11:25
    }

    /**
     * chuanMei_jiaoYu  职业教育
     */
    public static Map<String, String> chuanMei_jiaoYu = new HashMap<>();

    static {
        chuanMei_jiaoYu.put("000607", "华媒控股");//294	文化传媒	6.75	64.42	14.89	价格区间: 5日:92.17 	10日:92.17 	20日:94.38 	30日:81.62 	60日:61.37 	120日:72.56 	250日:74.03 		,当前价：6.33	,当前：2022-04-06 11:34:58
        chuanMei_jiaoYu.put("600556", "天下秀  ");//289	文化传媒	0.1 	172.64	4.36	价格区间: 5日:70.71 	10日:66.39 	20日:82.33 	30日:82.33 	60日:32.59 	120日:24.87 	250日:24.87 		,当前价：9.55	,当前：2022-04-06 11:34:59
        chuanMei_jiaoYu.put("003032", "传智教育");//276	教育    	10.03	65.80	4.44	价格区间: 5日:87.68 	10日:88.60 	20日:88.82 	30日:43.90 	60日:35.43 	120日:20.33 	250日:9.76  		,当前价：16.35	,当前：2022-04-06 11:35:01
        chuanMei_jiaoYu.put("000812", "陕西金叶");//242	包装材料	0.74	52.19	1.27	价格区间: 5日:33.87 	10日:44.53 	20日:63.21 	30日:63.21 	60日:26.46 	120日:39.29 	250日:40.19 		,当前价：6.79	,当前：2022-04-06 11:35:03
        chuanMei_jiaoYu.put("002607", "中公教育");//222	教育    	5.93	374.36	14.82	价格区间: 5日:74.12 	10日:77.08 	20日:43.53 	30日:35.58 	60日:26.06 	120日:9.20  	250日:3.07  		,当前价：6.07	,当前：2022-04-06 11:35:04
    }
    /**
     * huaWeiOLa ["华为欧拉"]：2;
     */
    public static Map<String, String> chuanMei_huaWeiOLa = new HashMap<>();

    static {
        chuanMei_huaWeiOLa.put("002261", "拓维信息");//251	软件开发	6.99	91.73	17.11	价格区间: 5日:71.43 	10日:72.97 	20日:43.20 	30日:31.21 	60日:19.71 	120日:16.17 	250日:25.63 		,当前价：7.35	,当前：2022-03-28 12:13:22
        chuanMei_huaWeiOLa.put("600536", "中国软件");//196	互联网服务	2.23	197.18	3.41	价格区间: 5日:49.82 	10日:68.42 	20日:25.87 	30日:25.87 	60日:16.61 	120日:13.96 	250日:9.61  		,当前价：39.87	,当前：2022-03-28 12:13:24
    }
    /**
     * hongMeng ["鸿蒙概念"]：12;
     */
    public static Map<String, String> chuanMei_hongMeng = new HashMap<>();

    static {
        chuanMei_hongMeng.put("000681", "视觉中国");//345	文化传媒	4.88	111.46	10.45	价格区间: 5日:77.17 	10日:86.00 	20日:82.01 	30日:55.93 	60日:18.71 	120日:25.54 	250日:31.11 		,当前价：15.91	,当前：2022-03-28 12:03:32
        chuanMei_hongMeng.put("002268", "卫士通  ");//329	软件开发	-4.4	362.13	3.81	价格区间: 5日:2.20  	10日:31.83 	20日:37.90 	30日:41.96 	60日:29.20 	120日:21.91 	250日:54.66 		,当前价：42.79	,当前：2022-03-28 12:03:34
        chuanMei_hongMeng.put("003032", "传智教育");//262	教育    	10.03	63.55	11.2	价格区间: 5日:100.00	10日:100.00	20日:44.12 	30日:34.80 	60日:22.86 	120日:16.11 	250日:7.73  		,当前价：15.79	,当前：2022-03-28 12:03:35
        chuanMei_hongMeng.put("000158", "常山北明");//261	综合行业	9.97	109.35	37.4	价格区间: 5日:100.00	10日:100.00	20日:63.11 	30日:43.50 	60日:41.33 	120日:34.62 	250日:23.72 		,当前价：6.84	,当前：2022-03-28 12:03:36
        chuanMei_hongMeng.put("002261", "拓维信息");//252	软件开发	6.99	91.73	17.11	价格区间: 5日:71.43 	10日:72.97 	20日:43.20 	30日:31.21 	60日:19.71 	120日:16.17 	250日:25.63 		,当前价：7.35	,当前：2022-03-28 12:03:37
        chuanMei_hongMeng.put("002624", "完美世界");//236	游戏    	1.09	251.03	3.74	价格区间: 5日:22.55 	10日:70.52 	20日:70.52 	30日:59.25 	60日:18.62 	120日:14.98 	250日:13.10 		,当前价：12.94	,当前：2022-03-28 12:03:38
        chuanMei_hongMeng.put("002123", "梦网科技");//214	通信服务	1.27	102.28	5.25	价格区间: 5日:50.56 	10日:55.97 	20日:24.51 	30日:20.72 	60日:11.85 	120日:7.24  	250日:5.68  		,当前价：12.75	,当前：2022-03-28 12:03:39
        chuanMei_hongMeng.put("000997", "新大陆  ");//200	互联网服务	0.24	169.26	3.1 	价格区间: 5日:17.44 	10日:13.23 	20日:26.57 	30日:26.57 	60日:24.93 	120日:39.00 	250日:54.02 		,当前价：16.4	,当前：2022-03-28 12:03:40
    }
    /**
     * netGaiNian ["NFT概念"]：13;
     */
    public static Map<String, String> chuanMei_nft = new HashMap<>();

    static {
        chuanMei_nft.put("000681", "视觉中国");//371	文化传媒     2.8 	131.01	3.27	价格区间: 5日:84.25 	10日:87.90 	20日:90.37 	30日:90.37 	60日:39.15 	120日:44.27 	250日:48.44 		,当前价：18.7	,当前：2022-04-07 13:50:38
        chuanMei_nft.put("603466", "风语筑  ");//359	文化传媒     -2.43	100.01	2.47	价格区间: 5日:71.64 	10日:75.70 	20日:85.20 	30日:85.20 	60日:28.91 	120日:44.58 	250日:50.02 		,当前价：23.7	,当前：2022-04-07 13:50:39
        chuanMei_nft.put("600986", "浙文互联");//319	文化传媒     -0.14	92.04	3.28	价格区间: 5日:67.72 	10日:71.33 	20日:81.28 	30日:81.28 	60日:38.53 	120日:50.69 	250日:53.06 		,当前价：6.96	,当前：2022-04-07 13:50:41
        chuanMei_nft.put("600880", "博瑞传播");//303	教育         0.83	79.70	20   	价格区间: 5日:69.59 	10日:69.59 	20日:75.91 	30日:75.91 	60日:46.43 	120日:62.15 	250日:62.96 		,当前价：7.29	,当前：2022-04-07 13:50:42
        chuanMei_nft.put("002803", "吉宏股份");//295	文化传媒     0.07	57.70	2.99	价格区间: 5日:34.32 	10日:62.24 	20日:70.32 	30日:70.32 	60日:19.66 	120日:19.66 	250日:12.05 		,当前价：14.89	,当前：2022-04-07 13:50:43
        chuanMei_nft.put("600556", "天下秀  ");//288	文化传媒     -2.54	166.67	2.51	价格区间: 5日:44.44 	10日:45.90 	20日:71.55 	30日:71.55 	60日:28.33 	120日:21.61 	250日:21.61 		,当前价：9.22	,当前：2022-04-07 13:50:44
    }

    /**
     * ["虚拟数字人"]：9;
     */
    public static Map<String, String> chuanMei_xunNiShuZiRen = new HashMap<>();

    static {
        chuanMei_xunNiShuZiRen.put("603466", "风语筑  ");//359	文化传媒     -2.43	100.01	2.47	价格区间: 5日:71.64 	10日:76.01 	20日:85.39 	30日:85.39 	60日:28.98 	120日:44.63 	250日:50.07 		,当前价：23.7	,当前：2022-04-07 13:55:13
        chuanMei_xunNiShuZiRen.put("002354", "天娱数科");//354	游戏         0   	91.26	2.23	价格区间: 5日:62.16 	10日:79.10 	20日:80.28 	30日:80.82 	60日:45.58 	120日:64.29 	250日:64.29 		,当前价：5.49	,当前：2022-04-07 13:55:14
        chuanMei_xunNiShuZiRen.put("600986", "浙文互联");//319	文化传媒     -0.14	92.04	3.28	价格区间: 5日:68.50 	10日:72.03 	20日:81.74 	30日:81.74 	60日:38.74 	120日:50.87 	250日:53.22 		,当前价：6.96	,当前：2022-04-07 13:55:16
        chuanMei_xunNiShuZiRen.put("002059", "云南旅游");//315	旅游酒店     -4.56	71.98	5.04	价格区间: 5日:64.42 	10日:70.16 	20日:77.58 	30日:77.58 	60日:48.67 	120日:66.25 	250日:67.63 		,当前价：7.11	,当前：2022-04-07 13:55:17
        chuanMei_xunNiShuZiRen.put("002230", "科大讯飞");//146	软件开发     0.22	1062.22	1.9 	价格区间: 5日:14.03 	10日:9.06  	20日:29.87 	30日:22.87 	60日:19.69 	120日:12.39 	250日:8.04  		,当前价：45.7	,当前：2022-04-07 13:55:22
    }





    /**
     * chuanMei:NFT概念,虚拟数字人,鸿蒙概念,华为欧拉,广电,职业教育
     */
    public static Map<String, String> chuanMei = new HashMap<>();

    static {
        chuanMei.putAll(chuanMei_nft);//NFT概念
        chuanMei.putAll(chuanMei_xunNiShuZiRen);//虚拟数字人
        chuanMei.putAll(chuanMei_hongMeng);//鸿蒙概念
        chuanMei.putAll(chuanMei_huaWeiOLa);//华为欧拉
        chuanMei.putAll(chuanMei_guangDian);//广电
        chuanMei.putAll(chuanMei_yuanYuZhou);//元宇宙概念
        chuanMei.putAll(chuanMei_jiaoYu);//职业教育

    }

    /**
     * youXi_yunYouXi ["云游戏"]：11;
     */
    public static Map<String, String> youXi_yunYouXi = new HashMap<>();

    static {
        youXi_yunYouXi.put("600804", "鹏博士  ");//274	通信服务     1.17	100.28	1.47	价格区间: 5日:7.37  	10日:7.37  	20日:2.98  	30日:2.98  	60日:32.74 	120日:32.74 	250日:45.19 		,当前价：6.05	,当前：2022-04-12 10:17:57
        youXi_yunYouXi.put("002425", "凯撒文化");//266	游戏         0.94	72.13	4.69	价格区间: 5日:40.00 	10日:51.61 	20日:72.22 	30日:72.22 	60日:36.79 	120日:27.08 	250日:23.45 		,当前价：7.54	,当前：2022-04-12 10:17:59
        youXi_yunYouXi.put("002555", "三七互娱");//264	游戏         -2.41	521.64	12.82	价格区间: 5日:17.80 	10日:25.24 	20日:60.10 	30日:60.10 	60日:38.99 	120日:38.99 	250日:49.04 		,当前价：23.52	,当前：2022-04-12 10:18:00
        youXi_yunYouXi.put("002174", "游族网络");//248	游戏         10.05	104.32	2.88	价格区间: 5日:72.15 	10日:72.15 	20日:71.20 	30日:60.99 	60日:26.56 	120日:19.32 	250日:13.85 		,当前价：11.39	,当前：2022-04-12 10:18:01
        youXi_yunYouXi.put("002517", "恺英网络");//238	游戏         10.11	110.21	9.66	价格区间: 5日:75.00 	10日:75.00 	20日:84.47 	30日:84.47 	60日:50.58 	120日:42.93 	250日:54.12 		,当前价：5.12	,当前：2022-04-12 10:18:02
        youXi_yunYouXi.put("600640", "新国脉  ");//236	文化传媒     0.78	81.96	1.58	价格区间: 5日:5.76  	10日:5.76  	20日:25.14 	30日:25.14 	60日:8.06  	120日:7.88  	250日:7.88  		,当前价：10.3	,当前：2022-04-12 10:18:02
        youXi_yunYouXi.put("002699", "美盛文化");//228	文化传媒     -0.31	57.76	2.47	价格区间: 5日:22.78 	10日:38.69 	20日:55.64 	30日:57.49 	60日:50.77 	120日:44.92 	250日:44.92 		,当前价：6.35	,当前：2022-04-12 10:18:03
        youXi_yunYouXi.put("002624", "完美世界");//227	游戏         0.08	240.17	7.34	价格区间: 5日:13.40 	10日:13.40 	20日:42.86 	30日:42.86 	60日:15.65 	120日:9.98  	250日:8.73  		,当前价：12.38	,当前：2022-04-12 10:18:05
    }
    /**
     * youXi_dianZiJingJi ["电子竞技"]：19;
     */
    public static Map<String, String> youXi_dianZiJingJi = new HashMap<>();

    static {
        youXi_dianZiJingJi.put("002280", "联络互动");//364	软件开发     1.31	84.04	1.39	价格区间: 5日:8.11  	10日:25.60 	20日:42.13 	30日:42.13 	60日:42.13 	120日:33.46 	250日:15.38 		,当前价：3.86	,当前：2022-04-12 10:35:42
        youXi_dianZiJingJi.put("002354", "天娱数科");//349	游戏         1.4 	84.11	2.55	价格区间: 5日:10.96 	10日:8.89  	20日:42.25 	30日:42.25 	60日:36.87 	120日:52.23 	250日:52.23 		,当前价：5.06	,当前：2022-04-12 10:35:44
        youXi_dianZiJingJi.put("600880", "博瑞传播");//307	教育         1.92	75.55	3.06	价格区间: 5日:17.74 	10日:53.00 	20日:61.51 	30日:62.77 	60日:38.39 	120日:56.47 	250日:57.41 		,当前价：6.91	,当前：2022-04-12 10:35:45
    }

    /**
     * youXi_shouYou    ["手游概念"]：26;
     */
    public static Map<String, String> youXi_shouYou = new HashMap<>();

    static {
        youXi_shouYou.put("000829", "天音控股");//390	贸易行业     -2.21	122.50	1.62	价格区间: 5日:9.51  	10日:9.51  	20日:16.29 	30日:11.09 	60日:9.31  	120日:3.22  	250日:28.67 		,当前价：11.95	,当前：2022-04-12 10:40:57
        youXi_shouYou.put("002354", "天娱数科");//349	游戏         1.4 	84.11	2.55	价格区间: 5日:10.96 	10日:8.89  	20日:42.25 	30日:42.25 	60日:36.87 	120日:52.23 	250日:52.23 		,当前价：5.06	,当前：2022-04-12 10:40:59
        youXi_shouYou.put("600880", "博瑞传播");//307	教育         1.92	75.55	3.06	价格区间: 5日:18.55 	10日:53.46 	20日:61.89 	30日:63.14 	60日:38.62 	120日:56.62 	250日:57.56 		,当前价：6.91	,当前：2022-04-12 10:41:00
        youXi_shouYou.put("002425", "凯撒文化");//266	游戏         0.94	72.13	4.69	价格区间: 5日:50.67 	10日:60.22 	20日:77.16 	30日:77.16 	60日:39.31 	120日:28.94 	250日:25.05 		,当前价：7.54	,当前：2022-04-12 10:41:01
        youXi_shouYou.put("002555", "三七互娱");//264	游戏         -2.41	521.64	12.82	价格区间: 5日:29.58 	10日:35.95 	20日:65.82 	30日:65.82 	60日:42.79 	120日:42.79 	250日:52.20 		,当前价：23.52	,当前：2022-04-12 10:41:02
        youXi_shouYou.put("603258", "电魂网络");//256	游戏         0.86	66.47	5.26	价格区间: 5日:16.62 	10日:40.65 	20日:61.98 	30日:61.98 	60日:39.47 	120日:40.98 	250日:47.77 		,当前价：26.96	,当前：2022-04-12 10:41:03
        youXi_shouYou.put("600770", "综艺股份");//253	综合行业     1.36	87.23	1.47	价格区间: 5日:7.89  	10日:6.67  	20日:28.21 	30日:29.41 	60日:29.41 	120日:38.15 	250日:42.53 		,当前价：6.71	,当前：2022-04-12 10:41:04
        youXi_shouYou.put("600633", "浙数文化");//249	游戏         2.92	98.22	2.42	价格区间: 5日:17.83 	10日:17.83 	20日:15.23 	30日:11.11 	60日:4.28  	120日:13.74 	250日:18.12 		,当前价：7.76	,当前：2022-04-12 10:41:05
        youXi_shouYou.put("002174", "游族网络");//248	游戏         10.05	104.32	2.88	价格区间: 5日:72.15 	10日:72.15 	20日:71.20 	30日:60.99 	60日:26.56 	120日:19.32 	250日:13.85 		,当前价：11.39	,当前：2022-04-12 10:41:06

    }

    /**
     * youXi_wangLuoYouXi ["网络游戏"]：36;
     */
    public static Map<String, String> youXi_wangLuoYouXi = new HashMap<>();

    static {
        youXi_wangLuoYouXi.put("002354", "天娱数科");//349	游戏         1.4 	84.11	2.55	价格区间: 5日:12.33 	10日:10.00 	20日:42.96 	30日:42.96 	60日:37.79 	120日:52.68 	250日:52.68 		,当前价：5.06	,当前：2022-04-12 10:45:11
        youXi_wangLuoYouXi.put("603466", "风语筑  ");//347	文化传媒     -0.48	88.40	1.5 	价格区间: 5日:8.24  	10日:8.24  	20日:23.91 	30日:23.91 	60日:8.11  	120日:28.36 	250日:35.40 		,当前价：20.95	,当前：2022-04-12 10:45:13
        youXi_wangLuoYouXi.put("002605", "姚记科技");//321	家用轻工     0.53	85.06	4.33	价格区间: 5日:58.29 	10日:65.37 	20日:73.18 	30日:73.18 	60日:26.06 	120日:29.58 	250日:30.17 		,当前价：21.01	,当前：2022-04-12 10:45:14
        youXi_wangLuoYouXi.put("600880", "博瑞传播");//307	教育         1.92	75.55	3.06	价格区间: 5日:17.74 	10日:53.00 	20日:61.51 	30日:62.77 	60日:38.39 	120日:56.47 	250日:57.41 		,当前价：6.91	,当前：2022-04-12 10:45:15
        youXi_wangLuoYouXi.put("600556", "天下秀  ");//288	文化传媒     1.83	150.59	1.67	价格区间: 5日:11.70 	10日:10.93 	20日:29.74 	30日:29.74 	60日:15.20 	120日:8.98  	250日:8.98  		,当前价：8.33	,当前：2022-04-12 10:45:16
        youXi_wangLuoYouXi.put("000676", "智度股份");//284	文化传媒     0.49	79.27	1.5 	价格区间: 5日:7.76  	10日:7.76  	20日:7.76  	30日:5.81  	60日:2.90  	120日:14.73 	250日:26.41 		,当前价：6.21	,当前：2022-04-12 10:45:18
        youXi_wangLuoYouXi.put("002425", "凯撒文化");//266	游戏         0.94	72.13	4.69	价格区间: 5日:49.33 	10日:59.14 	20日:76.54 	30日:76.54 	60日:38.99 	120日:28.70 	250日:24.85 		,当前价：7.54	,当前：2022-04-12 10:45:19
        youXi_wangLuoYouXi.put("002555", "三七互娱");//264	游戏         -2.41	521.64	12.82	价格区间: 5日:28.27 	10日:34.76 	20日:65.18 	30日:65.18 	60日:42.29 	120日:42.29 	250日:51.79 		,当前价：23.52	,当前：2022-04-12 10:45:19
        youXi_wangLuoYouXi.put("603258", "电魂网络");//256	游戏         0.86	66.47	5.26	价格区间: 5日:21.15 	10日:43.87 	20日:64.05 	30日:64.05 	60日:40.79 	120日:42.26 	250日:48.90 		,当前价：26.96	,当前：2022-04-12 10:45:21
        youXi_wangLuoYouXi.put("600770", "综艺股份");//253	综合行业     1.36	87.23	1.47	价格区间: 5日:7.24  	10日:6.11  	20日:27.78 	30日:28.99 	60日:28.99 	120日:37.87 	250日:42.28 		,当前价：6.71	,当前：2022-04-12 10:45:22
        youXi_wangLuoYouXi.put("600633", "浙数文化");//249	游戏         2.92	98.22	2.42	价格区间: 5日:20.16 	10日:20.16 	20日:17.22 	30日:12.56 	60日:4.83  	120日:14.24 	250日:18.60 		,当前价：7.76	,当前：2022-04-12 10:45:23
        youXi_wangLuoYouXi.put("002174", "游族网络");//248	游戏         10.05	104.32	2.88	价格区间: 5日:72.15 	10日:72.15 	20日:71.20 	30日:60.99 	60日:26.56 	120日:19.32 	250日:13.85 		,当前价：11.39	,当前：2022-04-12 10:45:23

    }

    /**
     * youXi 游戏
     */
    public static Map<String, String> youXi = new HashMap<>();

    static {
        youXi.putAll(youXi_yunYouXi);//云游戏
        youXi.putAll(youXi_dianZiJingJi);//电子竞技
        youXi.putAll(youXi_shouYou);//手游概念
        youXi.putAll(youXi_wangLuoYouXi);//网络游戏
    }

    /**
     * xinNengYuan 新能源
     */
    public static Map<String, String> xinNengYuan = new HashMap<>();

    static {
        xinNengYuan.putAll(xinNengYuan_guTaiDianChi);//固态电池
        xinNengYuan.putAll(xinNengYuan_daoPianDianChi);//刀片电池
    }

    /**
     * junGong_hangMu ["航母概念"]：32;
     */
    public static Map<String, String> junGong_hangMu = new HashMap<>();

    static {
        junGong_hangMu.put("002314", "南山控股");//369	房地产开发   -6.76	149.47	4.22	价格区间: 5日:26.13 	10日:53.48 	20日:60.80 	30日:60.80 	60日:61.01 	120日:65.81 	250日:65.81 		,当前价：5.52	,当前：2022-04-12 11:33:13
        junGong_hangMu.put("600765", "中航重机");//324	航天航空     -5.78	368.81	1.47	价格区间: 5日:7.31  	10日:5.78  	20日:4.33  	30日:3.87  	60日:3.70  	120日:14.11 	250日:50.61 		,当前价：35.07	,当前：2022-04-12 11:33:14
        junGong_hangMu.put("600378", "昊华科技");//293	化学制品     -0.18	352.80	1.77	价格区间: 5日:27.81 	10日:21.88 	20日:51.25 	30日:51.25 	60日:52.65 	120日:47.56 	250日:63.40 		,当前价：38.38	,当前：2022-04-12 11:33:16
        junGong_hangMu.put("601890", "亚星锚链");//270	船舶制造     5.34	71.96	0.99	价格区间: 5日:83.33 	10日:83.33 	20日:82.42 	30日:38.07 	60日:21.93 	120日:35.82 	250日:50.19 		,当前价：7.5	,当前：2022-04-12 11:33:17
        junGong_hangMu.put("601137", "博威合金");//267	有色金属     -2.98	102.78	1.74	价格区间: 5日:0.00  	10日:0.00  	20日:0.00  	30日:0.00  	60日:0.00  	120日:0.00  	250日:19.55 		,当前价：13.01	,当前：2022-04-12 11:33:18
        junGong_hangMu.put("600456", "宝钛股份");//259	小金属       -1.29	225.99	0.92	价格区间: 5日:11.38 	10日:9.90  	20日:27.77 	30日:20.93 	60日:12.11 	120日:9.09  	250日:32.34 		,当前价：47.3	,当前：2022-04-12 11:33:19
        junGong_hangMu.put("002318", "久立特材");//257	钢铁行业     -2.01	137.98	0.68	价格区间: 5日:2.35  	10日:15.57 	20日:10.05 	30日:4.23  	60日:3.66  	120日:27.33 	250日:43.95 		,当前价：14.12	,当前：2022-04-12 11:33:20
        junGong_hangMu.put("002149", "西部材料");//238	小金属       -0.26	55.71	0.97	价格区间: 5日:3.23  	10日:3.11  	20日:2.43  	30日:0.97  	60日:0.80  	120日:0.48  	250日:1.42  		,当前价：11.41	,当前：2022-04-12 11:33:21
        junGong_hangMu.put("600391", "航发科技");//237	航天航空     0.42	63.05	3.57	价格区间: 5日:17.67 	10日:12.40 	20日:9.09  	30日:7.73  	60日:7.24  	120日:4.30  	250日:20.65 		,当前价：19.1	,当前：2022-04-12 11:33:22
        junGong_hangMu.put("000768", "中航西飞");//216	航天航空     -3.79	660.32	1.82	价格区间: 5日:5.26  	10日:3.43  	20日:3.43  	30日:2.71  	60日:2.58  	120日:1.42  	250日:5.22  		,当前价：23.85	,当前：2022-04-12 11:33:23
        junGong_hangMu.put("600893", "航发动力");//214	航天航空     -3.52	1008.13	2.56	价格区间: 5日:6.58  	10日:4.67  	20日:4.60  	30日:3.07  	60日:2.46  	120日:1.53  	250日:2.16  		,当前价：37.82	,当前：2022-04-12 11:33:24
        junGong_hangMu.put("600150", "中国船舶");//212	船舶制造     2.16	741.53	1.4 	价格区间: 5日:25.41 	10日:22.93 	20日:13.20 	30日:7.58  	60日:5.27  	120日:4.68  	250日:11.70 		,当前价：16.58	,当前：2022-04-12 11:33:25
    }

    /**
     * junGong 军工
     */
    public static Map<String, String> junGong = new HashMap<>();

    static {
        junGong.putAll(junGong_hangMu);//航母概念
    }

    /**
     * xinPian_guangKeJiao ["光刻胶"]：13;
     */
    public static Map<String, String> xinPian_guangKeJiao = new HashMap<>();

    static {
        xinPian_guangKeJiao.put("002584", "西陇科学");//291	电子化学品   1.28	55.36	null	价格区间: 5日:19.31 	10日:16.18 	20日:13.68 	30日:19.61 	60日:22.14 	120日:47.04 	250日:48.99 		,当前价：9.46	,当前：2022-04-08 10:54:40
        xinPian_guangKeJiao.put("603650", "彤程新材");//289	橡胶制品     1.14	202.14	null	价格区间: 5日:40.43 	10日:30.73 	20日:19.41 	30日:19.41 	60日:17.20 	120日:5.14  	250日:9.09  		,当前价：33.85	,当前：2022-04-08 10:54:42
        xinPian_guangKeJiao.put("603078", "江化微  ");//246	电子化学品   4.35	57.85	null	价格区间: 5日:63.86 	10日:40.53 	20日:32.63 	30日:40.12 	60日:50.65 	120日:57.74 	250日:57.49 		,当前价：29.52	,当前：2022-04-08 10:54:44
        xinPian_guangKeJiao.put("002409", "雅克科技");//224	半导体       0.04	227.59	null	价格区间: 5日:27.84 	10日:16.79 	20日:13.86 	30日:9.75  	60日:5.93  	120日:4.44  	250日:3.07  		,当前价：47.82	,当前：2022-04-08 10:54:45
        xinPian_guangKeJiao.put("605589", "圣泉集团");//218	化学制品     0.54	217.17	null	价格区间: 5日:32.09 	10日:12.93 	20日:7.69  	30日:7.69  	60日:4.92  	120日:3.68  	250日:3.27  		,当前价：28.03	,当前：2022-04-08 10:54:46
        xinPian_guangKeJiao.put("603306", "华懋科技");//215	汽车零部件   -0.2	90.97	null	价格区间: 5日:26.32 	10日:18.12 	20日:15.49 	30日:11.46 	60日:11.46 	120日:7.86  	250日:22.34 		,当前价：29.63	,当前：2022-04-08 10:54:47
    }

    /**
     * xinPian_zhongXin ["中芯概念"]：19;
     */
    public static Map<String, String> xinPian_zhongXin = new HashMap<>();

    static {
        xinPian_zhongXin.put("600141", "兴发集团");//382	化肥行业     10   	414.56	3.77	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:52.54 	60日:64.44 	120日:31.99 	250日:53.67 		,当前价：37.29	,当前：2022-04-08 11:32:19
        xinPian_zhongXin.put("002371", "北方华创");//321	半导体       1.46	1383.69	1.32	价格区间: 5日:19.89 	10日:14.37 	20日:8.51  	30日:8.51  	60日:23.90 	120日:10.68 	250日:38.66 		,当前价：263.15	,当前：2022-04-08 11:32:20
        xinPian_zhongXin.put("600378", "昊华科技");//296	化学制品     0.08	363.46	0.87	价格区间: 5日:73.77 	10日:45.01 	20日:68.16 	30日:68.16 	60日:69.07 	120日:55.19 	250日:68.73 		,当前价：39.54	,当前：2022-04-08 11:32:21
        xinPian_zhongXin.put("603690", "至纯科技");//280	专用设备     1.08	113.32	1.46	价格区间: 5日:34.00 	10日:32.69 	20日:25.86 	30日:16.95 	60日:9.25  	120日:4.90  	250日:19.69 		,当前价：35.58	,当前：2022-04-08 11:32:22
    }

    /**
     * xinPian_qiCheXinPian 汽车芯片
     */
    public static Map<String, String> xinPian_qiCheXinPian = new HashMap<>();

    static {
        xinPian_qiCheXinPian.put("605111", "新洁能  ");//321	半导体       0.13	193.52	1.53	价格区间: 5日:17.06 	10日:6.73  	20日:5.06  	30日:5.06  	60日:5.06  	120日:15.70 	250日:17.34 		,当前价：135.5	,当前：2022-04-08 11:34:39
        xinPian_qiCheXinPian.put("605358", "立昂微  ");//268	半导体       3.93	404.74	2.64	价格区间: 5日:48.71 	10日:24.86 	20日:11.89 	30日:10.11 	60日:9.33  	120日:5.88  	250日:13.66 		,当前价：88.5	,当前：2022-04-08 11:34:41
        xinPian_qiCheXinPian.put("603986", "兆易创新");//260	半导体       0.93	895.87	1.18	价格区间: 5日:19.71 	10日:10.32 	20日:8.01  	30日:8.01  	60日:7.84  	120日:5.26  	250日:16.97 		,当前价：134.22	,当前：2022-04-08 11:34:42
        xinPian_qiCheXinPian.put("002049", "紫光国微");//251	半导体       -1.21	1172.09	2.52	价格区间: 5日:14.59 	10日:14.54 	20日:10.88 	30日:8.26  	60日:10.18 	120日:17.29 	250日:61.63 		,当前价：193.14	,当前：2022-04-08 11:34:43
    }

    /**
     * xinPian_PVDF ["PVDF概念"]：5;
     */
    public static Map<String, String> xinPian_pvdf = new HashMap<>();

    static {
        xinPian_pvdf.put("603659", "璞泰来  ");//332	电池         3.35	1001.65	1.76	价格区间: 5日:84.07 	10日:91.06 	20日:92.63 	30日:85.91 	60日:71.59 	120日:34.11 	250日:59.01 		,当前价：144.25	,当前：2022-04-08 12:07:31
        xinPian_pvdf.put("600378", "昊华科技");//296	化学制品     0.08	363.46	0.87	价格区间: 5日:73.77 	10日:45.01 	20日:68.16 	30日:68.16 	60日:69.07 	120日:55.19 	250日:68.73 		,当前价：39.54	,当前：2022-04-08 12:07:32
    }

    /**
     * xinPian 芯片：中芯概念,汽车芯片,光刻胶,
     */
    public static Map<String, String> xinPian = new HashMap<>();

    static {
        xinPian.putAll(xinPian_zhongXin);//中芯概念
        xinPian.putAll(xinPian_qiCheXinPian);//汽车芯片
        xinPian.putAll(xinPian_guangKeJiao);//光刻胶
        xinPian.putAll(xinPian_pvdf);//PVDF概念
    }



    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(xinPian);//芯片
        all.putAll(shuZi);//数字经济：数字货币,电子身份证

        all.putAll(dianLi);//电力：抽水蓄能
        all.putAll(xinNengYuan);//新能源
        all.putAll(chuanMei);//传媒
        all.putAll(youXi);//游戏
        all.putAll(junGong);//军工
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(shuZi, date);// all  shuZi
//        StockStatDemo.checkMaDemo(xinPian, date);//
    }
}
