package utils;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：医疗
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStYiLiao {

    /**
     * ["新冠药物"]：9;
     */
    public static Map<String, String> xinGuanYaoWu = new HashMap<>();

    static {
        xinGuanYaoWu.put("002349", "精华制药");//474	中药    	-4.27	131.49	6.69	价格区间: 5日:75.98 	10日:84.56 	20日:84.56 	30日:85.92 	60日:64.76 	120日:65.90 	250日:67.58 		,当前价：16.15	,当前：2022-03-18 10:52:29
        xinGuanYaoWu.put("002603", "以岭药业");//345	中药    	0.46	509.73	5.76	价格区间: 5日:74.54 	10日:87.59 	20日:87.59 	30日:89.21 	60日:91.90 	120日:92.42 	250日:92.93 		,当前价：30.51	,当前：2022-03-18 10:52:30
        xinGuanYaoWu.put("600196", "复星医药");//307	化学制药	2.68	1295.29	11.61	价格区间: 5日:81.78 	10日:87.66 	20日:87.66 	30日:87.66 	60日:86.91 	120日:54.47 	250日:27.07 		,当前价：50.54	,当前：2022-03-18 10:52:32
        xinGuanYaoWu.put("002584", "西陇科学");//297	电子化学品	-3.86	62.68	3.77	价格区间: 5日:45.56 	10日:67.44 	20日:72.24 	30日:73.37 	60日:57.03 	120日:65.43 	250日:67.59 		,当前价：10.71	,当前：2022-03-18 10:52:33
        xinGuanYaoWu.put("600668", "尖峰集团");//285	水泥建材	-2.53	71.64	3.88	价格区间: 5日:38.07 	10日:41.14 	20日:52.32 	30日:52.10 	60日:66.95 	120日:70.66 	250日:71.69 		,当前价：20.82	,当前：2022-03-18 10:52:34
    }

    /**
     * changShouYao ["长寿药"]：7;
     */
    public static Map<String, String> changShouYao = new HashMap<>();

    static {
        changShouYao.put("002317", "众生药业");//322	中药    	2.67	112.88	2.96	价格区间: 5日:55.23 	10日:80.56 	20日:83.22 	30日:84.35 	60日:68.53 	120日:75.13 	250日:76.27 		,当前价：13.86	,当前：2022-03-18 11:21:47
        changShouYao.put("002626", "金达威  ");//218	食品饮料	9.99	190.06	3.25	价格区间: 5日:100.00	10日:61.78 	20日:61.78 	30日:61.78 	60日:61.78 	120日:57.21 	250日:18.99 		,当前价：30.83	,当前：2022-03-18 11:21:50
        changShouYao.put("600298", "安琪酵母");//177	食品饮料	-0.09	366.96	1.29	价格区间: 5日:58.31 	10日:58.45 	20日:19.09 	30日:16.19 	60日:12.68 	120日:12.68 	250日:18.03 		,当前价：44.06	,当前：2022-03-18 11:21:51
    }

    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(xinGuanYaoWu);
        all.putAll(changShouYao);
    }
}
