package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：科技
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStKeJi {

    /**
     * xinNengYuan_dianChi ["固态电池"]：11;
     */
    public static Map<String, String> xinNengYuan_guTaiDianChi = new HashMap<>();

    static {
        xinNengYuan_guTaiDianChi.put("601127", "小康股份");//386	汽车整车	4.53	611.97	2.07	价格区间: 5日:99.84 	10日:99.22 	20日:99.39 	30日:82.71 	60日:35.53 	120日:20.25 	250日:39.42 		,当前价：45.0	,当前：2022-04-01 10:47:40
        xinNengYuan_guTaiDianChi.put("002466", "天齐锂业");//344	能源金属	0.65	1210.04	1.57	价格区间: 5日:61.52 	10日:44.49 	20日:40.79 	30日:27.58 	60日:21.51 	120日:14.88 	250日:45.82 		,当前价：81.92	,当前：2022-04-01 10:47:41
        xinNengYuan_guTaiDianChi.put("600884", "杉杉股份");//317	电子元件	0.82	603.23	2.31	价格区间: 5日:75.25 	10日:75.25 	20日:82.91 	30日:67.86 	60日:41.60 	120日:18.47 	250日:49.95 		,当前价：28.15	,当前：2022-04-01 10:47:42
        xinNengYuan_guTaiDianChi.put("002709", "天赐材料");//312	化学制品	3.6 	937.33	2.85	价格区间: 5日:77.67 	10日:39.50 	20日:60.08 	30日:60.08 	60日:42.67 	120日:17.47 	250日:44.17 		,当前价：97.38	,当前：2022-04-01 10:47:44
        xinNengYuan_guTaiDianChi.put("000009", "中国宝安");//294	综合行业	1.97	294.29	2.45	价格区间: 5日:48.81 	10日:32.80 	20日:33.99 	30日:21.25 	60日:19.10 	120日:7.34  	250日:13.40 		,当前价：11.41	,当前：2022-04-01 10:47:45
        xinNengYuan_guTaiDianChi.put("002594", "比亚迪  ");//273	汽车整车	2.71	6871.17	1.98	价格区间: 5日:96.83 	10日:58.34 	20日:71.16 	30日:62.70 	60日:42.25 	120日:23.87 	250日:51.01 		,当前价：236.03	,当前：2022-04-01 10:47:46
        xinNengYuan_guTaiDianChi.put("002091", "江苏国泰");//271	贸易行业	3.78	158.70	4.12	价格区间: 5日:89.83 	10日:43.09 	20日:33.94 	30日:20.36 	60日:11.67 	120日:11.67 	250日:36.42 		,当前价：10.15	,当前：2022-04-01 10:47:47
        xinNengYuan_guTaiDianChi.put("002460", "赣锋锂业");//266	能源金属	1.73	1837.39	2.6 	价格区间: 5日:85.99 	10日:70.08 	20日:51.24 	30日:34.70 	60日:34.70 	120日:19.75 	250日:31.61 		,当前价：127.82	,当前：2022-04-01 10:47:48
        xinNengYuan_guTaiDianChi.put("002074", "国轩高科");//264	电池    	0.84	577.65	1.37	价格区间: 5日:55.56 	10日:28.80 	20日:50.64 	30日:24.37 	60日:13.82 	120日:8.14  	250日:12.48 		,当前价：34.7	,当前：2022-04-01 10:47:49
    }

    /**
     * xinNengYuan_daoPianDianChi ["刀片电池"]：4;
     */
    public static Map<String, String> xinNengYuan_daoPianDianChi = new HashMap<>();

    static {
        xinNengYuan_daoPianDianChi.put("002466", "天齐锂业");//344	能源金属	0.65	1210.04	1.57	价格区间: 5日:61.52 	10日:44.49 	20日:40.79 	30日:27.58 	60日:21.51 	120日:14.88 	250日:45.82 		,当前价：81.92	,当前：2022-04-01 10:55:13
        xinNengYuan_daoPianDianChi.put("002824", "和胜股份");//334	有色金属	-0.81	63.26	1.5 	价格区间: 5日:14.56 	10日:14.56 	20日:45.36 	30日:35.11 	60日:21.82 	120日:30.52 	250日:52.39 		,当前价：34.24	,当前：2022-04-01 10:55:15
//        xinNengYuan_daoPianDianChi.put("603032", "*ST德新 ");//315	铁路公路	-1.03	101.61	1.29	价格区间: 5日:51.00 	10日:28.63 	20日:54.17 	30日:48.63 	60日:27.13 	120日:48.16 	250日:62.93 		,当前价：60.72	,当前：2022-04-01 10:55:16
        xinNengYuan_daoPianDianChi.put("002594", "比亚迪  ");//273	汽车整车	2.71	6871.17	1.98	价格区间: 5日:88.75 	10日:53.47 	20日:67.79 	30日:59.73 	60日:40.25 	120日:22.74 	250日:50.28 		,当前价：236.03	,当前：2022-04-01 10:55:18
    }

    /**
     * yuanYuZhou["元宇宙概念"]：31;
     */
    public static Map<String, String> chuanMei_yuanYuZhou = new HashMap<>();

    static {
        chuanMei_yuanYuZhou.put("000665", "湖北广电");//395	文化传媒	10.05	88.86	25.36	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:86.42 	60日:42.63 	120日:56.87 	250日:56.87 		,当前价：8.76	,当前：2022-03-28 13:15:47
        chuanMei_yuanYuZhou.put("002354", "天娱数科");//375	游戏    	4.98	87.60	29.28	价格区间: 5日:71.72 	10日:73.83 	20日:59.85 	30日:65.13 	60日:33.67 	120日:56.47 	250日:57.79 		,当前价：5.27	,当前：2022-03-28 13:15:49
        chuanMei_yuanYuZhou.put("000810", "创维数字");//370	家电行业	-2.01	155.24	4.02	价格区间: 5日:51.85 	10日:77.06 	20日:77.65 	30日:82.43 	60日:81.31 	120日:86.55 	250日:86.55 		,当前价：14.6	,当前：2022-03-28 13:15:50
        chuanMei_yuanYuZhou.put("603466", "风语筑  ");//365	文化传媒	3.6 	97.26	8.43	价格区间: 5日:67.21 	10日:78.87 	20日:72.78 	30日:70.34 	60日:24.28 	120日:41.90 	250日:46.76 		,当前价：23.05	,当前：2022-03-28 13:15:51
        chuanMei_yuanYuZhou.put("002036", "联创电子");//318	光学光电子	-3.63	163.57	6.41	价格区间: 5日:5.08  	10日:35.88 	20日:20.17 	30日:18.18 	60日:8.97  	120日:8.26  	250日:35.44 		,当前价：15.39	,当前：2022-03-28 13:15:52
    }
    /**
     * guangDian ["广电"]：13;
     */
    public static Map<String, String> chuanMei_guangDian = new HashMap<>();

    static {
        chuanMei_guangDian.put("000665", "湖北广电");//395	文化传媒	10.05	88.86	25.36	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:86.42 	60日:42.63 	120日:56.87 	250日:56.87 		,当前价：8.76	,当前：2022-03-28 13:11:22
        chuanMei_guangDian.put("600996", "贵广网络");//376	文化传媒	10.03	92.34	4.05	价格区间: 5日:100.00	10日:100.00	20日:52.00 	30日:41.56 	60日:60.03 	120日:63.87 	250日:63.87 		,当前价：8.78	,当前：2022-03-28 13:11:24
        chuanMei_guangDian.put("000810", "创维数字");//370	家电行业	-2.01	155.24	4.02	价格区间: 5日:51.85 	10日:77.06 	20日:77.65 	30日:82.43 	60日:81.31 	120日:86.55 	250日:86.55 		,当前价：14.6	,当前：2022-03-28 13:11:25
    }
    /**
     * huaWeiOLa ["华为欧拉"]：2;
     */
    public static Map<String, String> chuanMei_huaWeiOLa = new HashMap<>();

    static {
        chuanMei_huaWeiOLa.put("002261", "拓维信息");//251	软件开发	6.99	91.73	17.11	价格区间: 5日:71.43 	10日:72.97 	20日:43.20 	30日:31.21 	60日:19.71 	120日:16.17 	250日:25.63 		,当前价：7.35	,当前：2022-03-28 12:13:22
        chuanMei_huaWeiOLa.put("600536", "中国软件");//196	互联网服务	2.23	197.18	3.41	价格区间: 5日:49.82 	10日:68.42 	20日:25.87 	30日:25.87 	60日:16.61 	120日:13.96 	250日:9.61  		,当前价：39.87	,当前：2022-03-28 12:13:24
    }
    /**
     * hongMeng ["鸿蒙概念"]：12;
     */
    public static Map<String, String> chuanMei_hongMeng = new HashMap<>();

    static {
        chuanMei_hongMeng.put("000681", "视觉中国");//345	文化传媒	4.88	111.46	10.45	价格区间: 5日:77.17 	10日:86.00 	20日:82.01 	30日:55.93 	60日:18.71 	120日:25.54 	250日:31.11 		,当前价：15.91	,当前：2022-03-28 12:03:32
        chuanMei_hongMeng.put("002268", "卫士通  ");//329	软件开发	-4.4	362.13	3.81	价格区间: 5日:2.20  	10日:31.83 	20日:37.90 	30日:41.96 	60日:29.20 	120日:21.91 	250日:54.66 		,当前价：42.79	,当前：2022-03-28 12:03:34
        chuanMei_hongMeng.put("003032", "传智教育");//262	教育    	10.03	63.55	11.2	价格区间: 5日:100.00	10日:100.00	20日:44.12 	30日:34.80 	60日:22.86 	120日:16.11 	250日:7.73  		,当前价：15.79	,当前：2022-03-28 12:03:35
        chuanMei_hongMeng.put("000158", "常山北明");//261	综合行业	9.97	109.35	37.4	价格区间: 5日:100.00	10日:100.00	20日:63.11 	30日:43.50 	60日:41.33 	120日:34.62 	250日:23.72 		,当前价：6.84	,当前：2022-03-28 12:03:36
        chuanMei_hongMeng.put("002261", "拓维信息");//252	软件开发	6.99	91.73	17.11	价格区间: 5日:71.43 	10日:72.97 	20日:43.20 	30日:31.21 	60日:19.71 	120日:16.17 	250日:25.63 		,当前价：7.35	,当前：2022-03-28 12:03:37
        chuanMei_hongMeng.put("002624", "完美世界");//236	游戏    	1.09	251.03	3.74	价格区间: 5日:22.55 	10日:70.52 	20日:70.52 	30日:59.25 	60日:18.62 	120日:14.98 	250日:13.10 		,当前价：12.94	,当前：2022-03-28 12:03:38
        chuanMei_hongMeng.put("002123", "梦网科技");//214	通信服务	1.27	102.28	5.25	价格区间: 5日:50.56 	10日:55.97 	20日:24.51 	30日:20.72 	60日:11.85 	120日:7.24  	250日:5.68  		,当前价：12.75	,当前：2022-03-28 12:03:39
        chuanMei_hongMeng.put("000997", "新大陆  ");//200	互联网服务	0.24	169.26	3.1 	价格区间: 5日:17.44 	10日:13.23 	20日:26.57 	30日:26.57 	60日:24.93 	120日:39.00 	250日:54.02 		,当前价：16.4	,当前：2022-03-28 12:03:40
    }
    /**
     * netGaiNian ["NFT概念"]：13;
     */
    public static Map<String, String> chuanMei_nft = new HashMap<>();

    static {
        chuanMei_nft.put("603466", "风语筑  ");//353	文化传媒	0.4 	96.21	2.93	价格区间: 5日:40.27 	10日:56.17 	20日:71.46 	30日:66.22 	60日:22.09 	120日:39.47 	250日:45.22 		,当前价：22.8	,当前：2022-04-01 10:10:59
        chuanMei_nft.put("000681", "视觉中国");//343	文化传媒	-0.93	112.44	3.09	价格区间: 5日:61.17 	10日:70.86 	20日:80.25 	30日:80.25 	60日:22.60 	120日:29.11 	250日:34.41 		,当前价：16.05	,当前：2022-04-01 10:11:01
        chuanMei_nft.put("600986", "浙文互联");//317	文化传媒	2.48	87.28	5.16	价格区间: 5日:80.21 	10日:81.00 	20日:89.08 	30日:89.08 	60日:33.55 	120日:46.70 	250日:49.26 		,当前价：6.6	,当前：2022-04-01 10:11:04
    }

    /**
     * ["虚拟数字人"]：9;
     */
    public static Map<String, String> chuanMei_xunNiShuZiRen = new HashMap<>();

    static {
        chuanMei_xunNiShuZiRen.put("002354", "天娱数科");//370	游戏    	3.78	86.60	29.28	价格区间: 5日:85.86 	10日:86.92 	20日:70.45 	30日:74.34 	60日:38.44 	120日:59.60 	250日:60.82 		,当前价：5.21	,当前：2022-03-28 09:55:38
        chuanMei_xunNiShuZiRen.put("603466", "风语筑  ");//365	文化传媒	3.37	97.05	8.43	价格区间: 5日:77.60 	10日:85.56 	20日:78.96 	30日:76.31 	60日:26.34 	120日:43.48 	250日:48.21 		,当前价：23.0	,当前：2022-03-28 09:55:39
        chuanMei_xunNiShuZiRen.put("600986", "浙文互联");//322	文化传媒	2.15	81.73	4.39	价格区间: 5日:46.58 	10日:70.90 	20日:73.47 	30日:73.47 	60日:23.38 	120日:38.54 	250日:41.49 		,当前价：6.18	,当前：2022-03-28 09:55:41
        chuanMei_xunNiShuZiRen.put("002059", "云南旅游");//299	旅游酒店	-0.91	66.11	3.09	价格区间: 5日:62.71 	10日:64.76 	20日:67.83 	30日:43.33 	60日:46.22 	120日:53.75 	250日:55.64 		,当前价：6.53	,当前：2022-03-28 09:55:42
        chuanMei_xunNiShuZiRen.put("002230", "科大讯飞");//150	软件开发	-0.71	1072.68	3.21	价格区间: 5日:14.54 	10日:45.56 	20日:35.23 	30日:31.38 	60日:25.61 	120日:17.47 	250日:11.34 		,当前价：46.15	,当前：2022-03-28 09:55:52
    }

    /**
     * dianLi_chouShuiXuNeng ["抽水蓄能"]：19;
     */
    public static Map<String, String> dianLi_chouShuiXuNeng = new HashMap<>();

    static {
        dianLi_chouShuiXuNeng.put("002060", "粤水电  ");//368	工程建设	10.02	113.49	3.53	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：9.44	,当前：2022-03-30 13:50:13
        dianLi_chouShuiXuNeng.put("600032", "浙江新能");//358	电力行业	1.89	302.64	4.62	价格区间: 5日:57.58 	10日:64.41 	20日:71.43 	30日:71.43 	60日:71.43 	120日:46.39 	250日:66.95 		,当前价：14.55	,当前：2022-03-30 13:50:15
        dianLi_chouShuiXuNeng.put("000400", "许继电气");//326	电网设备	7.79	195.41	4.47	价格区间: 5日:88.08 	10日:65.38 	20日:42.64 	30日:39.75 	60日:19.72 	120日:15.80 	250日:33.62 		,当前价：19.38	,当前：2022-03-30 13:50:16
        dianLi_chouShuiXuNeng.put("000875", "吉电股份");//313	电力行业	0.78	251.12	1.07	价格区间: 5日:57.58 	10日:34.55 	20日:60.87 	30日:65.88 	60日:67.42 	120日:70.36 	250日:75.98 		,当前价：9.0	,当前：2022-03-30 13:50:17
        dianLi_chouShuiXuNeng.put("601669", "中国电建");//290	工程建设	5.19	1115.30	3.55	价格区间: 5日:93.10 	10日:73.97 	20日:41.83 	30日:25.70 	60日:20.25 	120日:34.03 	250日:57.48 		,当前价：7.29	,当前：2022-03-30 13:50:18
        dianLi_chouShuiXuNeng.put("600956", "新天绿能");//266	燃气    	-0.07	562.75	0.89	价格区间: 5日:26.98 	10日:49.45 	20日:44.60 	30日:44.60 	60日:26.22 	120日:15.25 	250日:23.76 		,当前价：13.44	,当前：2022-03-30 13:50:20
        dianLi_chouShuiXuNeng.put("600875", "东方电气");//262	电源设备	3.46	438.22	1.96	价格区间: 5日:34.90 	10日:28.42 	20日:25.87 	30日:24.52 	60日:9.82  	120日:8.57  	250日:29.93 		,当前价：14.05	,当前：2022-03-30 13:50:22
        dianLi_chouShuiXuNeng.put("002202", "金风科技");//210	风电设备	3.24	564.89	1.95	价格区间: 5日:52.03 	10日:41.29 	20日:23.44 	30日:23.19 	60日:16.16 	120日:7.76  	250日:23.13 		,当前价：13.37	,当前：2022-03-30 13:50:27
    }

    /**
     * shuZiHuoBi 概念：["数字货币"];股票个数：24;
     */
    public static Map<String, String> shuZi_shuZiHuoBi = new HashMap<>();

    static {
        shuZi_shuZiHuoBi.put("603123", "翠微股份");//479	商业百货	10.01	152.80	1.43	价格区间: 5日:91.92 	10日:65.18 	20日:68.70 	30日:32.61 	60日:50.02 	120日:53.38 	250日:53.38 		,当前价：19.13	,当前：2022-03-31 15:26:55
        shuZi_shuZiHuoBi.put("002537", "海联金汇");//462	汽车零部件	5.74	147.10	1.24	价格区间: 5日:77.17 	10日:69.35 	20日:84.34 	30日:86.06 	60日:87.46 	120日:90.24 	250日:90.35 		,当前价：12.53	,当前：2022-03-31 15:26:56
        shuZi_shuZiHuoBi.put("003040", "楚天龙  ");//393	通信设备	9.98	102.65	1.27	价格区间: 5日:100.00	10日:81.92 	20日:63.11 	30日:42.60 	60日:25.51 	120日:25.51 	250日:38.42 		,当前价：22.26	,当前：2022-03-31 15:26:57
        shuZi_shuZiHuoBi.put("002268", "卫士通  ");//345	软件开发	0.07	384.30	1.08	价格区间: 5日:72.04 	10日:55.68 	20日:64.10 	30日:64.10 	60日:42.40 	120日:31.30 	250日:60.12 		,当前价：45.41	,当前：2022-03-31 15:26:59
        shuZi_shuZiHuoBi.put("002987", "京北方  ");//335	软件开发	5.71	88.35	1.51	价格区间: 5日:86.51 	10日:89.22 	20日:90.62 	30日:81.03 	60日:52.64 	120日:59.53 	250日:62.04 		,当前价：39.28	,当前：2022-03-31 15:27:00
        shuZi_shuZiHuoBi.put("002104", "恒宝股份");//295	通信设备	9.99	91.30	1.25	价格区间: 5日:100.00	10日:72.90 	20日:78.52 	30日:39.45 	60日:57.45 	120日:61.15 	250日:62.78 		,当前价：13.1	,当前：2022-03-31 15:27:01
        shuZi_shuZiHuoBi.put("000676", "智度股份");//286	文化传媒	1.46	88.72	1.13	价格区间: 5日:75.76 	10日:55.56 	20日:34.58 	30日:19.17 	60日:15.73 	120日:36.26 	250日:44.99 		,当前价：6.95	,当前：2022-03-31 15:27:02
        shuZi_shuZiHuoBi.put("002197", "证通电子");//262	计算机设备	5.82	69.30	1.73	价格区间: 5日:61.49 	10日:43.54 	20日:29.45 	30日:13.68 	60日:35.07 	120日:44.38 	250日:44.43 		,当前价：11.28	,当前：2022-03-31 15:27:04
        shuZi_shuZiHuoBi.put("002049", "紫光国微");//257	半导体  	-0.8	1241.22	0.61	价格区间: 5日:61.27 	10日:41.14 	20日:29.57 	30日:35.04 	60日:34.89 	120日:39.93 	250日:70.55 		,当前价：204.54	,当前：2022-03-31 15:27:05
        shuZi_shuZiHuoBi.put("002649", "博彦科技");//250	互联网服务	2.63	78.51	1.39	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:48.78 	60日:48.35 	120日:64.53 	250日:68.51 		,当前价：13.27	,当前：2022-03-31 15:27:06
        shuZi_shuZiHuoBi.put("002152", "广电运通");//172	计算机设备	2.21	263.98	1.74	价格区间: 5日:93.33 	10日:93.33 	20日:39.33 	30日:21.54 	60日:19.13 	120日:22.72 	250日:33.13 		,当前价：10.63	,当前：2022-03-31 15:27:14
//        ["跨境支付"]：16;
//        mapGn.put("002537", "海联金汇");//462	汽车零部件	5.74	147.10	1.24	价格区间: 5日:77.17 	10日:69.35 	20日:84.34 	30日:86.06 	60日:87.46 	120日:90.24 	250日:90.35 		,当前价：12.53	,当前：2022-03-31 15:35:28
//        mapGn.put("002987", "京北方  ");//335	软件开发	5.71	88.35	1.51	价格区间: 5日:86.51 	10日:89.22 	20日:90.62 	30日:81.03 	60日:52.64 	120日:59.53 	250日:62.04 		,当前价：39.28	,当前：2022-03-31 15:35:29
    }

    /**
     * shuZi_shuJuAnQuan
     */
    public static Map<String, String> shuZi_shuJuAnQuan = new HashMap<>();

    static {
        shuZi_shuJuAnQuan.put("002268", "卫士通  ");//348	软件开发	6.4 	382.86	4.06	价格区间: 5日:70.77 	10日:54.69 	20日:63.20 	30日:63.64 	60日:41.94 	120日:30.98 	250日:59.93 		,当前价：45.24	,当前：2022-03-30 14:52:57
        shuZi_shuJuAnQuan.put("603636", "南威软件");//295	互联网服务	1.2 	84.37	1   	价格区间: 5日:6.44  	10日:3.11  	20日:41.35 	30日:42.02 	60日:45.82 	120日:49.54 	250日:49.54 		,当前价：14.28	,当前：2022-03-30 14:52:58
        shuZi_shuJuAnQuan.put("002104", "恒宝股份");//266	通信设备	4.1 	83.07	1.08	价格区间: 5日:75.50 	10日:35.51 	20日:48.89 	30日:24.57 	60日:46.99 	120日:51.63 	250日:53.62 		,当前价：11.92	,当前：2022-03-30 14:53:00
    }

    /**
     * shuZi_dianZiShenFenZheng ["电子身份证"]：6;
     */
    public static Map<String, String> shuZi_dianZiShenFenZheng = new HashMap<>();

    static {
        shuZi_dianZiShenFenZheng.put("603636", "南威软件");//307	互联网服务	6.08	89.68	3.68	价格区间: 5日:41.42 	10日:18.58 	20日:49.78 	30日:50.00 	60日:53.37 	120日:56.79 	250日:56.79 		,当前价：15.18	,当前：2022-03-31 14:28:31
        shuZi_dianZiShenFenZheng.put("002232", "启明信息");//235	互联网服务	0.26	63.24	2.25	价格区间: 5日:16.89 	10日:16.09 	20日:29.57 	30日:22.57 	60日:8.00  	120日:25.52 	250日:25.52 		,当前价：15.48	,当前：2022-03-31 14:28:33
        shuZi_dianZiShenFenZheng.put("000997", "新大陆  ");//204	互联网服务	1.64	173.18	1.32	价格区间: 5日:69.49 	10日:40.00 	20日:37.43 	30日:37.43 	60日:35.12 	120日:47.28 	250日:60.26 		,当前价：16.78	,当前：2022-03-31 14:28:34
        shuZi_dianZiShenFenZheng.put("002152", "广电运通");//172	计算机设备	1.92	263.24	0.55	价格区间: 5日:88.00 	10日:88.00 	20日:37.08 	30日:20.31 	60日:18.03 	120日:21.67 	250日:32.29 		,当前价：10.6	,当前：2022-03-31 14:28:35
    }

    /**
     * yanHuTiLi ["盐湖提锂"]：19;
     */
    public static Map<String, String> yanHuTiLi = new HashMap<>();

    static {
        yanHuTiLi.put("000762", "西藏矿业");//398	采掘行业	-0.5	219.11	1.64	价格区间: 5日:49.77 	10日:58.06 	20日:24.94 	30日:24.06 	60日:19.85 	120日:12.78 	250日:39.25 		,当前价：42.07	,当前：2022-03-24 14:21:46
        yanHuTiLi.put("600338", "西藏珠峰");//396	有色金属	-0.1	267.41	1.31	价格区间: 5日:53.31 	10日:65.42 	20日:29.29 	30日:24.97 	60日:21.09 	120日:20.21 	250日:47.52 		,当前价：29.25	,当前：2022-03-24 14:21:47
        yanHuTiLi.put("000546", "金圆股份");//381	水泥建材	2.13	116.26	1.14	价格区间: 5日:80.47 	10日:45.56 	20日:24.45 	30日:37.19 	60日:46.18 	120日:62.85 	250日:70.29 		,当前价：14.89	,当前：2022-03-24 14:21:48
        yanHuTiLi.put("002240", "盛新锂能");//378	能源金属	5.8 	500.00	1.46	价格区间: 5日:89.15 	10日:89.98 	20日:91.74 	30日:91.74 	60日:83.36 	120日:49.62 	250日:66.94 		,当前价：57.78	,当前：2022-03-24 14:21:50
        yanHuTiLi.put("600773", "西藏城投");//369	房地产开发	-0.95	170.24	1.85	价格区间: 5日:37.35 	10日:57.38 	20日:28.11 	30日:27.56 	60日:14.31 	120日:11.58 	250日:41.28 		,当前价：20.77	,当前：2022-03-24 14:21:51
        yanHuTiLi.put("000408", "藏格矿业");//352	化肥行业	1.25	513.48	1.74	价格区间: 5日:61.63 	10日:33.13 	20日:21.00 	30日:21.00 	60日:31.85 	120日:48.49 	250日:72.79 		,当前价：32.49	,当前：2022-03-24 14:21:52
        yanHuTiLi.put("002466", "天齐锂业");//349	能源金属	0.73	1255.53	1.47	价格区间: 5日:57.46 	10日:52.39 	20日:35.35 	30日:33.87 	60日:26.41 	120日:18.27 	250日:47.31 		,当前价：85.0	,当前：2022-03-24 14:21:53
        yanHuTiLi.put("603799", "华友钴业");//346	能源金属	-2.23	1211.38	1.64	价格区间: 5日:37.89 	10日:67.35 	20日:35.21 	30日:35.21 	60日:35.21 	120日:24.60 	250日:42.54 		,当前价：99.18	,当前：2022-03-24 14:21:55
    }

    /**
     * shuZi_dongShuXiSuan ["东数西算"]：21;
     */
    public static Map<String, String> shuZi_dongShuXiSuan = new HashMap<>();

    static {
        shuZi_dongShuXiSuan.put("002837", "英维克  ");//402	专用设备	0.92	124.53	0.97	价格区间: 5日:27.44 	10日:63.52 	20日:63.52 	30日:62.78 	60日:48.44 	120日:41.59 	250日:61.21 		,当前价：37.25	,当前：2022-03-24 13:55:16
        shuZi_dongShuXiSuan.put("600510", "黑牡丹  ");//376	房地产开发	1.36	132.88	0.9 	价格区间: 5日:19.09 	10日:8.25  	20日:28.26 	30日:52.05 	60日:55.23 	120日:55.23 	250日:58.49 		,当前价：12.69	,当前：2022-03-24 13:55:18
        shuZi_dongShuXiSuan.put("600996", "贵广网络");//365	文化传媒	-1   	83.61	1.88	价格区间: 5日:44.30 	10日:32.73 	20日:12.21 	30日:25.49 	60日:47.57 	120日:52.61 	250日:52.61 		,当前价：7.95	,当前：2022-03-24 13:55:19
        shuZi_dongShuXiSuan.put("002354", "天娱数科");//330	游戏    	-3.2	75.47	1.53	价格区间: 5日:16.28 	10日:20.27 	20日:11.36 	30日:23.03 	60日:11.90 	120日:42.19 	250日:44.89 		,当前价：4.54	,当前：2022-03-24 13:55:20
        shuZi_dongShuXiSuan.put("000815", "美利云  ");//328	造纸印刷	2.9 	115.90	1.26	价格区间: 5日:27.05 	10日:31.47 	20日:53.72 	30日:68.34 	60日:68.97 	120日:70.49 	250日:71.57 		,当前价：16.67	,当前：2022-03-24 13:55:22
    }

    /**
     * teGaoYa ["特高压"]：33;
     */
    public static Map<String, String> teGaoYa = new HashMap<>();

    static {
        teGaoYa.put("002459", "晶澳科技");//386	光伏设备	3.29	1382.31	3.8 	价格区间: 5日:47.44 	10日:30.52 	20日:24.13 	30日:58.95 	60日:58.33 	120日:66.02 	250日:79.65 		,当前价：86.39	,当前：2022-03-23 10:33:37
        teGaoYa.put("600522", "中天科技");//350	通信设备	2.89	632.08	4.33	价格区间: 5日:38.46 	10日:54.72 	20日:45.74 	30日:59.27 	60日:68.74 	120日:82.58 	250日:84.45 		,当前价：18.52	,当前：2022-03-23 10:33:39
        teGaoYa.put("601126", "四方股份");//347	电网设备	5.26	115.47	8.83	价格区间: 5日:65.69 	10日:61.97 	20日:30.53 	30日:30.53 	60日:11.82 	120日:10.03 	250日:38.58 		,当前价：14.2	,当前：2022-03-23 10:33:41
        teGaoYa.put("601677", "明泰铝业");//331	有色金属	2.97	284.36	0.66	价格区间: 5日:87.17 	10日:91.08 	20日:57.57 	30日:57.57 	60日:57.57 	120日:67.35 	250日:79.80 		,当前价：41.66	,当前：2022-03-23 10:33:43
        teGaoYa.put("000400", "许继电气");//317	电网设备	4.74	195.92	5.7 	价格区间: 5日:76.96 	10日:84.03 	20日:46.88 	30日:38.12 	60日:18.68 	120日:18.24 	250日:35.55 		,当前价：19.43	,当前：2022-03-23 10:33:46
        teGaoYa.put("002545", "东方铁塔");//285	钢铁行业	-0.09	142.57	3.99	价格区间: 5日:73.38 	10日:68.61 	20日:53.68 	30日:63.54 	60日:70.07 	120日:73.96 	250日:78.68 		,当前价：11.46	,当前：2022-03-23 10:33:48
        teGaoYa.put("601669", "中国电建");//275	工程建设	0.96	1126.01	2.5 	价格区间: 5日:71.11 	10日:45.75 	20日:42.68 	30日:22.15 	60日:22.15 	120日:34.26 	250日:58.44 		,当前价：7.36	,当前：2022-03-23 10:33:49
    }

    /**
     * qingNengYuan ["氢能源"]：91;
     */
    public static Map<String, String> qingNengYuan = new HashMap<>();

    static {
        qingNengYuan.put("002537", "海联金汇");//464	汽车零部件	-4.37	136.07	10.29	价格区间: 5日:80.08 	10日:85.05 	20日:89.40 	30日:89.40 	60日:91.26 	120日:93.13 	250日:93.22 		,当前价：11.59	,当前：2022-03-23 10:05:14
        qingNengYuan.put("600277", "亿利洁能");//435	化学原料	3.69	250.31	11.4	价格区间: 5日:51.85 	10日:43.75 	20日:60.87 	30日:61.00 	60日:69.77 	120日:76.60 	250日:80.47 		,当前价：7.03	,当前：2022-03-23 10:05:16
        qingNengYuan.put("002639", "雪人股份");//393	通用设备	10.02	104.30	20.62	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:48.70 	120日:56.84 	250日:60.59 		,当前价：13.5	,当前：2022-03-23 10:05:18
        qingNengYuan.put("600860", "京城股份");//392	通用设备	10   	105.10	4.39	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:56.32 	120日:68.92 	250日:70.99 		,当前价：21.67	,当前：2022-03-23 10:05:19
        qingNengYuan.put("603938", "三孚股份");//370	化肥行业	-1.26	94.64	2.2 	价格区间: 5日:75.78 	10日:82.76 	20日:84.06 	30日:89.72 	60日:90.14 	120日:47.81 	250日:44.51 		,当前价：48.48	,当前：2022-03-23 10:05:20
        qingNengYuan.put("000980", "*ST众泰 ");//365	汽车整车	1.88	192.12	2.75	价格区间: 5日:52.63 	10日:43.21 	20日:29.17 	30日:22.29 	60日:9.83  	120日:5.38  	250日:20.95 		,当前价：3.79	,当前：2022-03-23 10:05:21
        qingNengYuan.put("002665", "首航高科");//356	电源设备	9.89	101.55	22.33	价格区间: 5日:100.00	10日:100.00	20日:65.74 	30日:65.74 	60日:29.96 	120日:40.29 	250日:55.73 		,当前价：4.0	,当前：2022-03-23 10:05:22
        qingNengYuan.put("600141", "兴发集团");//354	化肥行业	1.11	384.77	2.18	价格区间: 5日:62.71 	10日:44.54 	20日:22.78 	30日:27.72 	60日:42.59 	120日:17.53 	250日:48.00 		,当前价：34.61	,当前：2022-03-23 10:05:23
        qingNengYuan.put("600021", "上海电力");//351	电力行业	1.71	280.82	4.52	价格区间: 5日:91.89 	10日:44.19 	20日:43.02 	30日:29.23 	60日:16.22 	120日:28.35 	250日:41.33 		,当前价：10.73	,当前：2022-03-23 10:05:24
        qingNengYuan.put("603169", "兰石重装");//348	专用设备	10.06	118.61	26.5	价格区间: 5日:100.00	10日:98.06 	20日:64.33 	30日:64.33 	60日:33.72 	120日:51.59 	250日:56.75 		,当前价：9.08	,当前：2022-03-23 10:05:25
        qingNengYuan.put("002140", "东华科技");//343	工程建设	1.79	68.22	6.65	价格区间: 5日:85.58 	10日:62.38 	20日:39.13 	30日:39.13 	60日:30.69 	120日:35.90 	250日:62.34 		,当前价：12.51	,当前：2022-03-23 10:05:26
        qingNengYuan.put("000723", "美锦能源");//342	煤炭行业	6.76	620.47	28.85	价格区间: 5日:86.35 	10日:89.38 	20日:62.86 	30日:62.86 	60日:35.44 	120日:46.56 	250日:60.23 		,当前价：14.53	,当前：2022-03-23 10:05:27
        qingNengYuan.put("600032", "浙江新能");//341	电力行业	10.01	299.52	19.57	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:56.14 	120日:35.91 	250日:65.78 		,当前价：14.4	,当前：2022-03-23 10:05:28
        qingNengYuan.put("000875", "吉电股份");//326	电力行业	2.34	268.14	12.27	价格区间: 5日:83.84 	10日:91.30 	20日:92.04 	30日:92.42 	60日:69.26 	120日:81.65 	250日:85.39 		,当前价：9.61	,当前：2022-03-23 10:05:29
        qingNengYuan.put("002709", "天赐材料");//317	化学制品	-0.05	992.75	2.65	价格区间: 5日:30.39 	10日:68.50 	20日:80.63 	30日:80.63 	60日:52.75 	120日:23.45 	250日:48.21 		,当前价：103.43	,当前：2022-03-23 10:05:30
    }

    /**
     * ["绿色电力"]：67;
     */
    public static Map<String, String> lvSeDianLi = new HashMap<>();

    static {
        lvSeDianLi.put("002053", "云南能投");//401	化学原料	9.99	135.68	7.01	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：17.83	,当前：2022-03-18 10:41:56
        lvSeDianLi.put("600821", "金开新能");//397	电力行业	1.01	122.60	1.14	价格区间: 5日:39.85 	10日:28.96 	20日:28.65 	30日:25.73 	60日:9.76  	120日:23.01 	250日:41.02 		,当前价：7.98	,当前：2022-03-18 10:41:57
        lvSeDianLi.put("600021", "上海电力");//357	电力行业	2.8 	278.20	1.83	价格区间: 5日:54.27 	10日:33.58 	20日:33.58 	30日:22.14 	60日:12.66 	120日:25.18 	250日:38.75 		,当前价：10.63	,当前：2022-03-18 10:41:59
        lvSeDianLi.put("002256", "兆新股份");//356	电网设备	1.43	66.64	1.78	价格区间: 5日:65.00 	10日:49.06 	20日:32.91 	30日:32.91 	60日:14.73 	120日:13.52 	250日:41.65 		,当前价：3.54	,当前：2022-03-18 10:42:00
    }

    /**
     * foHuaGong ["氟化工"]：21;
     */
    public static Map<String, String> foHuaGong = new HashMap<>();

    static {
        foHuaGong.put("002738", "中矿资源");//446	小金属  	2.77	331.28	6.52	价格区间: 5日:98.12 	10日:90.60 	20日:61.23 	30日:83.49 	60日:83.81 	120日:84.88 	250日:89.88 		,当前价：101.85	,当前：2022-03-21 10:31:07
        foHuaGong.put("002326", "永太科技");//425	化学制品	10   	298.03	7.78	价格区间: 5日:100.00	10日:100.00	20日:59.75 	30日:59.75 	60日:25.31 	120日:14.07 	250日:35.04 		,当前价：34.0	,当前：2022-03-21 10:31:08
        foHuaGong.put("600096", "云天化  ");//421	化肥行业	2.83	440.25	2.13	价格区间: 5日:40.12 	10日:40.08 	20日:54.85 	30日:70.57 	60日:72.56 	120日:37.74 	250日:56.42 		,当前价：23.98	,当前：2022-03-21 10:31:09
        foHuaGong.put("002759", "天际股份");//382	家电行业	5.02	127.00	18.77	价格区间: 5日:87.83 	10日:91.62 	20日:91.62 	30日:91.62 	60日:91.62 	120日:28.66 	250日:45.56 		,当前价：31.58	,当前：2022-03-21 10:31:10
        foHuaGong.put("002411", "延安必康");//371	医药商业	1.68	157.21	5.37	价格区间: 5日:91.18 	10日:92.15 	20日:80.37 	30日:80.37 	60日:44.00 	120日:24.54 	250日:43.91 		,当前价：10.26	,当前：2022-03-21 10:31:11
        foHuaGong.put("600141", "兴发集团");//350	化肥行业	0.14	395.22	2.86	价格区间: 5日:83.23 	10日:45.20 	20日:31.66 	30日:47.28 	60日:49.20 	120日:20.24 	250日:49.71 		,当前价：35.55	,当前：2022-03-21 10:31:12
        foHuaGong.put("603026", "石大胜华");//327	化学制品	2.11	317.19	3.33	价格区间: 5日:90.31 	10日:93.73 	20日:43.00 	30日:43.00 	60日:32.75 	120日:11.19 	250日:34.45 		,当前价：156.5	,当前：2022-03-21 10:31:13
        foHuaGong.put("002709", "天赐材料");//317	化学制品	2.68	1013.96	2.06	价格区间: 5日:78.84 	10日:87.98 	20日:87.98 	30日:87.98 	60日:57.56 	120日:25.59 	250日:49.69 		,当前价：105.64	,当前：2022-03-21 10:31:14
        foHuaGong.put("600884", "杉杉股份");//314	电子元件	2.83	607.52	2.06	价格区间: 5日:80.97 	10日:84.67 	20日:65.78 	30日:65.78 	60日:38.67 	120日:17.90 	250日:49.61 		,当前价：28.35	,当前：2022-03-21 10:31:15
        foHuaGong.put("002407", "多氟多  ");//312	化学制品	3.06	337.77	2.25	价格区间: 5日:88.80 	10日:95.45 	20日:77.52 	30日:77.52 	60日:77.52 	120日:29.62 	250日:54.32 		,当前价：44.09	,当前：2022-03-21 10:31:17
    }

    /**
     * shuZiJingJi 数字经济：数字货币,电子身份证,数据安全,东数西算
     */
    public static Map<String, String> shuZi = new HashMap<>();

    static {
        shuZi.putAll(shuZi_shuZiHuoBi);//数字货币
        shuZi.putAll(shuZi_dianZiShenFenZheng);//电子身份证
        shuZi.putAll(shuZi_shuJuAnQuan);//数据安全
        shuZi.putAll(shuZi_dongShuXiSuan);//东数西算
    }

    /**
     * dianLi 电力：抽水蓄能
     */
    public static Map<String, String> dianLi = new HashMap<>();

    static {
        dianLi.putAll(dianLi_chouShuiXuNeng);//抽水蓄能
    }

    /**
     * chuanMei:NFT概念,虚拟数字人,鸿蒙概念,华为欧拉,广电
     */
    public static Map<String, String> chuanMei = new HashMap<>();

    static {
        chuanMei.putAll(chuanMei_nft);//NFT概念
        chuanMei.putAll(chuanMei_xunNiShuZiRen);//虚拟数字人
        chuanMei.putAll(chuanMei_hongMeng);//鸿蒙概念
        chuanMei.putAll(chuanMei_huaWeiOLa);//华为欧拉
        chuanMei.putAll(chuanMei_guangDian);//广电
        chuanMei.putAll(chuanMei_yuanYuZhou);//元宇宙概念
    }

    /**
     * xinNengYuan 新能源
     */
    public static Map<String, String> xinNengYuan = new HashMap<>();

    static {
        xinNengYuan.putAll(xinNengYuan_guTaiDianChi);//固态电池
        xinNengYuan.putAll(xinNengYuan_daoPianDianChi);//刀片电池
    }

    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(lvSeDianLi);
        all.putAll(foHuaGong);
        
        all.putAll(shuZi);//数字经济：数字货币,电子身份证

        all.putAll(dianLi);//电力：抽水蓄能
        all.putAll(xinNengYuan);//新能源


        all.putAll(chuanMei);//传媒
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
//        StockStatDemo.checkMaDemo(chuanMei, date);//
        StockStatDemo.checkMaDemo(shuZi, date);//
    }
}
