package utils;

import ttjj.service.KlineService;
import ttjj.stat.StBizStatDemo;
import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：金融
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStJinRong {

    /**
     * guiJinShu_peiYuZuanShi ["培育钻石"]：4;
     */
    public static Map<String, String> guiJinShu_peiYuZuanShi = new HashMap<>();

    static {
        guiJinShu_peiYuZuanShi.put("600172", "黄河旋风");//398	非金属材料   4   	134.84	1.17	价格区间: 5日:96.15 	10日:62.89 	20日:69.11 	30日:72.17 	60日:69.94 	120日:42.96 	250日:67.74 		,当前价：9.35	,当前：2022-04-18 10:46:42
        guiJinShu_peiYuZuanShi.put("000519", "中兵红箭");//345	专用设备     1.29	284.92	0.95	价格区间: 5日:68.02 	10日:35.78 	20日:37.27 	30日:59.13 	60日:58.68 	120日:26.87 	250日:53.77 		,当前价：20.46	,当前：2022-04-18 10:46:44
    }

    /**
     * guiJinShu_huangJin ["黄金概念"]：36;
     */
    public static Map<String, String> guiJinShu_huangJin = new HashMap<>();

    static {
        guiJinShu_huangJin.put("000546", "金圆股份");//384	水泥建材     -2.33	121.33	2.43	价格区间: 5日:56.32 	10日:64.07 	20日:56.25 	30日:37.57 	60日:51.24 	120日:66.70 	250日:75.45 		,当前价：15.54	,当前：2022-04-08 11:52:48
        guiJinShu_huangJin.put("600596", "新安股份");//333	农药兽药     4.99	232.34	2.3 	价格区间: 5日:99.23 	10日:76.95 	20日:85.16 	30日:85.09 	60日:90.13 	120日:54.56 	250日:47.13 		,当前价：28.39	,当前：2022-04-08 11:52:49
        guiJinShu_huangJin.put("000688", "国城矿业");//317	有色金属     0.13	177.42	1.14	价格区间: 5日:17.57 	10日:13.83 	20日:39.30 	30日:28.26 	60日:46.44 	120日:59.98 	250日:63.61 		,当前价：15.6	,当前：2022-04-08 11:52:51
        guiJinShu_huangJin.put("000009", "中国宝安");//290	综合行业     -2.14	271.59	1.29	价格区间: 5日:12.67 	10日:10.61 	20日:9.36  	30日:4.51  	60日:4.08  	120日:1.61  	250日:9.17  		,当前价：10.53	,当前：2022-04-08 11:52:52
        guiJinShu_huangJin.put("601020", "ST华钰  ");//289	有色金属     -0.5	100.38	0.92	价格区间: 5日:81.20 	10日:86.94 	20日:89.93 	30日:89.93 	60日:94.07 	120日:94.07 	250日:96.46 		,当前价：17.94	,当前：2022-04-08 11:52:53
        guiJinShu_huangJin.put("000630", "铜陵有色");//272	有色金属     -0.52	403.17	1.25	价格区间: 5日:88.89 	10日:80.00 	20日:88.41 	30日:51.69 	60日:51.69 	120日:45.77 	250日:40.38 		,当前价：3.83	,当前：2022-04-08 11:52:54
        guiJinShu_huangJin.put("603979", "金诚信  ");//264	采掘行业     4.15	128.30	2.58	价格区间: 5日:88.57 	10日:71.70 	20日:79.70 	30日:48.83 	60日:47.01 	120日:52.86 	250日:50.49 		,当前价：21.6	,当前：2022-04-08 11:52:55
        guiJinShu_huangJin.put("600988", "赤峰黄金");//264	贵金属       9.95	347.42	3.74	价格区间: 5日:95.15 	10日:95.15 	20日:97.34 	30日:97.41 	60日:97.97 	120日:97.97 	250日:97.97 		,当前价：20.88	,当前：2022-04-08 11:52:56
        guiJinShu_huangJin.put("600490", "鹏欣资源");//263	有色金属     1.19	94.27	1.29	价格区间: 5日:51.61 	10日:20.51 	20日:10.06 	30日:7.58  	60日:7.58  	120日:6.72  	250日:11.07 		,当前价：4.26	,当前：2022-04-08 11:52:57
        guiJinShu_huangJin.put("002155", "湖南黄金");//255	贵金属       4.96	134.87	3.49	价格区间: 5日:85.06 	10日:66.67 	20日:57.39 	30日:40.62 	60日:45.33 	120日:45.33 	250日:37.22 		,当前价：11.22	,当前：2022-04-08 11:52:57
        guiJinShu_huangJin.put("600089", "特变电工");//251	电网设备     -1.9	744.76	1.64	价格区间: 5日:17.91 	10日:20.86 	20日:13.62 	30日:42.14 	60日:48.17 	120日:18.06 	250日:47.00 		,当前价：19.65	,当前：2022-04-08 11:52:58
        guiJinShu_huangJin.put("600711", "盛屯矿业");//245	能源金属     -1.8	231.66	1.49	价格区间: 5日:26.19 	10日:14.10 	20日:10.38 	30日:5.99  	60日:5.99  	120日:5.30  	250日:22.33 		,当前价：8.2	,当前：2022-04-08 11:52:59
    }

    /**
     * quanShangGaiNian 概念：["券商概念"];股票个数：51;
     */
    public static Map<String, String> quanShangGaiNian = new HashMap<>();

    static {
        quanShangGaiNian.put("002945", "华林证券");//302	证券         1.59	448.47	4.19	价格区间: 5日:87.12 	10日:87.62 	20日:49.72 	30日:50.64 	60日:62.48 	120日:70.21 	250日:70.21 		,当前价：16.61	,当前：2022-04-13 14:18:39
        quanShangGaiNian.put("600906", "财达证券");//242	证券         -0.28	351.11	3.28	价格区间: 5日:69.64 	10日:51.32 	20日:18.48 	30日:19.63 	60日:15.97 	120日:12.43 	250日:44.76 		,当前价：10.82	,当前：2022-04-13 14:18:41
        quanShangGaiNian.put("601696", "中银证券");//231	证券         10.03	445.04	11.94	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:49.48 		,当前价：16.02	,当前：2022-04-13 14:18:42
        quanShangGaiNian.put("002939", "长城证券");//225	证券         5.88	318.72	13.8	价格区间: 5日:84.48 	10日:85.83 	20日:85.83 	30日:65.27 	60日:26.78 	120日:20.49 	250日:22.01 		,当前价：10.27	,当前：2022-04-13 14:18:43
        quanShangGaiNian.put("000776", "广发证券");//222	证券         -1.02	1327.59	2.59	价格区间: 5日:50.35 	10日:43.03 	20日:63.14 	30日:49.09 	60日:20.77 	120日:14.10 	250日:25.91 		,当前价：17.42	,当前：2022-04-13 14:18:45
        quanShangGaiNian.put("600958", "东方证券");//219	证券         -0.47	737.83	3.15	价格区间: 5日:41.49 	10日:36.45 	20日:32.23 	30日:17.33 	60日:10.03 	120日:5.74  	250日:19.93 		,当前价：10.55	,当前：2022-04-13 14:18:46
        quanShangGaiNian.put("002670", "国盛金控");//208	证券         0.4 	195.64	6.06	价格区间: 5日:70.73 	10日:81.44 	20日:77.07 	30日:82.66 	60日:82.66 	120日:82.66 	250日:47.26 		,当前价：10.11	,当前：2022-04-13 14:18:46
    }

    /**
     * jianZhuJieNeng ["建筑节能"]：6;
     */
    public static Map<String, String> fangDiChan_jianZhuJieNeng = new HashMap<>();

    static {
        fangDiChan_jianZhuJieNeng.put("002761", "浙江建投");//465	工程建设	-4.58	409.61	10.56	价格区间: 5日:67.55 	10日:83.76 	20日:86.13 	30日:89.10 	60日:89.23 	120日:89.28 	250日:89.32 		,当前价：37.88	,当前：2022-03-22 11:00:58
        fangDiChan_jianZhuJieNeng.put("002810", "山东赫达");//263	化学制品	-2.39	145.29	1.42	价格区间: 5日:24.54 	10日:15.54 	20日:7.84  	30日:7.84  	60日:5.61  	120日:19.41 	250日:35.45 		,当前价：42.41	,当前：2022-03-22 11:00:59
        fangDiChan_jianZhuJieNeng.put("000517", "荣安地产");//237	房地产开发	7.4 	106.34	66.03	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：3.34	,当前：2022-03-22 11:01:00
        fangDiChan_jianZhuJieNeng.put("600586", "金晶科技");//235	玻璃玻纤	-0.95	118.59	3.11	价格区间: 5日:82.14 	10日:82.14 	20日:62.84 	30日:52.04 	60日:51.80 	120日:20.43 	250日:28.61 		,当前价：8.3	,当前：2022-03-22 11:01:01
    }

    /**
     * fangDiChan_zuShouTongQuan ["租售同权"]：14;
     */
    public static Map<String, String> fangDiChan_zuShouTongQuan = new HashMap<>();

    static {
        fangDiChan_zuShouTongQuan.put("000056", "皇庭国际");//345	房地产服务   5.05	107.59	4.44	价格区间: 5日:99.45 	10日:99.55 	20日:99.62 	30日:99.74 	60日:99.74 	120日:99.84 	250日:99.85 		,当前价：9.16	,当前：2022-04-21 10:36:09
        fangDiChan_zuShouTongQuan.put("000732", "泰禾集团");//333	房地产开发   -2.65	63.96	2.16	价格区间: 5日:10.87 	10日:6.94  	20日:4.35  	30日:9.09  	60日:28.57 	120日:41.80 	250日:41.80 		,当前价：2.57	,当前：2022-04-21 10:36:11
        fangDiChan_zuShouTongQuan.put("000671", "阳光城  ");//320	房地产开发   -2.2	110.55	2.09	价格区间: 5日:15.00 	10日:4.92  	20日:3.35  	30日:28.22 	60日:28.22 	120日:28.22 	250日:16.59 		,当前价：2.67	,当前：2022-04-21 10:36:12
        fangDiChan_zuShouTongQuan.put("002285", "世联行  ");//314	房地产服务   -2.35	67.51	1.5 	价格区间: 5日:7.14  	10日:3.33  	20日:2.37  	30日:22.17 	60日:22.17 	120日:22.17 	250日:8.29  		,当前价：3.32	,当前：2022-04-21 10:36:13
        fangDiChan_zuShouTongQuan.put("600048", "保利发展");//270	房地产开发   0.86	2104.38	1.97	价格区间: 5日:31.42 	10日:34.73 	20日:39.76 	30日:67.57 	60日:67.57 	120日:74.14 	250日:81.29 		,当前价：17.58	,当前：2022-04-21 10:36:14
        fangDiChan_zuShouTongQuan.put("001979", "招商蛇口");//252	房地产开发   1.63	1235.23	1.88	价格区间: 5日:26.92 	10日:29.63 	20日:50.52 	30日:67.08 	60日:67.08 	120日:77.49 	250日:78.34 		,当前价：15.59	,当前：2022-04-21 10:36:16
        fangDiChan_zuShouTongQuan.put("002244", "滨江集团");//243	房地产开发   0.93	202.55	2.81	价格区间: 5日:20.29 	10日:20.29 	20日:19.31 	30日:51.05 	60日:51.05 	120日:70.60 	250日:71.32 		,当前价：6.51	,当前：2022-04-21 10:36:17
        fangDiChan_zuShouTongQuan.put("000011", "深物业A");//229	房地产开发   -2.71	70.62	2.16	价格区间: 5日:27.07 	10日:14.81 	20日:26.54 	30日:43.51 	60日:43.51 	120日:43.51 	250日:43.51 		,当前价：11.85	,当前：2022-04-21 10:36:18
        fangDiChan_zuShouTongQuan.put("000560", "我爱我家");//219	房地产服务   -2.72	75.85	2.43	价格区间: 5日:13.51 	10日:8.93  	20日:5.88  	30日:38.46 	60日:38.46 	120日:38.46 	250日:20.16 		,当前价：3.22	,当前：2022-04-21 10:36:19
        fangDiChan_zuShouTongQuan.put("000002", "万科Ａ  ");//218	房地产开发   0.83	2268.11	1.98	价格区间: 5日:22.39 	10日:22.39 	20日:57.06 	30日:71.89 	60日:65.73 	120日:62.01 	250日:40.04 		,当前价：19.51	,当前：2022-04-21 10:36:20
    }

    /**
     * fangDiChan_haiMianChengShi 海绵城市
     */
    public static Map<String, String> fangDiChan_haiMianChengShi = new HashMap<>();

    static {
        fangDiChan_haiMianChengShi.put("002271", "东方雨虹");//265	装修建材     0.15	1141.90	null	价格区间: 5日:33.51 	10日:72.08 	20日:74.75 	30日:73.91 	60日:49.00 	120日:52.68 	250日:31.85 		,当前价：45.32	,当前：2022-04-08 10:01:51
        fangDiChan_haiMianChengShi.put("600502", "安徽建工");//259	工程建设     9.92	97.25	null	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：5.65	,当前：2022-04-08 10:01:53
        fangDiChan_haiMianChengShi.put("600512", "腾达建设");//245	工程建设     9.9 	69.23	null	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：4.33	,当前：2022-04-08 10:01:54
        fangDiChan_haiMianChengShi.put("002062", "宏润建设");//223	工程建设     5.82	62.18	null	价格区间: 5日:77.05 	10日:81.58 	20日:84.95 	30日:82.29 	60日:55.68 	120日:59.67 	250日:59.67 		,当前价：5.64	,当前：2022-04-08 10:01:55
        fangDiChan_haiMianChengShi.put("002372", "伟星新材");//219	装修建材     2.82	342.62	null	价格区间: 5日:72.30 	10日:83.00 	20日:85.75 	30日:65.86 	60日:46.28 	120日:55.98 	250日:51.27 		,当前价：21.52	,当前：2022-04-08 10:01:56
    }

    /**
     * reits ["REITs概念"]：16;
     */
    public static Map<String, String> fangDiChan_reits = new HashMap<>();

    static {
        fangDiChan_reits.put("002059", "云南旅游");//341	旅游酒店     2.52	78.16	null	价格区间: 5日:7.69  	10日:25.27 	20日:37.23 	30日:44.26 	60日:44.26 	120日:59.44 	250日:60.77 		,当前价：7.72	,当前：2022-04-19 11:05:22
        fangDiChan_reits.put("002314", "南山控股");//327	房地产开发   -0.65	124.56	null	价格区间: 5日:26.45 	10日:12.40 	20日:32.34 	30日:39.73 	60日:39.73 	120日:47.44 	250日:47.44 		,当前价：4.6	,当前：2022-04-19 11:05:24
        fangDiChan_reits.put("002285", "世联行  ");//308	房地产服务   0.29	70.97	null	价格区间: 5日:9.43  	10日:6.45  	20日:8.81  	30日:31.60 	60日:31.60 	120日:31.13 	250日:11.64 		,当前价：3.49	,当前：2022-04-19 11:05:25
        fangDiChan_reits.put("600466", "蓝光发展");//289	房地产开发   -0.51	58.88	null	价格区间: 5日:22.86 	10日:7.08  	20日:7.08  	30日:26.06 	60日:26.06 	120日:25.17 	250日:13.24 		,当前价：1.94	,当前：2022-04-19 11:05:26
        fangDiChan_reits.put("600048", "保利发展");//276	房地产开发   -0.27	2195.35	null	价格区间: 5日:52.73 	10日:52.73 	20日:60.38 	30日:76.52 	60日:76.52 	120日:81.27 	250日:86.45 		,当前价：18.34	,当前：2022-04-19 11:05:27
        fangDiChan_reits.put("001979", "招商蛇口");//250	房地产开发   -0.74	1280.40	null	价格区间: 5日:51.48 	10日:51.48 	20日:71.21 	30日:77.06 	60日:77.06 	120日:84.31 	250日:84.91 		,当前价：16.16	,当前：2022-04-19 11:05:28
        fangDiChan_reits.put("002183", "怡亚通  ");//227	物流行业     0.18	142.84	null	价格区间: 5日:64.71 	10日:71.76 	20日:75.26 	30日:79.66 	60日:62.25 	120日:40.17 	250日:30.41 		,当前价：5.5	,当前：2022-04-19 11:05:29
        fangDiChan_reits.put("600622", "光大嘉宝");//225	房地产开发   8.7 	82.48	null	价格区间: 5日:100.00	10日:73.08 	20日:83.50 	30日:85.55 	60日:85.55 	120日:86.27 	250日:86.27 		,当前价：5.5	,当前：2022-04-19 11:05:30
        fangDiChan_reits.put("000002", "万科Ａ  ");//224	房地产开发   -1.17	2358.79	null	价格区间: 5日:33.48 	10日:33.18 	20日:72.25 	30日:80.05 	60日:73.19 	120日:69.05 	250日:43.33 		,当前价：20.29	,当前：2022-04-19 11:05:31
    }

    /**
     * jianCai_diXiaGuanWang ["地下管网"]：9;
     */
    public static Map<String, String> fangDiChan_diXiaGuanWang = new HashMap<>();

    static {
        fangDiChan_diXiaGuanWang.put("003037", "三和管桩");//278	水泥建材     -2.09	63.63	107.15	价格区间: 5日:51.68 	10日:52.66 	20日:56.21 	30日:56.71 	60日:56.71 	120日:58.17 	250日:21.79 		,当前价：12.63	,当前：2022-04-11 14:51:13
        fangDiChan_diXiaGuanWang.put("002108", "沧州明珠");//266	塑料制品     -2.4	75.01	7.61	价格区间: 5日:6.00  	10日:4.35  	20日:3.41  	30日:1.55  	60日:1.09  	120日:0.53  	250日:18.99 		,当前价：5.29	,当前：2022-04-11 14:51:14
        fangDiChan_diXiaGuanWang.put("000778", "新兴铸管");//229	钢铁行业     -2.61	208.32	6.27	价格区间: 5日:52.63 	10日:72.45 	20日:77.31 	30日:77.31 	60日:67.15 	120日:78.16 	250日:78.16 		,当前价：5.22	,当前：2022-04-11 14:51:16
        fangDiChan_diXiaGuanWang.put("002372", "伟星新材");//223	装修建材     -2.73	334.18	2.33	价格区间: 5日:55.33 	10日:74.64 	20日:78.74 	30日:60.48 	60日:42.50 	120日:52.88 	250日:48.43 		,当前价：20.99	,当前：2022-04-11 14:51:17
        fangDiChan_diXiaGuanWang.put("000708", "中信特钢");//216	钢铁行业     -1.34	1038.70	2.25	价格区间: 5日:46.93 	10日:62.40 	20日:69.63 	30日:54.53 	60日:40.21 	120日:40.21 	250日:30.92 		,当前价：20.58	,当前：2022-04-11 14:51:18
        fangDiChan_diXiaGuanWang.put("002062", "宏润建设");//215	工程建设     -1.95	60.86	11.97	价格区间: 5日:62.50 	10日:69.62 	20日:75.00 	30日:75.00 	60日:50.96 	120日:57.33 	250日:57.67 		,当前价：5.52	,当前：2022-04-11 14:51:20
    }

    /**
     * fangDiChan_zhuangPeiJianZhu 装配建筑
     */
    public static Map<String, String> fangDiChan_zhuangPeiJianZhu = new HashMap<>();

    static {
        fangDiChan_zhuangPeiJianZhu.put("002761", "浙江建投");//419	工程建设     1.26	295.64	4.65	价格区间: 5日:30.89 	10日:18.30 	20日:31.58 	30日:41.73 	60日:59.47 	120日:59.87 	250日:60.00 		,当前价：27.34	,当前：2022-04-11 11:36:30
        fangDiChan_zhuangPeiJianZhu.put("600510", "黑牡丹  ");//344	房地产开发   -5.31	111.93	6.46	价格区间: 5日:15.32 	10日:8.06  	20日:2.58  	30日:2.58  	60日:38.45 	120日:38.45 	250日:42.93 		,当前价：10.69	,当前：2022-04-11 11:36:31
        fangDiChan_zhuangPeiJianZhu.put("000498", "山东路桥");//327	工程建设     6.36	153.82	20.85	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：9.86	,当前：2022-04-11 11:36:32
        fangDiChan_zhuangPeiJianZhu.put("601155", "新城控股");//314	房地产开发   -4.75	689.71	3.46	价格区间: 5日:14.97 	10日:48.72 	20日:69.99 	30日:69.99 	60日:63.15 	120日:53.04 	250日:37.86 		,当前价：30.47	,当前：2022-04-11 11:36:33
        fangDiChan_zhuangPeiJianZhu.put("002135", "东南网架");//298	工程建设     0.09	137.19	3.17	价格区间: 5日:34.52 	10日:25.20 	20日:58.15 	30日:58.70 	60日:65.30 	120日:73.17 	250日:73.14 		,当前价：11.77	,当前：2022-04-11 11:36:34
    }

    /**
     * fangDiChan_gongChengJiXie ["工程机械概念"]：20;
     */
    public static Map<String, String> fangDiChan_gongChengJiXie = new HashMap<>();

    static {
        fangDiChan_gongChengJiXie.put("605305", "中际联合");//313	工程机械     0.04	62.61	null	价格区间: 5日:13.96 	10日:8.94  	20日:5.25  	30日:2.84  	60日:1.82  	120日:1.07  	250日:20.19 		,当前价：56.92	,当前：2022-04-08 11:10:04
        fangDiChan_gongChengJiXie.put("600375", "汉马科技");//236	工程机械     -0.79	57.32	null	价格区间: 5日:8.55  	10日:5.95  	20日:18.18 	30日:18.18 	60日:14.87 	120日:15.58 	250日:30.41 		,当前价：8.76	,当前：2022-04-08 11:10:05
    }

    /**
     * fangDiChan_minBao 民爆概念
     */
    public static Map<String, String> fangDiChan_minBao = new HashMap<>();

    static {
        fangDiChan_minBao.put("002497", "雅化集团");//322	化学制品     -1.67	346.81	null	价格区间: 5日:56.58 	10日:63.47 	20日:63.31 	30日:50.66 	60日:48.23 	120日:48.23 	250日:48.86 		,当前价：30.09	,当前：2022-04-19 10:56:53
        fangDiChan_minBao.put("603977", "国泰集团");//243	化学制品     2.92	59.73	null	价格区间: 5日:61.99 	10日:74.00 	20日:76.28 	30日:77.19 	60日:68.54 	120日:48.25 	250日:53.70 		,当前价：10.21	,当前：2022-04-19 10:56:55
    }

    /**
     * fangDiChan 房地产:租售同权,建筑节能,海绵城市
     */
    public static Map<String, String> fangDiChan = new HashMap<>();

    static {
        fangDiChan.putAll(fangDiChan_zuShouTongQuan);//租售同权
        fangDiChan.putAll(fangDiChan_haiMianChengShi);//海绵城市
        fangDiChan.putAll(fangDiChan_reits);
        fangDiChan.putAll(fangDiChan_jianZhuJieNeng);//建筑节能
        fangDiChan.putAll(fangDiChan_diXiaGuanWang);//地下管网
        fangDiChan.putAll(fangDiChan_zhuangPeiJianZhu);//装配建筑
        fangDiChan.putAll(fangDiChan_gongChengJiXie);//工程机械概念
        fangDiChan.putAll(fangDiChan_minBao);//民爆概念
    }

    /**
     * guiJinShu 贵金属
     */
    public static Map<String, String> guiJinShu = new HashMap<>();

    static {
        guiJinShu.putAll(guiJinShu_peiYuZuanShi);
    }

    /**
     * yinHang ["银行 "]：42;
     */
    public static Map<String, String> yinHang = new HashMap<>();

    static {
        yinHang.put("001227", "兰州银行");//221	银行         1.97	353.70	0.8 	价格区间: 5日:57.35 	10日:72.12 	20日:76.98 	30日:79.29 	60日:59.57 	120日:59.57 	250日:59.57 		,当前价：6.21	,当前：2022-04-11 00:28:22
        yinHang.put("601838", "成都银行");//209	银行         -0.38	564.59	0.8 	价格区间: 5日:69.68 	10日:72.86 	20日:82.52 	30日:82.52 	60日:85.23 	120日:88.91 	250日:91.01 		,当前价：15.63	,当前：2022-04-11 00:28:23
        yinHang.put("601665", "齐鲁银行");//206	银行         9.95	308.75	2.2 	价格区间: 5日:89.50 	10日:90.59 	20日:91.00 	30日:91.00 	60日:91.00 	120日:91.00 	250日:25.84 		,当前价：6.74	,当前：2022-04-11 00:28:24
        yinHang.put("601528", "瑞丰银行");//200	银行         -0.1	155.46	0.86	价格区间: 5日:66.23 	10日:71.74 	20日:74.00 	30日:74.00 	60日:45.40 	120日:39.78 	250日:17.92 		,当前价：10.3	,当前：2022-04-11 00:28:26
        yinHang.put("600926", "杭州银行");//187	银行         1.21	890.13	0.64	价格区间: 5日:80.35 	10日:83.08 	20日:87.27 	30日:87.27 	60日:81.18 	120日:70.62 	250日:62.62 		,当前价：15.01	,当前：2022-04-11 00:28:27
        yinHang.put("601166", "兴业银行");//184	银行         1.85	4568.24	0.64	价格区间: 5日:89.37 	10日:92.28 	20日:93.55 	30日:80.15 	60日:72.17 	120日:76.97 	250日:75.08 		,当前价：21.99	,当前：2022-04-11 00:28:27
        yinHang.put("601128", "常熟银行");//183	银行         1.36	224.20	0.8 	价格区间: 5日:79.17 	10日:82.76 	20日:88.10 	30日:88.10 	60日:88.10 	120日:89.64 	250日:92.59 		,当前价：8.18	,当前：2022-04-11 00:28:28
        yinHang.put("600919", "江苏银行");//173	银行         0.82	1087.05	0.8 	价格区间: 5日:75.95 	10日:81.55 	20日:88.13 	30日:88.13 	60日:88.13 	120日:89.78 	250日:85.85 		,当前价：7.36	,当前：2022-04-11 00:28:29
        yinHang.put("002142", "宁波银行");//171	银行         2.37	2619.64	1.4 	价格区间: 5日:98.97 	10日:99.35 	20日:99.63 	30日:99.63 	60日:79.70 	120日:79.70 	250日:82.63 		,当前价：39.67	,当前：2022-04-11 00:28:30
        yinHang.put("000001", "平安银行");//170	银行         0.74	3182.57	0.66	价格区间: 5日:83.75 	10日:87.38 	20日:91.75 	30日:92.44 	60日:73.27 	120日:43.15 	250日:26.63 		,当前价：16.4	,当前：2022-04-11 00:28:30
        yinHang.put("600036", "招商银行");//153	银行         0.68	11898.720.74	价格区间: 5日:71.20 	10日:84.20 	20日:93.57 	30日:70.18 	60日:57.89 	120日:46.92 	250日:43.27 		,当前价：47.18	,当前：2022-04-11 00:28:33

    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(fangDiChan);//房地产
        all.putAll(quanShangGaiNian);//券商概念
        all.putAll(yinHang);//银行
        all.putAll(guiJinShu); //贵金属
    }

    public static void main(String[] args) {
        String spDate = null;
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
//        String date = "2022-04-08";
//        spDate = "2022-04-08";//特定日期：下一交易日
        KlineService.checkMaDemo(all, date, spDate);// all   huaGong   huaGong_linHuaGong    yinHang
    }
}
