package utils;

import ttjj.rank.stat.StockStat;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：消费
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStXiaoFei {






    /**
     * ["在线旅游"]：8;
     */
    public static Map<String, String> lvYou_zaiXianLvYou = new HashMap<>();

    static {
        lvYou_zaiXianLvYou.put("000524", "岭南控股");//287	旅游酒店     -1.9	58.98	1.43	价格区间: 5日:42.14 	10日:20.27 	20日:10.37 	30日:7.99  	60日:20.21 	净利环增:-160.13;净利同增:-35.74;营收环增:-43.96;营收同增:-35.01;
        lvYou_zaiXianLvYou.put("002244", "滨江集团");//253	房地产开发   -2.67	249.54	2.07	价格区间: 5日:79.75 	10日:83.74 	20日:83.74 	30日:84.36 	60日:88.30 	净利环增:-86.62;净利同增:-42.69;营收环增:-54.34;营收同增:-16.79;
        lvYou_zaiXianLvYou.put("000796", "凯撒旅业");//227	旅游酒店     null	66.33	null	价格区间: 5日:47.37 	10日:20.00 	20日:10.96 	30日:10.96 	60日:11.27 	净利环增:85.37;净利同增:32.99;营收环增:-24.00;营收同增:-49.40;
        lvYou_zaiXianLvYou.put("600258", "首旅酒店");//176	旅游酒店     -0.76	261.84	1.3 	价格区间: 5日:96.63 	10日:53.17 	20日:53.17 	30日:53.17 	60日:31.82 	净利环增:-234.80;净利同增:-27.73;营收环增:-15.06;营收同增:-4.64;
        lvYou_zaiXianLvYou.put("600138", "中青旅  ");//167	旅游酒店     -1.26	73.83	1.91	价格区间: 5日:86.75 	10日:27.91 	20日:20.22 	30日:20.22 	60日:18.37 	净利环增:-599.11;净利同增:-71.90;营收环增:-42.55;营收同增:-1.20;
        lvYou_zaiXianLvYou.put("000069", "华侨城Ａ");//166	房地产开发   -0.5	493.75	1.62	价格区间: 5日:34.69 	10日:20.24 	20日:13.71 	30日:13.71 	60日:13.71 	净利环增:-53.58;净利同增:-80.44;营收环增:-85.94;营收同增:-12.56;
    }

    /**
     * lvYou_mianShui ["免税概念"]：22;
     */
    public static Map<String, String> lvYou_mianShui = new HashMap<>();

    static {
        lvYou_mianShui.put("002251", "步步高  ");//306	商业百货     -9.98	79.48	0.24	价格区间: 5日:0.00  	10日:16.23 	20日:45.00 	30日:46.75 	60日:46.75 	120日:46.75 	250日:46.75 		,当前价：9.2	,当前：2022-04-26 10:28:59
        lvYou_mianShui.put("000524", "岭南控股");//305	旅游酒店     3.48	61.86	2.76	价格区间: 5日:28.80 	10日:13.83 	20日:13.83 	30日:10.47 	60日:26.67 	120日:33.12 	250日:33.90 		,当前价：9.23	,当前：2022-04-26 10:29:01
        lvYou_mianShui.put("000796", "凯撒旅业");//252	旅游酒店     1.09	66.81	2.04	价格区间: 5日:7.78  	10日:3.87  	20日:3.87  	30日:3.87  	60日:13.86 	120日:23.89 	250日:26.26 		,当前价：8.32	,当前：2022-04-26 10:29:02
        lvYou_mianShui.put("002163", "海南发展");//233	玻璃玻纤     3.93	97.71	3.68	价格区间: 5日:53.90 	10日:52.98 	20日:61.32 	30日:63.56 	60日:63.56 	120日:58.70 	250日:24.46 		,当前价：12.16	,当前：2022-04-26 10:29:04
        lvYou_mianShui.put("001979", "招商蛇口");//201	房地产开发   0.7 	1249.50	1.54	价格区间: 5日:67.74 	10日:38.18 	20日:51.43 	30日:70.23 	60日:70.23 	120日:79.64 	250日:80.41 		,当前价：15.77	,当前：2022-04-26 10:29:05
        lvYou_mianShui.put("601888", "中国中免");//191	旅游酒店     2.65	3477.16	2.66	价格区间: 5日:82.86 	10日:82.86 	20日:89.48 	30日:89.48 	60日:37.04 	120日:24.60 	250日:14.90 		,当前价：178.09	,当前：2022-04-26 10:29:05
        lvYou_mianShui.put("600694", "大商股份");//191	商业百货     2.47	59.62	2.84	价格区间: 5日:33.56 	10日:29.24 	20日:48.03 	30日:60.92 	60日:60.92 	120日:60.92 	250日:53.18 		,当前价：20.3	,当前：2022-04-26 10:29:06
        lvYou_mianShui.put("600009", "上海机场");//182	航空机场     -2.2	914.53	2.06	价格区间: 5日:17.02 	10日:13.69 	20日:13.69 	30日:30.80 	60日:18.20 	120日:30.63 	250日:48.88 		,当前价：47.46	,当前：2022-04-26 10:29:07
        lvYou_mianShui.put("000501", "武商集团");//179	商业百货     5.37	81.51	4.15	价格区间: 5日:53.60 	10日:53.60 	20日:59.15 	30日:67.23 	60日:59.50 	120日:59.50 	250日:34.90 		,当前价：10.6	,当前：2022-04-26 10:29:08
    }



    /**
     * lvYou_hangKongJiChang 航空机场
     */
    public static Map<String, String> lvYou_hangKongJiChang = new HashMap<>();

    static {
        lvYou_hangKongJiChang.put("600004", "白云机场");//230	航空机场	3.84	301.05	2.56	价格区间: 5日:90.43 	10日:65.82 	20日:71.43 	30日:51.24 	60日:42.75 	120日:50.89 	250日:67.11 		,当前价：12.72	,当前：2022-04-01 11:39:04
        lvYou_hangKongJiChang.put("601111", "中国国航");//224	航空机场	4.94	1388.57	2.28	价格区间: 5日:87.50 	10日:73.04 	20日:73.82 	30日:62.95 	60日:46.23 	120日:55.91 	250日:68.16 		,当前价：9.56	,当前：2022-04-01 11:39:05
        lvYou_hangKongJiChang.put("002928", "华夏航空");//223	航空机场	1.36	105.72	2.56	价格区间: 5日:43.75 	10日:37.23 	20日:32.84 	30日:18.23 	60日:14.93 	120日:14.93 	250日:17.28 		,当前价：10.43	,当前：2022-04-01 11:39:07
        lvYou_hangKongJiChang.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:91.75 	10日:66.73 	20日:56.71 	30日:47.23 	60日:39.57 	120日:48.75 	250日:54.94 		,当前价：50.49	,当前：2022-04-01 11:39:08
    }

    /**
     * lvYou 旅游
     */
    public static Map<String, String> lvYou = new HashMap<>();

    static {
        lvYou.putAll(lvYou_zaiXianLvYou);//在线旅游
        lvYou.putAll(lvYou_mianShui);//免税概念

        lvYou.putAll(lvYou_hangKongJiChang);//航空机场
    }

    /**
     * yuZhiCaiGaiNian ["预制菜概念"]：16;
     */
    public static Map<String, String> shiPin_yuZhiCai = new HashMap<>();

    static {
        shiPin_yuZhiCai.put("000524", "岭南控股");//287	旅游酒店     -1.9	58.98	1.43	价格区间: 5日:32.86 	10日:15.81 	20日:8.08  	30日:6.23  	60日:18.92 	净利环增:-160.13;净利同增:-35.74;营收环增:-43.96;营收同增:-35.01;
        shiPin_yuZhiCai.put("002251", "步步高  ");//277	商业百货     6.08	81.38	2.72	价格区间: 5日:30.65 	10日:16.03 	20日:43.68 	30日:44.94 	60日:46.62 	净利环增:107.87;净利同增:-72.93;营收环增:18.68;营收同增:-21.58;
        shiPin_yuZhiCai.put("601933", "永辉超市");//215	商业百货     7.45	431.97	3.31	价格区间: 5日:88.70 	10日:88.70 	20日:68.00 	30日:68.00 	60日:74.21 	净利环增:128.44;净利同增:2053.54;营收环增:28.34;营收同增:3.45;
        shiPin_yuZhiCai.put("000019", "深粮控股");//210	贸易行业     3.22	84.94	1.98	价格区间: 5日:88.31 	10日:29.96 	20日:23.69 	30日:21.66 	60日:24.07 	净利环增:4.30;净利同增:1.01;营收环增:-15.50;营收同增:-13.64;
        shiPin_yuZhiCai.put("600965", "福成股份");//208	农牧饲渔     1.96	51.09	1.06	价格区间: 5日:84.51 	10日:19.42 	20日:19.42 	30日:19.42 	60日:19.42 	净利环增:2003.41;净利同增:61.93;营收环增:12.53;营收同增:11.17;
        shiPin_yuZhiCai.put("605089", "味知香  ");//205	食品饮料     1.84	60.29	0.94	价格区间: 5日:88.82 	10日:46.90 	20日:42.90 	30日:42.90 	60日:42.90 	净利环增:18.73;净利同增:21.90;营收环增:-4.17;营收同增:14.17;
        shiPin_yuZhiCai.put("603345", "安井食品");//199	食品饮料     4.14	395.32	0.74	价格区间: 5日:92.02 	10日:93.14 	20日:95.19 	30日:95.19 	60日:80.44 	净利环增:8.42;净利同增:17.65;营收环增:-26.35;营收同增:24.16;
        shiPin_yuZhiCai.put("600073", "上海梅林");//190	食品饮料     5.53	69.77	3.01	价格区间: 5日:92.24 	10日:56.02 	20日:54.87 	30日:54.87 	60日:54.87 	净利环增:656.44;净利同增:16.62;营收环增:4.31;营收同增:-4.27;
    }

    /**
     * shiPin_sheQuTuanGou ["社区团购"]：18;
     */
    public static Map<String, String> shiPin_sheQuTuanGou = new HashMap<>();

    static {
        shiPin_sheQuTuanGou.put("002251", "步步高  ");//306	商业百货     -9.98	79.48	0.24	价格区间: 5日:29.43 	10日:40.88 	20日:61.18 	30日:62.42 	60日:62.42 	120日:62.29 	250日:62.29 		,当前价：9.2	,当前：2022-04-26 11:06:42
        shiPin_sheQuTuanGou.put("000501", "武商集团");//179	商业百货     5.37	81.51	4.15	价格区间: 5日:75.20 	10日:75.20 	20日:78.17 	30日:82.49 	60日:73.00 	120日:73.00 	250日:42.82 		,当前价：10.6	,当前：2022-04-26 11:06:43
        shiPin_sheQuTuanGou.put("601933", "永辉超市");//177	商业百货     0   	387.50	2.78	价格区间: 5日:45.45 	10日:18.18 	20日:23.73 	30日:35.71 	60日:52.63 	120日:52.63 	250日:31.06 		,当前价：4.27	,当前：2022-04-26 11:06:45
        shiPin_sheQuTuanGou.put("601116", "三江购物");//177	商业百货     -5.33	51.54	2.45	价格区间: 5日:29.59 	10日:19.51 	20日:37.74 	30日:42.61 	60日:42.61 	120日:43.59 	250日:44.89 		,当前价：9.41	,当前：2022-04-26 11:06:46
        shiPin_sheQuTuanGou.put("002697", "红旗连锁");//173	商业百货     3.38	66.64	2.68	价格区间: 5日:29.87 	10日:24.47 	20日:21.10 	30日:37.68 	60日:38.13 	120日:35.81 	250日:30.57 		,当前价：4.9	,当前：2022-04-26 11:06:47
        shiPin_sheQuTuanGou.put("002183", "怡亚通  ");//166	物流行业     0.78	133.75	1.3 	价格区间: 5日:33.73 	10日:33.73 	20日:47.62 	30日:56.35 	60日:57.14 	120日:30.77 	250日:22.47 		,当前价：5.15	,当前：2022-04-26 11:06:48
        shiPin_sheQuTuanGou.put("000895", "双汇发展");//161	食品饮料     -1.95	1065.38	1.54	价格区间: 5日:37.06 	10日:68.12 	20日:81.04 	30日:86.36 	60日:86.36 	120日:75.48 	250日:51.41 		,当前价：30.75	,当前：2022-04-26 11:06:49
    }

    /**
     * shiPin_ruYe ["乳业"]：14;
     */
    public static Map<String, String> shiPin_ruYe = new HashMap<>();

    static {
        shiPin_ruYe.put("605337", "李子园  ");//302	食品饮料     4.14	76.89	0.84	价格区间: 5日:91.83 	10日:95.95 	20日:95.95 	30日:95.95 	60日:47.19 	120日:31.86 	250日:19.78 		,当前价：35.48	,当前：2022-04-20 11:11:02
        shiPin_ruYe.put("605388", "均瑶健康");//295	食品饮料     -2.03	85.01	5.98	价格区间: 5日:67.31 	10日:84.13 	20日:52.17 	30日:59.16 	60日:60.16 	120日:45.31 	250日:25.73 		,当前价：19.77	,当前：2022-04-20 11:11:04
        shiPin_ruYe.put("002557", "洽洽食品");//272	食品饮料     2.28	293.55	0.96	价格区间: 5日:98.79 	10日:99.16 	20日:99.41 	30日:99.57 	60日:97.73 	120日:72.18 	250日:79.47 		,当前价：57.9	,当前：2022-04-20 11:11:05
        shiPin_ruYe.put("002385", "大北农  ");//268	农牧饲渔     0.11	379.34	2.45	价格区间: 5日:76.30 	10日:78.52 	20日:80.25 	30日:85.52 	60日:67.74 	120日:45.65 	250日:53.70 		,当前价：9.16	,当前：2022-04-20 11:11:07
        shiPin_ruYe.put("600882", "妙可蓝多");//253	食品饮料     -0.37	178.45	1.41	价格区间: 5日:93.07 	10日:93.82 	20日:83.89 	30日:85.28 	60日:25.54 	120日:17.57 	250日:10.95 		,当前价：34.57	,当前：2022-04-20 11:11:08
        shiPin_ruYe.put("002505", "鹏都农牧");//241	贸易行业     1.22	210.99	0.76	价格区间: 5日:92.50 	10日:84.09 	20日:51.39 	30日:42.53 	60日:42.53 	120日:24.50 	250日:52.50 		,当前价：3.31	,当前：2022-04-20 11:11:09
        shiPin_ruYe.put("601515", "东风股份");//232	包装材料     -0.14	107.66	0.67	价格区间: 5日:38.46 	10日:51.58 	20日:64.89 	30日:73.26 	60日:46.84 	120日:32.06 	250日:37.18 		,当前价：7.01	,当前：2022-04-20 11:11:10
    }

    /**
     * shiPin_renZaoRou ["人造肉"]：6;
     */
    public static Map<String, String> shiPin_renZaoRou = new HashMap<>();

    static {
        shiPin_renZaoRou.put("002810", "山东赫达");//274	化学制品     -4.64	127.51	3.37	价格区间: 5日:35.53 	10日:17.45 	20日:17.41 	30日:9.13  	60日:8.57  	120日:6.61  	250日:10.85 		,当前价：37.22	,当前：2022-04-15 10:55:19
        shiPin_renZaoRou.put("002481", "双塔食品");//234	食品饮料     2.31	110.16	11.51	价格区间: 5日:86.89 	10日:86.89 	20日:73.27 	30日:75.73 	60日:49.32 	120日:49.32 	250日:26.58 		,当前价：8.86	,当前：2022-04-15 10:55:21
    }
    /**
     * shiPin_tiaoWeiPin ["调味品概念"]：19;
     */
    public static Map<String, String> shiPin_tiaoWeiPin = new HashMap<>();

    static {
        shiPin_tiaoWeiPin.put("600328", "中盐化工");//339	化学原料     0.05	187.99	0.29	价格区间: 5日:37.77 	10日:65.10 	20日:68.35 	30日:75.15 	60日:75.15 	120日:64.54 	250日:49.89 		,当前价：19.63	,当前：2022-04-20 10:38:57
        shiPin_tiaoWeiPin.put("000505", "京粮控股");//337	农牧饲渔     5.26	91.60	2.03	价格区间: 5日:75.21 	10日:80.86 	20日:73.08 	30日:79.03 	60日:80.19 	120日:80.27 	250日:80.27 		,当前价：12.6	,当前：2022-04-20 10:38:58
        shiPin_tiaoWeiPin.put("002053", "云南能投");//327	化学原料     -0.5	91.47	0.73	价格区间: 5日:55.84 	10日:24.02 	20日:4.59  	30日:16.15 	60日:26.80 	120日:30.88 	250日:35.99 		,当前价：12.02	,当前：2022-04-20 10:39:00
        shiPin_tiaoWeiPin.put("002539", "云图控股");//324	化肥行业     -2.15	155.96	1.71	价格区间: 5日:79.51 	10日:80.39 	20日:85.88 	30日:88.24 	60日:88.24 	120日:61.23 	250日:47.98 		,当前价：15.44	,当前：2022-04-20 10:39:01
    }

    /**
     * shiPin_daiTang ["代糖概念"]：7;
     */
    public static Map<String, String> shiPin_daiTang = new HashMap<>();

    static {
        shiPin_daiTang.put("002597", "金禾实业");//197	食品饮料     4.49	223.02	1.67	价格区间: 5日:99.57 	10日:88.56 	20日:88.69 	30日:88.69 	60日:78.45 	净利环增:-4.71;净利同增:110.21;营收环增:3.95;营收同增:66.91;
    }

    /**
     * shiPin_chaoJiPinPai
     */
    public static Map<String, String> shiPin_chaoJiPinPai = new HashMap<>();

    static {
        shiPin_chaoJiPinPai.put("002216", "三全食品");//207	食品饮料     -0.71	172.50	0.79	价格区间: 5日:53.69 	10日:75.62 	20日:78.60 	30日:81.04 	60日:81.28 	120日:67.53 	250日:68.56 		,当前价：19.62	,当前：2022-04-25 23:50:59
        shiPin_chaoJiPinPai.put("002507", "涪陵榨菜");//189	食品饮料     2.66	325.76	1.94	价格区间: 5日:54.94 	10日:70.48 	20日:79.44 	30日:83.85 	60日:83.85 	120日:73.12 	250日:64.04 		,当前价：36.7	,当前：2022-04-25 23:51:00
        shiPin_chaoJiPinPai.put("000002", "万科Ａ  ");//174	房地产开发   -4.95	2189.06	0.94	价格区间: 5日:1.58  	10日:0.97  	20日:37.22 	30日:58.90 	60日:57.59 	120日:50.81 	250日:32.84 		,当前价：18.83	,当前：2022-04-25 23:51:01
        shiPin_chaoJiPinPai.put("002594", "比亚迪  ");//167	汽车整车     -3.36	6622.85	1.14	价格区间: 5日:3.62  	10日:3.62  	20日:18.41 	30日:43.47 	60日:38.30 	120日:14.99 	250日:45.03 		,当前价：227.5	,当前：2022-04-25 23:51:02
        shiPin_chaoJiPinPai.put("000895", "双汇发展");//165	食品饮料     -0.41	1086.52	1.37	价格区间: 5日:27.65 	10日:70.71 	20日:81.19 	30日:86.47 	60日:86.47 	120日:75.58 	250日:51.47 		,当前价：31.36	,当前：2022-04-25 23:51:03
        shiPin_chaoJiPinPai.put("000568", "泸州老窖");//159	酿酒行业     -4.32	2835.80	1.24	价格区间: 5日:1.11  	10日:41.34 	20日:46.43 	30日:46.43 	60日:25.54 	120日:17.34 	250日:26.11 		,当前价：192.7	,当前：2022-04-25 23:51:04
        shiPin_chaoJiPinPai.put("600085", "同仁堂  ");//158	中药         -7.03	484.13	1.46	价格区间: 5日:0.14  	10日:0.12  	20日:0.08  	30日:0.08  	60日:0.07  	120日:16.67 	250日:27.67 		,当前价：35.3	,当前：2022-04-25 23:51:05
        shiPin_chaoJiPinPai.put("600600", "青岛啤酒");//157	酿酒行业     -3.87	1110.58	1.42	价格区间: 5日:17.60 	10日:55.38 	20日:56.00 	30日:39.53 	60日:27.84 	120日:23.66 	250日:18.94 		,当前价：81.4	,当前：2022-04-25 23:51:06
    }
    /**
     * shiPin_jiRou ["鸡肉概念"]：13;
     */
    public static Map<String, String> shiPin_jiRou = new HashMap<>();

    static {
        shiPin_jiRou.put("603477", "巨星农牧");//366	农牧饲渔     -4.72	103.19	3.75	价格区间: 5日:2.38  	10日:2.38  	20日:1.96  	30日:12.93 	60日:30.04 	120日:51.75 	250日:57.64 		,当前价：20.39	,当前：2022-04-21 11:37:26
        shiPin_jiRou.put("002746", "仙坛股份");//272	农牧饲渔     -3.34	84.59	5.45	价格区间: 5日:70.09 	10日:70.09 	20日:70.09 	30日:72.08 	60日:47.01 	120日:62.57 	250日:63.35 		,当前价：9.83	,当前：2022-04-21 11:37:27
        shiPin_jiRou.put("002100", "天康生物");//264	农牧饲渔     -5.18	146.24	2.39	价格区间: 5日:4.28  	10日:4.28  	20日:3.23  	30日:20.00 	60日:23.81 	120日:49.90 	250日:61.60 		,当前价：10.8	,当前：2022-04-21 11:37:29
        shiPin_jiRou.put("002567", "唐人神  ");//241	农牧饲渔     -5.56	106.49	3.88	价格区间: 5日:8.37  	10日:8.37  	20日:6.88  	30日:17.63 	60日:32.55 	120日:51.69 	250日:55.38 		,当前价：8.83	,当前：2022-04-21 11:37:30
        shiPin_jiRou.put("002234", "民和股份");//229	农牧饲渔     -6.9	62.64	2.96	价格区间: 5日:13.20 	10日:22.97 	20日:43.56 	30日:54.88 	60日:54.88 	120日:54.88 	250日:58.65 		,当前价：17.95	,当前：2022-04-21 11:37:31
        shiPin_jiRou.put("000876", "新希望  ");//227	农牧饲渔     -3.78	710.90	3.2 	价格区间: 5日:33.33 	10日:33.33 	20日:27.27 	30日:56.97 	60日:48.24 	120日:45.78 	250日:60.66 		,当前价：15.78	,当前：2022-04-21 11:37:32
    }
    /**
     * shiPin 食品: 预制菜概念,社区团购,调味品概念
     */
    public static Map<String, String> shiPin = new HashMap<>();

    static {
        shiPin.putAll(shiPin_yuZhiCai);
        shiPin.putAll(shiPin_tiaoWeiPin);
        shiPin.putAll(shiPin_sheQuTuanGou);
        shiPin.putAll(shiPin_ruYe);//乳业
        shiPin.putAll(shiPin_renZaoRou);//人造肉
        shiPin.putAll(shiPin_daiTang);
        shiPin.putAll(shiPin_chaoJiPinPai);
        shiPin.putAll(shiPin_jiRou);//鸡肉概念
    }

    /**
     * jiuShui_baiJiu ["白酒"]：37;
     */
    public static Map<String, String> jiuShui_baiJiu = new HashMap<>();

    static {
        jiuShui_baiJiu.put("600199", "金种子酒");//321	酿酒行业     7.05	169.71	2.57	价格区间: 5日:47.98 	10日:42.25 	20日:54.56 	30日:37.01 	60日:66.97 	120日:66.97 	250日:67.96 		,当前价：25.8	,当前：2022-04-26 11:26:21
        jiuShui_baiJiu.put("600381", "青海春天");//277	食品饮料     -5.22	76.79	2.01	价格区间: 5日:38.00 	10日:24.39 	20日:27.01 	30日:38.32 	60日:57.72 	120日:59.41 	250日:60.79 		,当前价：13.08	,当前：2022-04-26 11:26:22
        jiuShui_baiJiu.put("600153", "建发股份");//251	贸易行业     1.77	379.40	2.19	价格区间: 5日:53.52 	10日:42.24 	20日:61.56 	30日:76.99 	60日:77.15 	120日:82.17 	250日:83.19 		,当前价：13.25	,当前：2022-04-26 11:26:24
        jiuShui_baiJiu.put("603299", "苏盐井神");//243	化学原料     1.05	82.01	1.48	价格区间: 5日:81.76 	10日:89.80 	20日:90.34 	30日:91.53 	60日:91.53 	120日:91.53 	250日:74.57 		,当前价：10.61	,当前：2022-04-26 11:26:25
        jiuShui_baiJiu.put("600395", "盘江股份");//216	煤炭行业     -3.57	150.91	1.36	价格区间: 5日:9.90  	10日:5.19  	20日:5.19  	30日:6.47  	60日:16.79 	120日:16.79 	250日:16.77 		,当前价：7.03	,当前：2022-04-26 11:26:26
        jiuShui_baiJiu.put("600238", "海南椰岛");//210	酿酒行业     3.56	54.73	2.44	价格区间: 5日:24.04 	10日:18.89 	20日:18.89 	30日:18.89 	60日:12.44 	120日:7.27  	250日:12.60 		,当前价：12.21	,当前：2022-04-26 11:26:27
        jiuShui_baiJiu.put("600197", "伊力特  ");//201	酿酒行业     0.12	118.08	2.09	价格区间: 5日:26.32 	10日:22.49 	20日:22.49 	30日:29.08 	60日:38.09 	120日:38.09 	250日:28.21 		,当前价：25.02	,当前：2022-04-26 11:26:28
    }

    /**
     * jiuShui_piJiu ["啤酒概念"]：6;
     */
    public static Map<String, String> jiuShui_piJiu = new HashMap<>();

    static {
        jiuShui_piJiu.put("600132", "重庆啤酒");//278	酿酒行业     -0.67	588.94	0.37	价格区间: 5日:63.38 	10日:82.16 	20日:84.80 	30日:84.80 	60日:53.82 	120日:34.57 	250日:22.41 		,当前价：121.69	,当前：2022-04-20 10:20:10
        jiuShui_piJiu.put("000993", "闽东电力");//273	电力行业     -0.57	56.28	13.75	价格区间: 5日:70.95 	10日:71.98 	20日:71.98 	30日:74.46 	60日:74.46 	120日:27.73 	250日:45.18 		,当前价：12.29	,当前：2022-04-20 10:20:12
        jiuShui_piJiu.put("600108", "亚盛集团");//252	农牧饲渔     -0.75	77.29	2.53	价格区间: 5日:86.05 	10日:69.64 	20日:72.13 	30日:85.05 	60日:86.44 	120日:87.30 	250日:90.18 		,当前价：3.97	,当前：2022-04-20 10:20:13
        jiuShui_piJiu.put("600600", "青岛啤酒");//237	酿酒行业     -1.57	1135.42	0.37	价格区间: 5日:58.72 	10日:86.53 	20日:86.53 	30日:52.83 	60日:38.32 	120日:32.56 	250日:26.06 		,当前价：83.22	,当前：2022-04-20 10:20:14
    }

    /**
     * jiuShui 酒水
     */
    public static Map<String, String> jiuShui = new HashMap<>();

    static {
        jiuShui.putAll(jiuShui_baiJiu);
        jiuShui.putAll(jiuShui_piJiu);//啤酒概念
    }




    /**
     * wuLiu_kuaiDi ["快递概念"]：23;
     */
    public static Map<String, String> wuLiu_kuaiDi = new HashMap<>();

    static {
        wuLiu_kuaiDi.put("600153", "建发股份");//249	贸易行业     2.91	384.84	0.69	价格区间: 5日:81.67 	10日:44.14 	20日:59.08 	30日:78.55 	60日:78.69 	120日:83.38 	250日:84.32 		,当前价：13.44	,当前：2022-04-28 10:30:33
        wuLiu_kuaiDi.put("600233", "圆通速递");//218	物流行业     1.01	585.09	null	价格区间: 5日:82.69 	10日:82.69 	20日:70.88 	30日:68.25 	60日:60.71 	120日:62.33 	250日:77.29 		,当前价：17.03	,当前：2022-04-28 10:30:34
        wuLiu_kuaiDi.put("600787", "中储股份");//205	物流行业     4.21	119.37	null	价格区间: 5日:62.35 	10日:39.55 	20日:23.14 	30日:23.14 	60日:23.14 	120日:22.36 	250日:22.15 		,当前价：5.45	,当前：2022-04-28 10:30:35
        wuLiu_kuaiDi.put("603056", "德邦股份");//200	物流行业     0.15	136.69	null	价格区间: 5日:32.03 	10日:19.71 	20日:9.69  	30日:4.28  	60日:23.31 	120日:27.37 	250日:28.00 		,当前价：13.31	,当前：2022-04-28 10:30:37
    }

    /**
     * wuLiu_tongYiDaShiChang ["统一大市场"]：11;
     */
    public static Map<String, String> wuLiu_tongYiDaShiChang = new HashMap<>();

    static {
        wuLiu_tongYiDaShiChang.put("002314", "南山控股");//292	房地产开发   -1.28	125.10	2.03	价格区间: 5日:68.04 	10日:69.81 	20日:22.91 	30日:29.46 	60日:33.60 	净利环增:-120.98;净利同增:-51.76;营收环增:-82.57;营收同增:22.93;
        wuLiu_tongYiDaShiChang.put("000582", "北部湾港");//226	航运港口     1.74	128.69	1.43	价格区间: 5日:91.67 	10日:34.81 	20日:9.95  	30日:9.95  	60日:12.78 	净利环增:-16.37;净利同增:0.87;营收环增:-21.69;营收同增:11.42;
        wuLiu_tongYiDaShiChang.put("600787", "中储股份");//203	物流行业     1.08	122.66	1.89	价格区间: 5日:89.16 	10日:56.92 	20日:32.31 	30日:32.31 	60日:32.31 	净利环增:39.58;净利同增:479.21;营收环增:-27.48;营收同增:20.03;
    }

    /**
     * wuLiu_haiYangJingJi ["海洋经济"]：17;
     */
    public static Map<String, String> wuLiu_haiYangJingJi = new HashMap<>();

    static {
        wuLiu_haiYangJingJi.put("002639", "雪人股份");//375	通用设备     -0.65	94.72	2.02	价格区间: 5日:65.00 	10日:37.14 	20日:32.21 	30日:53.81 	60日:53.81 	120日:45.24 	250日:47.90 		,当前价：12.26	,当前：2022-04-20 11:16:36
        wuLiu_haiYangJingJi.put("600522", "中天科技");//344	通信设备     -2.09	511.26	0.86	价格区间: 5日:39.79 	10日:38.00 	20日:16.63 	30日:14.08 	60日:14.89 	120日:52.30 	250日:58.73 		,当前价：14.98	,当前：2022-04-20 11:16:37
        wuLiu_haiYangJingJi.put("600026", "中远海能");//319	航运港口     2.23	370.54	1.2 	价格区间: 5日:91.67 	10日:94.96 	20日:97.11 	30日:97.13 	60日:97.67 	120日:97.67 	250日:97.67 		,当前价：7.78	,当前：2022-04-20 11:16:39
        wuLiu_haiYangJingJi.put("601919", "中远海控");//274	航运港口     1.13	2432.55	2.87	价格区间: 5日:63.44 	10日:41.84 	20日:23.98 	30日:17.88 	60日:14.50 	120日:13.36 	250日:28.89 		,当前价：15.19	,当前：2022-04-20 11:16:40
        wuLiu_haiYangJingJi.put("601890", "亚星锚链");//270	船舶制造     -1.01	75.12	0.59	价格区间: 5日:21.21 	10日:59.38 	20日:59.38 	30日:58.02 	60日:22.22 	120日:36.06 	250日:50.19 		,当前价：7.83	,当前：2022-04-20 11:16:40
    }

    /**
     * wuLiu_rcep ["RCEP概念"]：13;
     */
    public static Map<String, String> wuLiu_rcep = new HashMap<>();

    static {
        wuLiu_rcep.put("000811", "冰轮环境");//287	通用设备     0.84	80.92	1.92	价格区间: 5日:41.86 	10日:36.73 	20日:23.15 	30日:22.86 	60日:12.24 	120日:11.52 	250日:37.50 		,当前价：10.85	,当前：2022-04-12 13:51:45
        wuLiu_rcep.put("002803", "吉宏股份");//277	文化传媒     -0.61	50.41	1.17	价格区间: 5日:14.00 	10日:12.21 	20日:19.25 	30日:19.25 	60日:5.38  	120日:5.38  	250日:3.30  		,当前价：13.01	,当前：2022-04-12 13:51:47
        wuLiu_rcep.put("002612", "朗姿股份");//244	纺织服装     -0.57	91.98	1.73	价格区间: 5日:16.50 	10日:13.51 	20日:11.65 	30日:7.29  	60日:5.82  	120日:3.11  	250日:1.31  		,当前价：20.79	,当前：2022-04-12 13:51:48
        wuLiu_rcep.put("000582", "北部湾港");//239	航运港口     10   	186.86	8.54	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：11.44	,当前：2022-04-12 13:51:49
        wuLiu_rcep.put("603565", "中谷物流");//236	航运港口     -1.6	253.21	2.92	价格区间: 5日:45.39 	10日:38.78 	20日:64.35 	30日:38.87 	60日:28.60 	120日:28.60 	250日:22.37 		,当前价：26.41	,当前：2022-04-12 13:51:50
        wuLiu_rcep.put("600190", "锦州港  ");//231	航运港口     6.68	83.10	2.66	价格区间: 5日:85.71 	10日:86.67 	20日:32.91 	30日:32.55 	60日:50.69 	120日:51.85 	250日:51.85 		,当前价：4.15	,当前：2022-04-12 13:51:51
    }

    /**
     * wuLiu_zhongEMaoYi ["中俄贸易概念"]：11;
     */
    public static Map<String, String> wuLiu_zhongEMaoYi = new HashMap<>();

    static {
        wuLiu_zhongEMaoYi.put("002758", "浙农股份");//265	综合行业     3.94	76.91	2.11	价格区间: 5日:66.50 	10日:39.71 	20日:51.96 	30日:35.16 	60日:48.24 	120日:51.91 	250日:55.95 		,当前价：15.3	,当前：2022-04-13 11:39:49
        wuLiu_zhongEMaoYi.put("600251", "冠农股份");//263	农牧饲渔     1.59	84.79	5.21	价格区间: 5日:82.86 	10日:83.33 	20日:86.67 	30日:77.53 	60日:85.71 	120日:85.71 	250日:71.61 		,当前价：10.85	,当前：2022-04-13 11:39:50
        wuLiu_zhongEMaoYi.put("600798", "宁波海运");//260	航运港口     -1.47	64.55	7   	价格区间: 5日:63.92 	10日:70.83 	20日:76.03 	30日:57.81 	60日:66.25 	120日:66.25 	250日:66.25 		,当前价：5.35	,当前：2022-04-13 11:39:52
        wuLiu_zhongEMaoYi.put("002353", "杰瑞股份");//259	专用设备     -0.15	382.57	2.26	价格区间: 5日:42.25 	10日:23.81 	20日:20.34 	30日:17.61 	60日:17.61 	120日:16.89 	250日:40.98 		,当前价：39.94	,当前：2022-04-13 11:39:53
        wuLiu_zhongEMaoYi.put("600190", "锦州港  ");//230	航运港口     -1.94	80.89	5.33	价格区间: 5日:62.50 	10日:63.79 	20日:36.45 	30日:20.00 	60日:46.21 	120日:47.47 	250日:47.47 		,当前价：4.04	,当前：2022-04-13 11:39:54
    }

    /**
     * wuLiu_jinKouBoLan ["进口博览"]：11;
     */
    public static Map<String, String> wuLiu_jinKouBoLan = new HashMap<>();

    static {
        wuLiu_jinKouBoLan.put("002183", "怡亚通  ");//233	物流行业     -1.24	144.65	0.75	价格区间: 5日:86.57 	10日:88.24 	20日:89.69 	30日:91.53 	60日:76.06 	120日:46.15 	250日:34.25 		,当前价：5.57	,当前：2022-04-20 13:23:53
        wuLiu_jinKouBoLan.put("600115", "中国东航");//185	航空机场     1.43	939.95	1   	价格区间: 5日:84.00 	10日:92.00 	20日:46.94 	30日:35.38 	60日:27.06 	120日:27.06 	250日:37.06 		,当前价：4.98	,当前：2022-04-20 13:23:54
        wuLiu_jinKouBoLan.put("600655", "豫园股份");//166	珠宝首饰     -0.3	389.82	0.81	价格区间: 5日:37.78 	10日:28.33 	20日:44.38 	30日:61.94 	60日:61.94 	120日:61.94 	250日:25.89 		,当前价：10.02	,当前：2022-04-20 13:23:56
        wuLiu_jinKouBoLan.put("600597", "光明乳业");//150	食品饮料     1.94	166.54	1.34	价格区间: 5日:79.17 	10日:88.46 	20日:88.46 	30日:62.05 	60日:36.34 	120日:26.02 	250日:14.37 		,当前价：12.08	,当前：2022-04-20 13:23:57
    }

    /**
     * wuLiu 物流
     */
    public static Map<String, String> wuLiu = new HashMap<>();

    static {
        wuLiu.putAll(wuLiu_kuaiDi);//快递概念
        wuLiu.putAll(wuLiu_tongYiDaShiChang);//统一大市场
        wuLiu.putAll(wuLiu_haiYangJingJi);//海洋经济
        wuLiu.putAll(wuLiu_rcep);//RCEP概念
        wuLiu.putAll(wuLiu_jinKouBoLan);//RCEP概念
    }

    /**
     * lingShou_tuiShuiShangDian 退税商店
     */
    public static Map<String, String> lingShou_tuiShuiShangDian = new HashMap<>();

    static {
        lingShou_tuiShuiShangDian.put("002187", "广百股份");//233	商业百货     10.05	78.64	10.53	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：11.17	,当前：2022-04-26 10:33:22
        lingShou_tuiShuiShangDian.put("600828", "茂业商业");//199	商业百货     0.81	64.95	1.57	价格区间: 5日:14.48 	10日:14.48 	20日:14.48 	30日:22.50 	60日:24.39 	120日:26.63 	250日:26.63 		,当前价：3.75	,当前：2022-04-26 10:33:24
        lingShou_tuiShuiShangDian.put("600415", "小商品城");//171	商业百货     -0.84	259.74	1.79	价格区间: 5日:16.47 	10日:13.33 	20日:13.21 	30日:17.12 	60日:34.29 	120日:34.29 	250日:29.81 		,当前价：4.73	,当前：2022-04-26 10:33:25
        lingShou_tuiShuiShangDian.put("600814", "杭州解百");//171	商业百货     1.28	52.58	1.97	价格区间: 5日:17.50 	10日:14.00 	20日:14.00 	30日:28.93 	60日:37.00 	120日:47.72 	250日:47.72 		,当前价：7.14	,当前：2022-04-26 10:33:26
        lingShou_tuiShuiShangDian.put("600827", "百联股份");//153	商业百货     1.85	186.45	2.49	价格区间: 5日:23.12 	10日:16.37 	20日:16.37 	30日:27.02 	60日:25.97 	120日:17.19 	250日:5.85  		,当前价：10.45	,当前：2022-04-26 10:33:28
    }

    /**
     * lingShou_xinLingShou
     */
    public static Map<String, String> lingShou_xinLingShou = new HashMap<>();

    static {
        lingShou_xinLingShou.put("600335", "国机汽车");//376	汽车服务     -6.18	104.02	1.61	价格区间: 5日:9.09  	10日:9.09  	20日:4.22  	30日:17.52 	60日:18.74 	120日:28.07 	250日:36.78 		,当前价：7.14	,当前：2022-04-22 13:59:50
        lingShou_xinLingShou.put("000681", "视觉中国");//341	文化传媒     -2.98	88.90	1.48	价格区间: 5日:16.67 	10日:6.09  	20日:4.45  	30日:4.45  	60日:2.72  	120日:5.73  	250日:12.79 		,当前价：12.69	,当前：2022-04-22 13:59:51
        lingShou_xinLingShou.put("000756", "新华制药");//306	化学制药     -8.61	66.09	5.21	价格区间: 5日:50.97 	10日:59.42 	20日:58.79 	30日:58.79 	60日:58.79 	120日:48.87 	250日:48.87 		,当前价：9.87	,当前：2022-04-22 13:59:52
        lingShou_xinLingShou.put("002251", "步步高  ");//306	商业百货     -6.66	101.77	2.26	价格区间: 5日:68.25 	10日:78.25 	20日:79.74 	30日:80.38 	60日:80.38 	120日:80.38 	250日:80.38 		,当前价：11.78	,当前：2022-04-22 13:59:54
        lingShou_xinLingShou.put("002612", "朗姿股份");//296	纺织服装     0.76	111.10	3.4 	价格区间: 5日:86.61 	10日:88.10 	20日:88.10 	30日:55.96 	60日:51.80 	120日:22.08 	250日:9.33  		,当前价：25.11	,当前：2022-04-22 13:59:55
        lingShou_xinLingShou.put("605499", "东鹏饮料");//296	食品饮料     -0.15	519.21	0.96	价格区间: 5日:40.49 	10日:43.89 	20日:43.89 	30日:21.70 	60日:13.74 	120日:9.74  	250日:34.05 		,当前价：129.8	,当前：2022-04-22 13:59:56
    }
    /**
     * lingShou 零售
     */
    public static Map<String, String> lingShou = new HashMap<>();

    static {
        lingShou.putAll(lingShou_tuiShuiShangDian);//退税商店
        lingShou.putAll(lingShou_xinLingShou);
    }

    /**
     * lingShou_c2m ["C2M概念"]：13;
     */
    public static Map<String, String> lingShou_c2m = new HashMap<>();
    static {
        lingShou_c2m.put("600702", "舍得酒业");//315	酿酒行业     1.8 	502.02	2.73	价格区间: 5日:45.73 	10日:53.22 	20日:27.56 	30日:19.23 	60日:15.47 	120日:8.57  	250日:33.79 		,当前价：151.18	,当前：2022-04-22 14:04:37
        lingShou_c2m.put("002612", "朗姿股份");//296	纺织服装     0.76	111.10	3.4 	价格区间: 5日:86.82 	10日:88.29 	20日:88.29 	30日:56.08 	60日:51.69 	120日:22.03 	250日:9.31  		,当前价：25.11	,当前：2022-04-22 14:04:38
        lingShou_c2m.put("002154", "报喜鸟  ");//253	纺织服装     2.93	61.44	2.67	价格区间: 5日:86.15 	10日:86.76 	20日:86.76 	30日:87.67 	60日:39.02 	120日:28.19 	250日:25.72 		,当前价：4.21	,当前：2022-04-22 14:04:40
        lingShou_c2m.put("002269", "美邦服饰");//242	纺织服装     6.34	54.77	3.67	价格区间: 5日:77.42 	10日:77.42 	20日:64.86 	30日:52.17 	60日:38.10 	120日:23.08 	250日:7.67  		,当前价：2.18	,当前：2022-04-22 14:04:41
    }
    /**
     * fuZhuang 服装
     */
    public static Map<String, String> fuZhuang = new HashMap<>();

    static {
        fuZhuang.putAll(lingShou_c2m);//
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {

        all.putAll(shiPin); //食品
        all.putAll(jiuShui); //酒水
        all.putAll(wuLiu); //物流
        all.putAll(lvYou); //旅游
        all.putAll(lingShou); //零售
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStat.checkMaDemo(ContMapStXiaoFei.all, date);//all nongYe
//        StockStat.checkMaDemo(ContMapStXiaoFei.lvYou, date);//all nongYe lvYou
//        StockStat.checkMaDemo(ContMapStXiaoFei.shiPin, date);//
    }
}
