package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：消费
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStXiaoFei {



    /**
     * jiuShui_baiJiu ["白酒"]：37;
     */
    public static Map<String, String> jiuShui_baiJiu = new HashMap<>();

    static {
        jiuShui_baiJiu.put("600199", "金种子酒");//404	酿酒行业     3.92	162.21	2.6 	价格区间: 5日:31.28 	10日:43.21 	20日:21.79 	30日:29.02 	60日:58.98 	120日:58.98 	250日:60.21 		,当前价：24.66	,当前：2022-04-12 11:40:42
        jiuShui_baiJiu.put("600381", "青海春天");//374	食品饮料     10   	109.13	2.99	价格区间: 5日:75.93 	10日:86.81 	20日:89.14 	30日:91.90 	60日:92.87 	120日:93.18 	250日:93.51 		,当前价：18.59	,当前：2022-04-12 11:40:44
        jiuShui_baiJiu.put("600771", "广誉远  ");//333	中药         0.89	156.75	1.96	价格区间: 5日:10.07 	10日:6.16  	20日:29.05 	30日:29.05 	60日:20.46 	120日:23.21 	250日:41.20 		,当前价：31.86	,当前：2022-04-12 11:40:45
        jiuShui_baiJiu.put("600238", "海南椰岛");//328	酿酒行业     1.52	57.01	1.48	价格区间: 5日:36.55 	10日:43.56 	20日:50.00 	30日:30.90 	60日:16.39 	120日:9.79  	250日:17.29 		,当前价：12.72	,当前：2022-04-12 11:40:46
        jiuShui_baiJiu.put("600702", "舍得酒业");//311	酿酒行业     1.59	480.27	2.7 	价格区间: 5日:14.93 	10日:12.93 	20日:7.54  	30日:5.79  	60日:4.74  	120日:2.88  	250日:34.83 		,当前价：144.63	,当前：2022-04-12 11:40:47
    }
    /**
     * shiPin_tiaoWeiPin ["调味品概念"]：19;
     */
    public static Map<String, String> shiPin_tiaoWeiPin = new HashMap<>();

    static {
        shiPin_tiaoWeiPin.put("002053", "云南能投");//374	化学原料	2.03	103.04	1.23	价格区间: 5日:18.60 	10日:5.13  	20日:35.20 	30日:35.37 	60日:39.54 	120日:42.72 	250日:47.63 		,当前价：13.54	,当前：2022-03-30 14:19:50
        shiPin_tiaoWeiPin.put("000505", "京粮控股");//332	农牧饲渔	4   	96.39	6.56	价格区间: 5日:86.45 	10日:88.53 	20日:89.44 	30日:89.44 	60日:90.03 	120日:90.07 	250日:90.07 		,当前价：13.26	,当前：2022-03-30 14:19:52
        shiPin_tiaoWeiPin.put("600328", "中盐化工");//299	化学原料	4.21	161.08	2.34	价格区间: 5日:94.71 	10日:95.65 	20日:75.16 	30日:73.55 	60日:73.55 	120日:33.63 	250日:39.60 		,当前价：16.82	,当前：2022-03-30 14:19:53
//        shiPin_tiaoWeiPin.put("002539", "云图控股");//284	化肥行业	-0.73	137.88	2.65	价格区间: 5日:78.81 	10日:82.42 	20日:69.09 	30日:65.29 	60日:61.29 	120日:31.96 	250日:35.96 		,当前价：13.65	,当前：2022-03-30 14:19:54
//        shiPin_tiaoWeiPin.put("002597", "金禾实业");//271	食品饮料	0.45	223.75	1.05	价格区间: 5日:55.03 	10日:59.75 	20日:81.89 	30日:73.46 	60日:35.56 	120日:33.73 	250日:45.23 		,当前价：39.89	,当前：2022-03-30 14:19:56
//        shiPin_tiaoWeiPin.put("600251", "冠农股份");//268	农牧饲渔	-5.79	78.85	2.44	价格区间: 5日:14.29 	10日:36.25 	20日:42.29 	30日:55.89 	60日:63.31 	120日:63.31 	250日:60.00 		,当前价：10.09	,当前：2022-03-30 14:19:57
//        shiPin_tiaoWeiPin.put("002568", "百润股份");//250	酿酒行业	7.38	276.61	2.41	价格区间: 5日:71.47 	10日:52.92 	20日:29.29 	30日:24.46 	60日:11.16 	120日:8.40  	250日:5.46  		,当前价：36.83	,当前：2022-03-30 14:19:57
    }






    /**
     * ["在线旅游"]：8;
     */
    public static Map<String, String> lvYou_zaiXianLvYou = new HashMap<>();

    static {
        lvYou_zaiXianLvYou.put("000524", "岭南控股");//348	旅游酒店     2.69	86.99	3.56	价格区间: 5日:63.25 	10日:69.93 	20日:55.07 	30日:57.32 	60日:64.04 	120日:67.69 	250日:67.69 		,当前价：12.98	,当前：2022-04-12 10:27:32
        lvYou_zaiXianLvYou.put("000796", "凯撒旅业");//320	旅游酒店     3.44	94.27	4.03	价格区间: 5日:62.27 	10日:68.32 	20日:73.82 	30日:78.16 	60日:82.30 	120日:84.77 	250日:85.34 		,当前价：11.74	,当前：2022-04-12 10:27:33
        lvYou_zaiXianLvYou.put("002707", "众信旅游");//258	旅游酒店     2.23	66.62	4.08	价格区间: 5日:30.88 	10日:37.50 	20日:70.10 	30日:70.10 	60日:52.70 	120日:63.57 	250日:67.96 		,当前价：7.35	,当前：2022-04-12 10:27:35
        lvYou_zaiXianLvYou.put("002244", "滨江集团");//255	房地产开发   -0.14	226.82	1.3 	价格区间: 5日:33.70 	10日:54.14 	20日:74.48 	30日:74.48 	60日:79.25 	120日:84.67 	250日:85.05 		,当前价：7.29	,当前：2022-04-12 10:27:36
        lvYou_zaiXianLvYou.put("600258", "首旅酒店");//252	旅游酒店     5.01	256.12	2.51	价格区间: 5日:36.18 	10日:33.71 	20日:35.28 	30日:21.51 	60日:19.07 	120日:19.07 	250日:39.40 		,当前价：22.84	,当前：2022-04-12 10:27:37
        lvYou_zaiXianLvYou.put("600640", "新国脉  ");//236	文化传媒     0.78	81.96	1.58	价格区间: 5日:5.04  	10日:5.04  	20日:24.57 	30日:24.57 	60日:7.88  	120日:7.74  	250日:7.74  		,当前价：10.3	,当前：2022-04-12 10:27:38
        lvYou_zaiXianLvYou.put("000069", "华侨城Ａ");//224	房地产开发   -0.14	602.01	1.25	价格区间: 5日:3.23  	10日:48.86 	20日:63.27 	30日:63.27 	60日:54.39 	120日:54.39 	250日:33.26 		,当前价：7.34	,当前：2022-04-12 10:27:39
        lvYou_zaiXianLvYou.put("600138", "中青旅  ");//190	旅游酒店     4.51	90.55	4.17	价格区间: 5日:38.21 	10日:47.22 	20日:65.14 	30日:65.14 	60日:62.34 	120日:70.48 	250日:72.94 		,当前价：12.51	,当前：2022-04-12 10:27:40
    }

    /**
     * lvYou_mianShui ["免税概念"]：22;
     */
    public static Map<String, String> lvYou_mianShui = new HashMap<>();

    static {
        lvYou_mianShui.put("600338", "西藏珠峰");//373	有色金属	-0.08	241.63	2.19	价格区间: 5日:32.39 	10日:17.32 	20日:13.40 	30日:7.76  	60日:6.49  	120日:5.55  	250日:40.92 		,当前价：26.43	,当前：2022-04-01 10:34:10
        lvYou_mianShui.put("000524", "岭南控股");//352	旅游酒店	10   	84.04	12.97	价格区间: 5日:100.00	10日:38.74 	20日:54.48 	30日:56.76 	60日:63.57 	120日:67.16 	250日:67.16 		,当前价：12.54	,当前：2022-04-01 10:34:12
        lvYou_mianShui.put("000796", "凯撒旅业");//315	旅游酒店	4.27	84.32	6.1 	价格区间: 5日:80.77 	10日:61.40 	20日:75.00 	30日:77.16 	60日:75.06 	120日:77.91 	250日:78.65 		,当前价：10.5	,当前：2022-04-01 10:34:13
        lvYou_mianShui.put("002707", "众信旅游");//271	旅游酒店	4.92	69.52	4.54	价格区间: 5日:86.36 	10日:80.85 	20日:91.18 	30日:91.18 	60日:66.46 	120日:74.08 	250日:77.20 		,当前价：7.67	,当前：2022-04-01 10:34:14
        lvYou_mianShui.put("000861", "海印股份");//235	综合行业	3.71	84.42	2.45	价格区间: 5日:59.26 	10日:55.26 	20日:83.65 	30日:83.65 	60日:86.82 	120日:90.66 	250日:91.41 		,当前价：3.63	,当前：2022-04-01 10:34:15
        lvYou_mianShui.put("601888", "中国中免");//229	旅游酒店	6.68	3423.67	2.52	价格区间: 5日:84.86 	10日:83.02 	20日:39.79 	30日:26.17 	60日:22.09 	120日:13.60 	250日:8.74  		,当前价：175.35	,当前：2022-04-01 10:34:16
        lvYou_mianShui.put("001979", "招商蛇口");//226	房地产开发	-0.92	1190.07	2.48	价格区间: 5日:53.85 	10日:74.47 	20日:82.91 	30日:82.91 	60日:82.91 	120日:90.24 	250日:90.74 		,当前价：15.02	,当前：2022-04-01 10:34:17
        lvYou_mianShui.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:93.10 	10日:63.82 	20日:55.02 	30日:45.82 	60日:38.39 	120日:47.75 	250日:54.33 		,当前价：50.49	,当前：2022-04-01 10:34:19
        lvYou_mianShui.put("600018", "上港集团");//193	航运港口	10.05	1401.38	25.96	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:91.58 	60日:81.31 	120日:84.80 	250日:82.30 		,当前价：6.02	,当前：2022-04-01 10:34:20
        lvYou_mianShui.put("002163", "海南发展");//190	玻璃玻纤	9.96	86.94	6.84	价格区间: 5日:100.00	10日:100.00	20日:73.89 	30日:56.23 	60日:43.72 	120日:30.47 	250日:12.80 		,当前价：10.82	,当前：2022-04-01 10:34:21
//        lvYou_mianShui.put("000564", "*ST大集 ");//181	商业百货	-1.02	185.89	8.38	价格区间: 5日:23.08 	10日:20.00 	20日:12.00 	30日:9.09  	60日:3.90  	120日:0.74  	250日:0.74  		,当前价：0.97	,当前：2022-04-01 10:34:22
//        lvYou_mianShui.put("600029", "南方航空");//177	航空机场	2.75	1077.92	2.04	价格区间: 5日:55.36 	10日:43.06 	20日:39.37 	30日:33.78 	60日:23.47 	120日:23.47 	250日:44.56 		,当前价：6.36	,当前：2022-04-01 10:34:23
//        lvYou_mianShui.put("600515", "*ST基础 ");//175	房地产开发	3.93	422.74	11.33	价格区间: 5日:86.11 	10日:86.11 	20日:47.89 	30日:44.74 	60日:26.15 	120日:4.10  	250日:3.31  		,当前价：3.7	,当前：2022-04-01 10:34:23
        lvYou_mianShui.put("600859", "王府井  ");//172	商业百货	9.99	258.29	3.1 	价格区间: 5日:100.00	10日:100.00	20日:53.99 	30日:34.48 	60日:30.34 	120日:21.30 	250日:18.99 		,当前价：22.8	,当前：2022-04-01 10:34:25
    }

    /**
     * lvYou_hangKongJiChang 航空机场
     */
    public static Map<String, String> lvYou_hangKongJiChang = new HashMap<>();

    static {
        lvYou_hangKongJiChang.put("600004", "白云机场");//230	航空机场	3.84	301.05	2.56	价格区间: 5日:90.43 	10日:65.82 	20日:71.43 	30日:51.24 	60日:42.75 	120日:50.89 	250日:67.11 		,当前价：12.72	,当前：2022-04-01 11:39:04
        lvYou_hangKongJiChang.put("601111", "中国国航");//224	航空机场	4.94	1388.57	2.28	价格区间: 5日:87.50 	10日:73.04 	20日:73.82 	30日:62.95 	60日:46.23 	120日:55.91 	250日:68.16 		,当前价：9.56	,当前：2022-04-01 11:39:05
        lvYou_hangKongJiChang.put("002928", "华夏航空");//223	航空机场	1.36	105.72	2.56	价格区间: 5日:43.75 	10日:37.23 	20日:32.84 	30日:18.23 	60日:14.93 	120日:14.93 	250日:17.28 		,当前价：10.43	,当前：2022-04-01 11:39:07
        lvYou_hangKongJiChang.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:91.75 	10日:66.73 	20日:56.71 	30日:47.23 	60日:39.57 	120日:48.75 	250日:54.94 		,当前价：50.49	,当前：2022-04-01 11:39:08
    }

    /**
     * yuZhiCaiGaiNian ["预制菜概念"]：16;
     */
    public static Map<String, String> shiPin_yuZhiCai = new HashMap<>();

    static {
        shiPin_yuZhiCai.put("000524", "岭南控股");//336	旅游酒店     2.22	83.44	5.24	价格区间: 5日:74.43 	10日:79.34 	20日:57.27 	30日:59.41 	60日:65.80 	120日:69.17 	250日:69.17 		,当前价：12.45	,当前：2022-04-11 10:20:38
        shiPin_yuZhiCai.put("605089", "味知香  ");//336	食品饮料     10.01	61.66	3.35	价格区间: 5日:59.54 	10日:59.54 	20日:67.48 	30日:56.73 	60日:16.35 	120日:16.35 	250日:20.85 		,当前价：61.66	,当前：2022-04-11 10:20:39
        shiPin_yuZhiCai.put("600965", "福成股份");//250	农牧饲渔     5.87	57.55	4.09	价格区间: 5日:44.00 	10日:32.04 	20日:57.99 	30日:57.99 	60日:24.20 	120日:24.20 	250日:36.70 		,当前价：7.03	,当前：2022-04-11 10:20:40
        shiPin_yuZhiCai.put("002124", "天邦股份");//248	农牧饲渔     1.57	154.49	2.69	价格区间: 5日:20.51 	10日:40.68 	20日:69.03 	30日:69.03 	60日:69.12 	120日:69.21 	250日:42.88 		,当前价：8.4	,当前：2022-04-11 10:20:41
        shiPin_yuZhiCai.put("000019", "深粮控股");//242	贸易行业     3.89	104.53	13.36	价格区间: 5日:62.75 	10日:54.59 	20日:71.03 	30日:71.03 	60日:74.07 	120日:75.44 	250日:75.44 		,当前价：9.07	,当前：2022-04-11 10:20:43
        shiPin_yuZhiCai.put("603345", "安井食品");//237	食品饮料     3.46	315.31	2.46	价格区间: 5日:37.97 	10日:36.92 	20日:28.44 	30日:17.63 	60日:7.32  	120日:4.32  	250日:2.83  		,当前价：107.5	,当前：2022-04-11 10:20:44
        shiPin_yuZhiCai.put("000876", "新希望  ");//231	农牧饲渔     3.19	729.39	3.66	价格区间: 5日:16.75 	10日:16.75 	20日:58.68 	30日:58.68 	60日:47.15 	120日:50.55 	250日:53.84 		,当前价：16.19	,当前：2022-04-11 10:20:45
    }

    /**
     * shiPin_sheQuTuanGou ["社区团购"]：18;
     */
    public static Map<String, String> shiPin_sheQuTuanGou = new HashMap<>();

    static {
        shiPin_sheQuTuanGou.put("000607", "华媒控股");//277	文化传媒     0.85	60.25	4.42	价格区间: 5日:39.86 	10日:39.86 	20日:54.64 	30日:54.64 	60日:42.96 	120日:59.49 	250日:61.65 		,当前价：5.92	,当前：2022-04-11 10:34:37
        shiPin_sheQuTuanGou.put("600327", "大东方  ");//232	汽车服务     0.5 	52.91	2.47	价格区间: 5日:21.05 	10日:10.71 	20日:6.78  	30日:6.78  	60日:28.57 	120日:35.55 	250日:42.19 		,当前价：5.98	,当前：2022-04-11 10:34:38
        shiPin_sheQuTuanGou.put("002183", "怡亚通  ");//215	物流行业     9.92	143.87	40.29	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:98.08 	60日:49.04 	120日:43.59 	250日:32.60 		,当前价：5.54	,当前：2022-04-11 10:34:39
    }



    /**
     * shiPin 食品: 预制菜概念,社区团购,调味品概念
     */
    public static Map<String, String> shiPin = new HashMap<>();

    static {
        shiPin.putAll(shiPin_yuZhiCai);
        shiPin.putAll(shiPin_tiaoWeiPin);
        shiPin.putAll(shiPin_sheQuTuanGou);
    }

    /**
     * jiuShui 酒水
     */
    public static Map<String, String> jiuShui = new HashMap<>();

    static {
        jiuShui.putAll(jiuShui_baiJiu);
    }


    /**
     * lvYou 旅游
     */
    public static Map<String, String> lvYou = new HashMap<>();

    static {
        lvYou.putAll(lvYou_zaiXianLvYou);//在线旅游
        lvYou.putAll(lvYou_mianShui);//免税概念
        lvYou.putAll(lvYou_hangKongJiChang);//航空机场
    }

    /**
     * wuLiu_kuaiDi ["快递概念"]：23;
     */
    public static Map<String, String> wuLiu_kuaiDi = new HashMap<>();

    static {
        wuLiu_kuaiDi.put("603056", "德邦股份");//268	物流行业     -8.3	148.70	7.01	价格区间: 5日:7.65  	10日:1.87  	20日:5.62  	30日:33.02 	60日:35.75 	120日:37.58 	250日:38.12 		,当前价：14.48	,当前：2022-04-12 10:57:33
        wuLiu_kuaiDi.put("002210", "飞马国际");//266	物流行业     6.23	86.22	25.45	价格区间: 5日:81.97 	10日:83.08 	20日:83.08 	30日:68.35 	60日:57.45 	120日:31.69 	250日:38.52 		,当前价：3.24	,当前：2022-04-12 10:57:35
        wuLiu_kuaiDi.put("600787", "中储股份");//246	物流行业     9.95	143.43	34.86	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:98.70 	120日:67.56 	250日:58.31 		,当前价：6.52	,当前：2022-04-12 10:57:36
        wuLiu_kuaiDi.put("600153", "建发股份");//244	贸易行业     0.45	383.41	1.16	价格区间: 5日:33.55 	10日:66.77 	20日:81.00 	30日:81.00 	60日:81.17 	120日:85.49 	250日:86.36 		,当前价：13.39	,当前：2022-04-12 10:57:37
        wuLiu_kuaiDi.put("002120", "韵达股份");//235	物流行业     2.77	484.76	1.87	价格区间: 5日:47.98 	10日:38.43 	20日:19.39 	30日:17.51 	60日:10.94 	120日:10.94 	250日:37.58 		,当前价：16.7	,当前：2022-04-12 10:57:38
        wuLiu_kuaiDi.put("600233", "圆通速递");//229	物流行业     2.71	533.55	1.71	价格区间: 5日:26.18 	10日:23.99 	20日:20.39 	30日:20.39 	60日:17.18 	120日:41.94 	250日:62.62 		,当前价：15.53	,当前：2022-04-12 10:57:39
        wuLiu_kuaiDi.put("002010", "传化智联");//221	物流行业     -6.62	199.34	10.89	价格区间: 5日:36.00 	10日:36.00 	20日:32.35 	30日:19.41 	60日:12.09 	120日:8.97  	250日:16.14 		,当前价：6.49	,当前：2022-04-12 10:57:40
    }

    /**
     * wuLiu_tongYiDaShiChang ["统一大市场"]：6;
     */
    public static Map<String, String> wuLiu_tongYiDaShiChang = new HashMap<>();

    static {
        wuLiu_tongYiDaShiChang.put("002210", "飞马国际");//260	物流行业     4.26	84.63	25.45	价格区间: 5日:81.97 	10日:83.08 	20日:83.08 	30日:68.35 	60日:57.45 	120日:31.69 	250日:38.52 		,当前价：3.18	,当前：2022-04-12 10:55:29
        wuLiu_tongYiDaShiChang.put("600787", "中储股份");//240	物流行业     7.08	139.69	34.86	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:98.70 	120日:67.56 	250日:58.31 		,当前价：6.35	,当前：2022-04-12 10:55:31
        wuLiu_tongYiDaShiChang.put("002010", "传化智联");//221	物流行业     -6.19	200.26	10.89	价格区间: 5日:37.33 	10日:37.33 	20日:33.33 	30日:20.00 	60日:12.45 	120日:9.24  	250日:16.36 		,当前价：6.52	,当前：2022-04-12 10:55:32
        wuLiu_tongYiDaShiChang.put("002183", "怡亚通  ");//201	物流行业     -4.33	131.93	7.42	价格区间: 5日:42.03 	10日:50.62 	20日:60.78 	30日:59.62 	60日:30.85 	120日:26.50 	250日:21.64 		,当前价：5.08	,当前：2022-04-12 10:55:33
        wuLiu_tongYiDaShiChang.put("001213", "中铁特货");//196	物流行业     -3.56	252.89	17.54	价格区间: 5日:74.47 	10日:75.76 	20日:76.47 	30日:76.47 	60日:62.90 	120日:33.61 	250日:25.90 		,当前价：5.69	,当前：2022-04-12 10:55:34
    }

    /**
     * wuLiu_haiYangJingJi ["海洋经济"]：17;
     */
    public static Map<String, String> wuLiu_haiYangJingJi = new HashMap<>();

    static {
        wuLiu_haiYangJingJi.put("002639", "雪人股份");//369	通用设备     5.76	99.36	2.49	价格区间: 5日:75.12 	10日:76.71 	20日:61.59 	30日:61.59 	60日:39.06 	120日:49.65 	250日:53.95 		,当前价：12.86	,当前：2022-04-12 11:47:22
        wuLiu_haiYangJingJi.put("600522", "中天科技");//330	通信设备     -0.87	503.41	1.23	价格区间: 5日:1.18  	10日:1.02  	20日:0.59  	30日:0.50  	60日:12.30 	120日:50.08 	250日:56.37 		,当前价：14.75	,当前：2022-04-12 11:47:23
        wuLiu_haiYangJingJi.put("600026", "中远海能");//293	航运港口     2.04	332.91	2.09	价格区间: 5日:81.01 	10日:90.13 	20日:91.33 	30日:91.33 	60日:93.48 	120日:93.48 	250日:79.93 		,当前价：6.99	,当前：2022-04-12 11:47:24
        wuLiu_haiYangJingJi.put("601919", "中远海控");//284	航运港口     0.4 	2411.74	0.78	价格区间: 5日:15.08 	10日:12.33 	20日:12.33 	30日:7.11  	60日:7.05  	120日:12.45 	250日:36.42 		,当前价：15.06	,当前：2022-04-12 11:47:26
        wuLiu_haiYangJingJi.put("601890", "亚星锚链");//270	船舶制造     5.34	71.96	0.99	价格区间: 5日:83.33 	10日:83.33 	20日:82.42 	30日:38.07 	60日:21.93 	120日:35.82 	250日:50.19 		,当前价：7.5	,当前：2022-04-12 11:47:27
    }

    /**
     * wuLiu_rcep ["RCEP概念"]：13;
     */
    public static Map<String, String> wuLiu_rcep = new HashMap<>();

    static {
        wuLiu_rcep.put("000811", "冰轮环境");//287	通用设备     0.84	80.92	1.92	价格区间: 5日:41.86 	10日:36.73 	20日:23.15 	30日:22.86 	60日:12.24 	120日:11.52 	250日:37.50 		,当前价：10.85	,当前：2022-04-12 13:51:45
        wuLiu_rcep.put("002803", "吉宏股份");//277	文化传媒     -0.61	50.41	1.17	价格区间: 5日:14.00 	10日:12.21 	20日:19.25 	30日:19.25 	60日:5.38  	120日:5.38  	250日:3.30  		,当前价：13.01	,当前：2022-04-12 13:51:47
        wuLiu_rcep.put("002612", "朗姿股份");//244	纺织服装     -0.57	91.98	1.73	价格区间: 5日:16.50 	10日:13.51 	20日:11.65 	30日:7.29  	60日:5.82  	120日:3.11  	250日:1.31  		,当前价：20.79	,当前：2022-04-12 13:51:48
        wuLiu_rcep.put("000582", "北部湾港");//239	航运港口     10   	186.86	8.54	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：11.44	,当前：2022-04-12 13:51:49
        wuLiu_rcep.put("603565", "中谷物流");//236	航运港口     -1.6	253.21	2.92	价格区间: 5日:45.39 	10日:38.78 	20日:64.35 	30日:38.87 	60日:28.60 	120日:28.60 	250日:22.37 		,当前价：26.41	,当前：2022-04-12 13:51:50
        wuLiu_rcep.put("600190", "锦州港  ");//231	航运港口     6.68	83.10	2.66	价格区间: 5日:85.71 	10日:86.67 	20日:32.91 	30日:32.55 	60日:50.69 	120日:51.85 	250日:51.85 		,当前价：4.15	,当前：2022-04-12 13:51:51
    }

    /**
     * wuLiu_zhongEMaoYi
     */
    public static Map<String, String> wuLiu_zhongEMaoYi = new HashMap<>();

    static {
        wuLiu_zhongEMaoYi.put("600798", "宁波海运");//261	航运港口     9.92	65.51	1.55	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:63.02 	60日:70.42 	120日:70.42 	250日:70.42 		,当前价：5.43	,当前：2022-04-12 13:58:42
        wuLiu_zhongEMaoYi.put("600251", "冠农股份");//257	农牧饲渔     -1.7	81.35	1.93	价格区间: 5日:64.29 	10日:57.75 	20日:66.29 	30日:60.79 	60日:75.07 	120日:75.07 	250日:65.48 		,当前价：10.41	,当前：2022-04-12 13:58:44
        wuLiu_zhongEMaoYi.put("002758", "浙农股份");//257	综合行业     -5.12	73.64	2.84	价格区间: 5日:38.83 	10日:23.19 	20日:38.80 	30日:26.25 	60日:42.51 	120日:46.59 	250日:51.07 		,当前价：14.65	,当前：2022-04-12 13:58:45
        wuLiu_zhongEMaoYi.put("002353", "杰瑞股份");//255	专用设备     2.87	380.94	0.93	价格区间: 5日:37.16 	10日:21.32 	20日:17.69 	30日:17.42 	60日:17.42 	120日:16.75 	250日:40.88 		,当前价：39.77	,当前：2022-04-12 13:58:46
        wuLiu_zhongEMaoYi.put("600190", "锦州港  ");//231	航运港口     6.68	83.10	2.66	价格区间: 5日:89.29 	10日:90.00 	20日:34.18 	30日:33.49 	60日:51.38 	120日:52.53 	250日:52.53 		,当前价：4.15	,当前：2022-04-12 13:58:47
    }

    /**
     * wuLiu 物流
     */
    public static Map<String, String> wuLiu = new HashMap<>();

    static {
        wuLiu.putAll(wuLiu_kuaiDi);//快递概念
        wuLiu.putAll(wuLiu_tongYiDaShiChang);//统一大市场
        wuLiu.putAll(wuLiu_haiYangJingJi);//海洋经济
        wuLiu.putAll(wuLiu_rcep);//RCEP概念
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {

        all.putAll(shiPin); //食品
        all.putAll(jiuShui); //酒水
        all.putAll(wuLiu); //物流

        all.putAll(lvYou); //旅游
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStXiaoFei.all, date);//all nongYe
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.lvYou, date);//all nongYe lvYou
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.shiPin, date);//
    }
}
