package utils;

import ttjj.service.KlineService;
import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：指数
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStZhiShu {
    /**
     * shangzheng_50 上证50_
     */
    public static Map<String, String> shangZheng_50 = new HashMap<>();

    static {
        shangZheng_50.put("600048", "保利发展");//210	房地产开发   4.06	2116.35	1.52	价格区间: 5日:49.69 	10日:26.05 	20日:31.75 	30日:63.26 	60日:63.26 	120日:70.70 	250日:78.80 		,当前价：17.68	,当前：2022-04-26 14:39:42
        shangZheng_50.put("600196", "复星医药");//204	化学制药     8.71	1138.18	2.19	价格区间: 5日:88.26 	10日:58.33 	20日:28.55 	30日:26.27 	60日:34.13 	120日:34.22 	250日:13.67 		,当前价：44.41	,当前：2022-04-26 14:39:43
        shangZheng_50.put("603259", "药明康德");//203	医疗服务     5.45	3050.40	2.42	价格区间: 5日:74.38 	10日:45.92 	20日:38.61 	30日:40.99 	60日:55.20 	120日:31.44 	250日:23.23 		,当前价：103.2	,当前：2022-04-26 14:39:44
        shangZheng_50.put("601888", "中国中免");//196	旅游酒店     3.8 	3516.21	2.66	价格区间: 5日:68.84 	10日:68.84 	20日:80.87 	30日:80.81 	60日:33.45 	120日:22.21 	250日:13.45 		,当前价：180.09	,当前：2022-04-26 14:39:45
        shangZheng_50.put("601088", "中国神华");//193	煤炭行业     -0.59	5668.49	1.96	价格区间: 5日:27.27 	10日:14.83 	20日:14.83 	30日:53.58 	60日:57.25 	120日:68.91 	250日:72.48 		,当前价：28.53	,当前：2022-04-26 14:39:46
        shangZheng_50.put("601668", "中国建筑");//180	工程建设     3.88	2470.32	1.58	价格区间: 5日:47.83 	10日:37.29 	20日:64.42 	30日:76.43 	60日:76.43 	120日:78.49 	250日:80.11 		,当前价：5.89	,当前：2022-04-26 14:39:47
        shangZheng_50.put("600809", "山西汾酒");//179	酿酒行业     1.38	3135.57	2.52	价格区间: 5日:31.72 	10日:24.98 	20日:53.21 	30日:47.13 	60日:37.06 	120日:23.07 	250日:17.99 		,当前价：256.99	,当前：2022-04-26 14:39:48
        shangZheng_50.put("601899", "紫金矿业");//172	贵金属       -3.2	2706.65	2.16	价格区间: 5日:7.85  	10日:5.32  	20日:5.32  	30日:25.63 	60日:25.63 	120日:26.04 	250日:26.85 		,当前价：10.28	,当前：2022-04-26 14:39:49
        shangZheng_50.put("601857", "中国石油");//164	石油行业     -0.99	9151.05	1.82	价格区间: 5日:7.94  	10日:6.67  	20日:6.67  	30日:16.67 	60日:11.48 	120日:25.00 	250日:42.47 		,当前价：5.0	,当前：2022-04-26 14:39:50
        shangZheng_50.put("600438", "通威股份");//164	光伏设备     4.32	1651.62	4.14	价格区间: 5日:30.13 	10日:24.31 	20日:14.40 	30日:12.42 	60日:12.42 	120日:6.33  	250日:18.65 		,当前价：36.69	,当前：2022-04-26 14:39:50
        shangZheng_50.put("603986", "兆易创新");//164	半导体       -4.91	780.67	2.42	价格区间: 5日:6.89  	10日:6.07  	20日:4.07  	30日:2.96  	60日:2.96  	120日:2.18  	250日:2.48  		,当前价：116.96	,当前：2022-04-26 14:39:51
        shangZheng_50.put("600547", "山东黄金");//156	贵金属       -2.3	815.51	2.09	价格区间: 5日:0.57  	10日:0.35  	20日:0.35  	30日:1.74  	60日:1.74  	120日:1.74  	250日:19.31 		,当前价：18.23	,当前：2022-04-26 14:39:52
        shangZheng_50.put("601919", "中远海控");//154	航运港口     0.07	2174.73	2.43	价格区间: 5日:8.21  	10日:7.62  	20日:4.66  	30日:4.66  	60日:3.23  	120日:2.58  	250日:18.00 		,当前价：13.58	,当前：2022-04-26 14:39:53
        shangZheng_50.put("601166", "兴业银行");//151	银行         1.38	4271.17	1.59	价格区间: 5日:20.83 	10日:13.76 	20日:33.57 	30日:47.51 	60日:38.91 	120日:49.44 	250日:56.03 		,当前价：20.56	,当前：2022-04-26 14:39:54
    }

    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(shangZheng_50);
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStYiLiao.all, date);
    }
}
