package utils;

import ttjj.rank.stat.StockStat;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：医疗
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStYiLiao {

    /**
     * yiMei_maoFaYiLiao ["毛发医疗"]：8;
     */
    public static Map<String, String> yiMei_maoFaYiLiao = new HashMap<>();

    static {
        yiMei_maoFaYiLiao.put("000615", "奥园美谷");//355	美容护理     -0.62	75.46	3.55	价格区间: 5日:83.40 	10日:87.58 	20日:87.58 	30日:89.87 	60日:89.87 	120日:36.19 	250日:14.97 		,当前价：9.66	,当前：2022-04-21 10:03:25
        yiMei_maoFaYiLiao.put("600557", "康缘药业");//284	中药         0.53	76.61	1.4 	价格区间: 5日:10.24 	10日:3.91  	20日:12.55 	30日:22.45 	60日:43.51 	120日:49.52 	250日:49.28 		,当前价：13.29	,当前：2022-04-21 10:03:26
        yiMei_maoFaYiLiao.put("002612", "朗姿股份");//281	纺织服装     2.04	103.89	4.88	价格区间: 5日:100.00	10日:100.00	20日:99.40 	30日:59.15 	60日:54.52 	120日:23.24 	250日:9.82  		,当前价：23.48	,当前：2022-04-21 10:03:28
        yiMei_maoFaYiLiao.put("000516", "国际医学");//257	医疗服务     -0.96	164.78	1.53	价格区间: 5日:14.17 	10日:9.63  	20日:9.63  	30日:32.40 	60日:32.40 	120日:13.57 	250日:5.37  		,当前价：7.24	,当前：2022-04-21 10:03:29
        yiMei_maoFaYiLiao.put("000989", "九芝堂  ");//234	中药         1.76	90.24	5.67	价格区间: 5日:85.37 	10日:85.37 	20日:71.79 	30日:78.52 	60日:78.52 	120日:58.52 	250日:59.95 		,当前价：10.38	,当前：2022-04-21 10:03:30
    }

    /**
     * zhongYao_zhongYaoGaiNian ["中药概念"]：82;
     */
    public static Map<String, String> zhongYao_zhongYaoGaiNian = new HashMap<>();

    static {
        zhongYao_zhongYaoGaiNian.put("002349", "精华制药");//535	中药    	0.18	176.68	1.6 	价格区间: 5日:25.12 	10日:53.97 	20日:63.44 	30日:63.44 	60日:68.84 	120日:73.78 	250日:74.75 		,当前价：21.7	,当前：2022-03-30 11:22:03
        zhongYao_zhongYaoGaiNian.put("002326", "永太科技");//472	化学制品	10   	334.59	2.75	价格区间: 5日:48.36 	10日:63.69 	20日:72.28 	30日:72.28 	60日:44.92 	120日:21.68 	250日:40.77 		,当前价：38.17	,当前：2022-03-30 11:22:05
        zhongYao_zhongYaoGaiNian.put("002317", "众生药业");//402	中药    	1.88	132.11	1.15	价格区间: 5日:27.21 	10日:52.93 	20日:65.86 	30日:68.50 	60日:69.25 	120日:73.67 	250日:74.08 		,当前价：16.22	,当前：2022-03-30 11:22:06
        zhongYao_zhongYaoGaiNian.put("600771", "广誉远  ");//377	中药    	-2.96	177.12	2.34	价格区间: 5日:68.95 	10日:78.34 	20日:82.37 	30日:82.37 	60日:46.58 	120日:47.48 	250日:53.87 		,当前价：36.0	,当前：2022-03-30 11:22:07
        zhongYao_zhongYaoGaiNian.put("600976", "健民集团");//371	中药    	-0.6	88.65	1.43	价格区间: 5日:47.34 	10日:47.11 	20日:54.78 	30日:51.72 	60日:22.95 	120日:39.77 	250日:54.85 		,当前价：57.79	,当前：2022-03-30 11:22:09
        zhongYao_zhongYaoGaiNian.put("002435", "长江健康");//365	化学制药	-2.93	81.95	2.12	价格区间: 5日:25.51 	10日:11.06 	20日:36.38 	30日:42.75 	60日:44.73 	120日:44.73 	250日:44.73 		,当前价：6.63	,当前：2022-03-30 11:22:10
        zhongYao_zhongYaoGaiNian.put("002750", "龙津药业");//364	中药    	4.75	64.48	1.45	价格区间: 5日:38.89 	10日:58.46 	20日:63.50 	30日:63.50 	60日:42.79 	120日:57.70 	250日:57.70 		,当前价：16.1	,当前：2022-03-30 11:22:11
        zhongYao_zhongYaoGaiNian.put("600587", "新华医疗");//362	医疗器械	1.04	103.86	1.76	价格区间: 5日:42.02 	10日:27.62 	20日:42.79 	30日:42.79 	60日:33.19 	120日:43.03 	250日:52.20 		,当前价：25.21	,当前：2022-03-30 11:22:12
        zhongYao_zhongYaoGaiNian.put("600196", "复星医药");//352	化学制药	3.41	1431.89	2.24	价格区间: 5日:88.40 	10日:82.22 	20日:88.61 	30日:88.61 	60日:88.61 	120日:88.61 	250日:36.48 		,当前价：55.87	,当前：2022-03-30 11:22:13
        zhongYao_zhongYaoGaiNian.put("002907", "华森制药");//347	中药    	-2.81	63.99	2.68	价格区间: 5日:16.84 	10日:48.25 	20日:58.97 	30日:58.97 	60日:44.83 	120日:48.88 	250日:48.88 		,当前价：15.93	,当前：2022-03-30 11:22:14
        zhongYao_zhongYaoGaiNian.put("600129", "太极集团");//342	中药    	-2.54	117.62	5.88	价格区间: 5日:89.58 	10日:90.70 	20日:93.92 	30日:93.92 	60日:48.29 	120日:59.06 	250日:62.30 		,当前价：21.12	,当前：2022-03-30 11:22:15
        zhongYao_zhongYaoGaiNian.put("605199", "葫芦娃  ");//334	中药    	-3.94	88.86	2.22	价格区间: 5日:28.25 	10日:28.25 	20日:62.33 	30日:62.33 	60日:42.50 	120日:42.50 	250日:21.07 		,当前价：22.21	,当前：2022-03-30 11:22:16
        zhongYao_zhongYaoGaiNian.put("002603", "以岭药业");//334	中药    	-1.22	498.54	2.36	价格区间: 5日:62.29 	10日:60.99 	20日:83.48 	30日:83.48 	60日:87.98 	120日:89.91 	250日:89.91 		,当前价：29.84	,当前：2022-03-30 11:22:17
        zhongYao_zhongYaoGaiNian.put("002411", "延安必康");//331	医药商业	0.97	143.12	1.36	价格区间: 5日:28.85 	10日:22.39 	20日:45.55 	30日:39.73 	60日:28.52 	120日:18.81 	250日:37.36 		,当前价：9.34	,当前：2022-03-30 11:22:18
//        ["独家药品"]：25;
//        tiWaiZhenDuan.put("600976", "健民集团");//399	中药    	4.98	99.31	14.76	价格区间: 5日:99.84 	10日:99.87 	20日:99.87 	30日:61.23 	60日:41.17 	120日:54.01 	250日:65.79 		,当前价：64.74	,当前：2022-03-23 10:53:31
//        tiWaiZhenDuan.put("600771", "广誉远  ");//352	中药    	7.03	164.13	2.55	价格区间: 5日:100.00	10日:100.00	20日:77.81 	30日:77.81 	60日:30.61 	120日:36.18 	250日:48.81 		,当前价：33.36	,当前：2022-03-23 10:53:33
//        tiWaiZhenDuan.put("002603", "以岭药业");//339	中药    	2.22	491.35	2.75	价格区间: 5日:43.97 	10日:72.54 	20日:76.28 	30日:77.43 	60日:83.79 	120日:85.50 	250日:86.37 		,当前价：29.41	,当前：2022-03-23 10:53:34
    }

    /**
     * zhongYao_duJiaYaoPin ["独家药品"]：25;
     */
    public static Map<String, String> zhongYao_duJiaYaoPin = new HashMap<>();

    static {
        zhongYao_duJiaYaoPin.put("002603", "以岭药业");//380	中药         2.42	593.60	11.24	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：35.53	,当前：2022-04-07 14:13:23
        zhongYao_duJiaYaoPin.put("600976", "健民集团");//358	中药         -3.32	83.88	2.17	价格区间: 5日:6.97  	10日:5.34  	20日:24.18 	30日:24.18 	60日:10.29 	120日:28.41 	250日:47.16 		,当前价：54.68	,当前：2022-04-07 14:13:25
        zhongYao_duJiaYaoPin.put("600771", "广誉远  ");//346	中药         0.59	168.66	2.49	价格区间: 5日:20.00 	10日:50.14 	20日:59.42 	30日:59.42 	60日:35.98 	120日:37.03 	250日:48.42 		,当前价：34.28	,当前：2022-04-07 14:13:26
        zhongYao_duJiaYaoPin.put("605199", "葫芦娃  ");//330	中药         -3.75	85.30	2.76	价格区间: 5日:54.90 	10日:33.40 	20日:44.17 	30日:44.17 	60日:30.74 	120日:30.74 	250日:15.24 		,当前价：21.32	,当前：2022-04-07 14:13:27
        zhongYao_duJiaYaoPin.put("603439", "贵州三力");//298	中药         -2.79	71.53	2.71	价格区间: 5日:16.72 	10日:44.30 	20日:61.34 	30日:61.34 	60日:64.72 	120日:67.81 	250日:52.37 		,当前价：17.41	,当前：2022-04-07 14:13:29
        zhongYao_duJiaYaoPin.put("000999", "华润三九");//292	中药         -0.38	413.10	2.77	价格区间: 5日:40.19 	10日:64.01 	20日:75.06 	30日:75.06 	60日:75.06 	120日:83.49 	250日:83.83 		,当前价：42.2	,当前：2022-04-07 14:13:30
        zhongYao_duJiaYaoPin.put("002424", "贵州百灵");//269	中药         -8.09	110.64	3.47	价格区间: 5日:6.19  	10日:31.60 	20日:42.29 	30日:42.29 	60日:42.29 	120日:42.61 	250日:42.61 		,当前价：7.84	,当前：2022-04-07 14:13:31
        zhongYao_duJiaYaoPin.put("600085", "同仁堂  ");//263	中药         -3.46	608.25	1.57	价格区间: 5日:24.22 	10日:53.92 	20日:66.73 	30日:66.73 	60日:38.64 	120日:55.09 	250日:62.72 		,当前价：44.35	,当前：2022-04-07 14:13:32
    }

    /**
     * chuangXinYao_cro ["CRO "]：4;
     */
    public static Map<String, String> chuangXinYao_cro = new HashMap<>();

    static {
        chuangXinYao_cro.put("603456", "九洲药业");//329	化学制药	1.05	407.80	0.82	价格区间: 5日:69.46 	10日:71.64 	20日:47.86 	30日:58.76 	60日:54.55 	120日:45.25 	250日:54.61 		,当前价：48.98	,当前：2022-03-31 10:05:51
        chuangXinYao_cro.put("002821", "凯莱英  ");//319	医疗服务	1.16	1001.64	1.98	价格区间: 5日:85.75 	10日:92.88 	20日:94.45 	30日:94.45 	60日:60.08 	120日:43.61 	250日:43.79 		,当前价：378.92	,当前：2022-03-31 10:05:53
        chuangXinYao_cro.put("603259", "药明康德");//298	医疗服务	-0.79	3326.70	0.92	价格区间: 5日:37.27 	10日:56.88 	20日:75.42 	30日:75.42 	60日:76.71 	120日:40.60 	250日:33.57 		,当前价：112.55	,当前：2022-03-31 10:05:55
        chuangXinYao_cro.put("603127", "昭衍新药");//291	医疗服务	0.78	445.30	5.51	价格区间: 5日:71.88 	10日:79.92 	20日:83.30 	30日:85.95 	60日:90.72 	120日:39.53 	250日:31.84 		,当前价：116.8	,当前：2022-03-31 10:05:56
    }
    /**
     * chuangXinYao_qingGaoSu ["青蒿素"]：8;
     */
    public static Map<String, String> chuangXinYao_qingGaoSu = new HashMap<>();

    static {
        chuangXinYao_qingGaoSu.put("600062", "华润双鹤");//329	化学制药     -6.28	294.40	2.12	价格区间: 5日:72.85 	10日:75.42 	20日:84.31 	30日:85.96 	60日:86.52 	净利环增:null;净利同增:null;营收环增:null;营收同增:null;
        chuangXinYao_qingGaoSu.put("600196", "复星医药");//200	化学制药     -0.7	1093.85	1.59	价格区间: 5日:79.60 	10日:62.94 	20日:24.49 	30日:22.26 	60日:30.55 	净利环增:null;净利同增:null;营收环增:null;营收同增:null;
    }

    /**
     * chuangXinYao_cart ["CAR-T细胞疗法"]：7;
     */
    public static Map<String, String> chuangXinYao_cart = new HashMap<>();

    static {
        chuangXinYao_cart.put("600196", "复星医药");//334	化学制药     -6.36	1321.43	2.27	价格区间: 5日:20.92 	10日:35.91 	20日:69.27 	30日:69.27 	60日:69.22 	120日:69.22 	250日:27.65 		,当前价：51.56	,当前：2022-04-07 14:18:12
        chuangXinYao_cart.put("002411", "延安必康");//325	医药商业     -1.87	136.37	2.91	价格区间: 5日:9.52  	10日:4.84  	20日:22.51 	30日:19.63 	60日:28.44 	120日:14.48 	250日:34.18 		,当前价：8.9	,当前：2022-04-07 14:18:14
        chuangXinYao_cart.put("002605", "姚记科技");//315	家用轻工     1.14	86.35	2.2 	价格区间: 5日:76.26 	10日:76.26 	20日:82.47 	30日:80.85 	60日:25.36 	120日:28.92 	250日:29.51 		,当前价：21.33	,当前：2022-04-07 14:18:15
        chuangXinYao_cart.put("000566", "海南海药");//301	化学制药     -10.03	70.97	13.66	价格区间: 5日:51.59 	10日:53.44 	20日:69.65 	30日:69.65 	60日:69.65 	120日:72.52 	250日:44.48 		,当前价：5.47	,当前：2022-04-07 14:18:16
        chuangXinYao_cart.put("603259", "药明康德");//283	医疗服务     -1.19	3156.81	1.36	价格区间: 5日:12.79 	10日:21.17 	20日:58.34 	30日:58.34 	60日:64.91 	120日:36.86 	250日:27.66 		,当前价：106.8	,当前：2022-04-07 14:18:17
    }

    /**
     * zhiYao_diSaiMiSong ["地塞米松"]：6;
     */
    public static Map<String, String> zhiYao_diSaiMiSong = new HashMap<>();

    static {
        zhiYao_diSaiMiSong.put("600199", "金种子酒");//444	酿酒行业     7.62	184.78	9.32	价格区间: 5日:85.82 	10日:87.87 	20日:53.09 	30日:54.81 	60日:75.45 	120日:75.45 	250日:76.19 		,当前价：28.09	,当前：2022-04-13 14:22:28
        zhiYao_diSaiMiSong.put("002907", "华森制药");//276	中药         -3.61	54.63	7.21	价格区间: 5日:3.90  	10日:2.17  	20日:11.71 	30日:22.43 	60日:19.61 	120日:23.14 	250日:23.14 		,当前价：13.6	,当前：2022-04-13 14:22:29
        zhiYao_diSaiMiSong.put("600420", "国药现代");//202	化学制药     10.05	113.58	1.6 	价格区间: 5日:100.00	10日:72.11 	20日:56.50 	30日:57.56 	60日:57.77 	120日:57.77 	250日:57.77 		,当前价：11.06	,当前：2022-04-13 14:22:31
    }
    /**
     * zhiYao_aZiHaiMo ["阿兹海默"]：9;
     */
    public static Map<String, String> zhiYao_aZiHaiMo = new HashMap<>();

    static {
        zhiYao_aZiHaiMo.put("000756", "新华制药");//325	化学制药     10.04	83.64	2.74	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:97.55 	250日:97.55 		,当前价：12.49	,当前：2022-04-28 10:28:59
        zhiYao_aZiHaiMo.put("600789", "鲁抗医药");//177	化学制药     6.46	58.10	47.94	价格区间: 5日:85.58 	10日:82.41 	20日:54.27 	30日:46.35 	60日:46.35 	120日:39.73 	250日:35.04 		,当前价：6.59	,当前：2022-04-28 10:29:00
        zhiYao_aZiHaiMo.put("002038", "双鹭药业");//166	生物制品     0.75	96.26	null	价格区间: 5日:26.42 	10日:26.42 	20日:23.61 	30日:23.61 	60日:23.61 	120日:18.55 	250日:12.69 		,当前价：9.37	,当前：2022-04-28 10:29:01
        zhiYao_aZiHaiMo.put("600227", "圣济堂  ");//160	化学制药     0.33	51.13	0.47	价格区间: 5日:30.23 	10日:15.12 	20日:13.98 	30日:12.87 	60日:12.87 	120日:12.75 	250日:15.20 		,当前价：3.02	,当前：2022-04-28 10:29:02
        zhiYao_aZiHaiMo.put("002020", "京新药业");//160	化学制药     -0.95	75.23	0.39	价格区间: 5日:19.54 	10日:16.19 	20日:7.17  	30日:11.08 	60日:11.08 	120日:11.08 	250日:18.32 		,当前价：8.31	,当前：2022-04-28 10:29:03
    }

    /**
     * ganSuGaiNian ["肝素概念"]：9;
     */
    public static Map<String, String> zhiYao_ganSuGaiNian = new HashMap<>();

    static {
        zhiYao_ganSuGaiNian.put("600062", "华润双鹤");//329	化学制药     -6.28	294.40	2.12	价格区间: 5日:74.72 	10日:77.12 	20日:85.39 	30日:86.92 	60日:87.45 	净利环增:611.72;净利同增:15.99;营收环增:12.61;营收同增:4.59;
        zhiYao_ganSuGaiNian.put("002550", "千红制药");//252	化学制药     -0.48	78.96	1.69	价格区间: 5日:65.52 	10日:78.14 	20日:78.14 	30日:78.14 	60日:64.53 	净利环增:1550.33;净利同增:135.93;营收环增:9.01;营收同增:41.16;
        zhiYao_ganSuGaiNian.put("600196", "复星医药");//200	化学制药     -0.7	1093.85	1.59	价格区间: 5日:78.31 	10日:61.92 	20日:24.10 	30日:21.90 	60日:30.18 	净利环增:-60.49;净利同增:-45.41;营收环增:-13.17;营收同增:28.87;
    }

    /**
     * zhiYao_ganYanGaiNian ["肝炎概念"]：3;
     */
    public static Map<String, String> zhiYao_ganYan = new HashMap<>();
    static {
        zhiYao_ganYan.put("002349", "精华制药");//346	中药         7.7 	121.80	3.76	价格区间: 5日:82.76 	10日:52.91 	20日:25.80 	30日:15.78 	60日:19.20 	净利环增:null;净利同增:null;营收环增:null;营收同增:null;
        zhiYao_ganYan.put("002030", "达安基因");//188	医疗器械     7.84	272.27	4.6 	价格区间: 5日:86.63 	10日:86.63 	20日:86.63 	30日:86.63 	60日:75.91 	净利环增:null;净利同增:null;营收环增:null;营收同增:null;
    }

    /**
     * zhiYao_jiYinCeXu ["基因测序"]：19;
     */
    public static Map<String, String> zhiYao_jiYinCeXu = new HashMap<>();

    static {
        zhiYao_jiYinCeXu.put("603259", "药明康德");//276	医疗服务     2.66	3088.53	0.58	价格区间: 5日:60.67 	10日:36.43 	20日:42.50 	30日:52.60 	60日:60.25 	120日:34.76 	250日:25.58 		,当前价：104.49	,当前：2022-04-14 11:23:42
        zhiYao_jiYinCeXu.put("000516", "ST国医  ");//274	医疗服务     -2.29	184.58	8.4 	价格区间: 5日:21.85 	10日:21.85 	20日:62.80 	30日:62.80 	60日:44.23 	120日:26.30 	250日:10.41 		,当前价：8.11	,当前：2022-04-14 11:23:43
        zhiYao_jiYinCeXu.put("002584", "西陇科学");//274	电子化学品   3.45	50.91	0.33	价格区间: 5日:38.02 	10日:14.74 	20日:13.33 	30日:12.92 	60日:10.53 	120日:39.14 	250日:40.82 		,当前价：8.7	,当前：2022-04-14 11:23:44
        zhiYao_jiYinCeXu.put("000982", "中银绒业");//259	纺织服装     -0.47	90.78	0.66	价格区间: 5日:6.67  	10日:3.57  	20日:2.27  	30日:1.01  	60日:0.66  	120日:0.49  	250日:28.67 		,当前价：2.13	,当前：2022-04-14 11:23:46
        zhiYao_jiYinCeXu.put("000710", "贝瑞基因");//258	医疗器械     6.91	64.15	14.57	价格区间: 5日:92.21 	10日:92.21 	20日:75.05 	30日:70.72 	60日:50.71 	120日:36.60 	250日:16.43 		,当前价：18.09	,当前：2022-04-14 11:23:47
        zhiYao_jiYinCeXu.put("600645", "中源协和");//248	生物制品     2.83	108.80	2.29	价格区间: 5日:97.11 	10日:63.51 	20日:63.51 	30日:52.81 	60日:31.46 	120日:42.15 	250日:52.64 		,当前价：23.25	,当前：2022-04-14 11:23:48
    }
    /**
     * zhongYao_yiMiaoLengLian ["疫苗冷链"]：14;
     */
    public static Map<String, String> zhongYao_yiMiaoLengLian = new HashMap<>();

    static {
        zhongYao_yiMiaoLengLian.put("002639", "雪人股份");//369	通用设备     5.76	99.36	2.49	价格区间: 5日:80.00 	10日:81.28 	20日:63.36 	30日:63.36 	60日:40.18 	120日:50.52 	250日:54.75 		,当前价：12.86	,当前：2022-04-12 13:36:02
        zhongYao_yiMiaoLengLian.put("000519", "中兵红箭");//351	专用设备     -1.86	286.73	1.04	价格区间: 5日:32.27 	10日:32.14 	20日:57.42 	30日:59.73 	60日:59.28 	120日:27.14 	250日:53.94 		,当前价：20.59	,当前：2022-04-12 13:36:03
        zhongYao_yiMiaoLengLian.put("000811", "冰轮环境");//287	通用设备     -4   	77.05	1.92	价格区间: 5日:45.93 	10日:40.31 	20日:25.40 	30日:25.08 	60日:13.44 	120日:12.50 	250日:38.19 		,当前价：10.33	,当前：2022-04-12 13:36:04
        zhongYao_yiMiaoLengLian.put("002589", "瑞康医药");//274	医药商业     0.45	67.56	1.77	价格区间: 5日:3.93  	10日:16.35 	20日:26.17 	30日:29.49 	60日:30.16 	120日:34.91 	250日:34.91 		,当前价：4.49	,当前：2022-04-12 13:36:06
        zhongYao_yiMiaoLengLian.put("000963", "华东医药");//227	化学制药     3.14	546.47	1.84	价格区间: 5日:48.99 	10日:48.99 	20日:35.14 	30日:20.55 	60日:14.38 	120日:13.77 	250日:14.84 		,当前价：31.23	,当前：2022-04-12 13:36:07
    }

    /**
     * zhongYao_weiShengSu ["维生素"]：14;
     */
    public static Map<String, String> zhiYao_weiShengSu = new HashMap<>();

    static {
        zhiYao_weiShengSu.put("000999", "华润三九");//274	中药         -0.05	370.61	1.75	价格区间: 5日:35.29 	10日:15.56 	20日:27.62 	30日:40.78 	60日:40.78 	120日:60.79 	250日:61.60 		,当前价：37.86	,当前：2022-04-15 11:45:49
        zhiYao_weiShengSu.put("000915", "华特达因");//262	化学制药     10.01	81.92	23.87	价格区间: 5日:100.00	10日:87.04 	20日:80.42 	30日:75.53 	60日:74.29 	120日:84.86 	250日:86.33 		,当前价：34.96	,当前：2022-04-15 11:45:51
        zhiYao_weiShengSu.put("603067", "振华股份");//243	化学原料     4.77	58.11	3.12	价格区间: 5日:72.97 	10日:65.32 	20日:41.12 	30日:25.47 	60日:24.13 	120日:29.89 	250日:59.95 		,当前价：11.43	,当前：2022-04-15 11:45:52
    }

    /**
     * zhiYao 制药：
     */
    public static Map<String, String> zhiYao = new HashMap<>();

    static {
        zhiYao.putAll(zhiYao_ganSuGaiNian);//肝素概念
        zhiYao.putAll(zhiYao_ganYan);
        zhiYao.putAll(zhiYao_aZiHaiMo);//阿兹海默
        zhiYao.putAll(zhiYao_diSaiMiSong);//地塞米松
        zhiYao.putAll(zhongYao_yiMiaoLengLian);//疫苗冷链
        zhiYao.putAll(zhiYao_jiYinCeXu);//基因测序
        zhiYao.putAll(zhiYao_weiShengSu);//维生素
    }

    /**
     * chaoJiZhenJun ["超级真菌"]：11;
     */
    public static Map<String, String> chaoJiZhenJun = new HashMap<>();

    static {
        chaoJiZhenJun.put("002435", "长江健康");//372	化学制药	-1.55	86.52	0.95	价格区间: 5日:26.71 	10日:12.62 	20日:48.77 	30日:52.38 	60日:53.37 	120日:53.37 	250日:53.37 		,当前价：7.0	,当前：2022-03-24 11:02:11
        chaoJiZhenJun.put("002581", "未名医药");//320	生物制品	-0.51	116.64	0.96	价格区间: 5日:57.50 	10日:47.54 	20日:60.98 	30日:60.98 	60日:33.24 	120日:37.04 	250日:55.90 		,当前价：17.68	,当前：2022-03-24 11:02:12
        chaoJiZhenJun.put("600521", "华海药业");//295	化学制药	-0.67	332.66	0.65	价格区间: 5日:9.95  	10日:7.18  	20日:24.10 	30日:38.01 	60日:38.01 	120日:51.91 	250日:56.74 		,当前价：22.3	,当前：2022-03-24 11:02:14
    }

    /**
     * ["新冠药物"]：9;
     */
    public static Map<String, String> xinGuan_xinGuanYaoWu = new HashMap<>();

    static {
        xinGuan_xinGuanYaoWu.put("002349", "精华制药");//336	中药         4.97	118.71	3.76	价格区间: 5日:92.79 	10日:59.12 	20日:28.72 	30日:17.57 	60日:20.91 	净利环增:106.98;净利同增:17.96;营收环增:5.11;营收同增:22.19;
        xinGuan_xinGuanYaoWu.put("600056", "中国医药");//291	医药商业     4.49	236.14	2.31	价格区间: 5日:100.00	10日:74.10 	20日:26.18 	30日:17.07 	60日:38.08 	净利环增:230.45;净利同增:15.51;营收环增:-10.38;营收同增:-0.61;
        xinGuan_xinGuanYaoWu.put("002603", "以岭药业");//287	中药         2.01	424.36	1.47	价格区间: 5日:64.60 	10日:21.26 	20日:11.22 	30日:11.22 	60日:24.26 	净利环增:302.96;净利同增:-28.22;营收环增:35.74;营收同增:-25.80;
        xinGuan_xinGuanYaoWu.put("603538", "美诺华  ");//239	化学制药     -0.07	69.60	1.32	价格区间: 5日:68.75 	10日:46.93 	20日:19.64 	30日:13.68 	60日:31.85 	净利环增:1515.47;净利同增:128.94;营收环增:47.36;营收同增:47.86;
        xinGuan_xinGuanYaoWu.put("000915", "华特达因");//215	化学制药     5.39	82.41	1.71	价格区间: 5日:95.15 	10日:79.92 	20日:80.88 	30日:80.88 	60日:82.57 	净利环增:153.38;净利同增:43.18;营收环增:33.16;营收同增:23.74;
        xinGuan_xinGuanYaoWu.put("600196", "复星医药");//200	化学制药     -2.02	1079.24	1.59	价格区间: 5日:63.79 	10日:50.44 	20日:19.63 	30日:17.94 	60日:26.69 	净利环增:-60.49;净利同增:-45.41;营收环增:-13.17;营收同增:28.87;
        xinGuan_xinGuanYaoWu.put("002326", "永太科技");//196	化学制品     0.83	222.74	1.6 	价格区间: 5日:97.07 	10日:39.02 	20日:20.38 	30日:18.79 	60日:18.79 	净利环增:509.66;净利同增:434.67;营收环增:45.26;营收同增:103.75;
    }

    /**
     * mapYiLiaoXinGuanJianCe 概念：["新冠检测"]：16;
     */
    public static Map<String, String> xinGuan_xinGuanJianCe = new HashMap<>();

    static {
        xinGuan_xinGuanJianCe.put("002432", "九安医疗");//381	医疗器械     -0.82	385.16	2.48	价格区间: 5日:77.69 	10日:62.89 	20日:50.51 	30日:56.21 	60日:64.36 	净利环增:1567.05;净利同增:37527.35;营收环增:1252.94;营收同增:6646.79;
        xinGuan_xinGuanJianCe.put("002932", "明德生物");//276	医疗器械     3.99	123.02	1.94	价格区间: 5日:54.10 	10日:36.43 	20日:57.63 	30日:65.53 	60日:74.29 	净利环增:240.63;净利同增:307.05;营收环增:178.99;营收同增:267.41;
        xinGuan_xinGuanJianCe.put("603222", "济民医疗");//235	化学制药     4.39	52.64	1.99	价格区间: 5日:92.34 	10日:29.97 	20日:29.97 	30日:29.97 	60日:29.97 	净利环增:2764.61;净利同增:76.94;营收环增:-8.47;营收同增:12.50;
        xinGuan_xinGuanJianCe.put("603387", "基蛋生物");//210	医疗器械     5.23	68.03	2.24	价格区间: 5日:97.79 	10日:98.04 	20日:65.57 	30日:54.95 	60日:48.66 	净利环增:49.94;净利同增:249.06;营收环增:19.01;营收同增:106.80;
        xinGuan_xinGuanJianCe.put("603392", "万泰生物");//206	医疗器械     1.83	1446.62	2.06	价格区间: 5日:69.34 	10日:32.61 	20日:28.82 	30日:28.82 	60日:42.16 	净利环增:59.72;净利同增:360.18;营收环增:47.20;营收同增:284.85;
        xinGuan_xinGuanJianCe.put("600196", "复星医药");//200	化学制药     -2.02	1079.24	1.59	价格区间: 5日:63.79 	10日:50.44 	20日:19.63 	30日:17.84 	60日:26.60 	净利环增:-60.49;净利同增:-45.41;营收环增:-13.17;营收同增:28.87;
    }

    /**
     * tiWaiZhenDuan ["体外诊断"]：19;
     */
    public static Map<String, String> xinGuan_tiWaiZhenDuan = new HashMap<>();

    static {
        xinGuan_tiWaiZhenDuan.put("002432", "九安医疗");//391	医疗器械     2.7 	398.83	2.48	价格区间: 5日:91.04 	10日:79.84 	20日:57.14 	30日:62.08 	60日:69.14 	净利环增:1567.05;净利同增:37527.35;营收环增:1252.94;营收同增:6646.79;
        xinGuan_tiWaiZhenDuan.put("002932", "明德生物");//281	医疗器械     5.85	125.22	1.94	价格区间: 5日:67.41 	10日:45.56 	20日:63.71 	30日:70.48 	60日:77.98 	净利环增:240.63;净利同增:307.05;营收环增:178.99;营收同增:267.41;
        xinGuan_tiWaiZhenDuan.put("603222", "济民医疗");//235	化学制药     4.19	52.54	1.99	价格区间: 5日:94.26 	10日:30.59 	20日:30.59 	30日:30.59 	60日:30.59 	净利环增:2764.61;净利同增:76.94;营收环增:-8.47;营收同增:12.50;
        xinGuan_tiWaiZhenDuan.put("603122", "合富中国");//224	医疗器械     10   	52.98	2.44	价格区间: 5日:100.00	10日:45.66 	20日:27.03 	30日:13.93 	60日:37.23 	净利环增:-42.71;净利同增:7.24;营收环增:5.49;营收同增:19.67;
        xinGuan_tiWaiZhenDuan.put("603882", "金域医学");//223	医疗服务     9.58	415.11	3.03	价格区间: 5日:97.66 	10日:97.66 	20日:97.66 	30日:97.66 	60日:97.66 	净利环增:55.31;净利同增:58.00;营收环增:27.82;营收同增:58.70;
        xinGuan_tiWaiZhenDuan.put("603387", "基蛋生物");//210	医疗器械     5.74	68.36	2.24	价格区间: 5日:97.57 	10日:97.57 	20日:65.90 	30日:55.22 	60日:48.91 	净利环增:49.94;净利同增:249.06;营收环增:19.01;营收同增:106.80;
        xinGuan_tiWaiZhenDuan.put("603392", "万泰生物");//206	医疗器械     1.92	1447.94	2.06	价格区间: 5日:68.87 	10日:32.39 	20日:28.63 	30日:28.63 	60日:42.00 	净利环增:59.72;净利同增:360.18;营收环增:47.20;营收同增:284.85;
    }

    /**
     * changShouYao ["长寿药"]：7;
     */
    public static Map<String, String> zhongYao_changShouYao = new HashMap<>();

    static {
        zhongYao_changShouYao.put("600062", "华润双鹤");//341	化学制药     10   	259.45	0.87	价格区间: 5日:59.08 	10日:76.16 	20日:80.42 	30日:83.52 	60日:83.52 	120日:83.56 	250日:83.86 		,当前价：24.87	,当前：2022-04-25 23:53:28
        zhongYao_changShouYao.put("002317", "众生药业");//268	中药         -3.68	115.08	0.89	价格区间: 5日:15.72 	10日:15.33 	20日:13.50 	30日:30.08 	60日:45.86 	120日:53.63 	250日:54.32 		,当前价：14.13	,当前：2022-04-25 23:53:29
        zhongYao_changShouYao.put("002562", "兄弟科技");//189	化学制品     -8.68	51.44	0.79	价格区间: 5日:2.65  	10日:2.65  	20日:2.65  	30日:31.25 	60日:31.25 	120日:43.65 	250日:55.95 		,当前价：4.84	,当前：2022-04-25 23:53:31
        zhongYao_changShouYao.put("000639", "西王食品");//186	食品饮料     10.1	58.83	1.2 	价格区间: 5日:93.22 	10日:90.16 	20日:44.72 	30日:62.73 	60日:62.73 	120日:62.73 	250日:59.23 		,当前价：5.45	,当前：2022-04-25 23:53:32
        zhongYao_changShouYao.put("002038", "双鹭药业");//165	生物制品     8.02	102.43	5.61	价格区间: 5日:85.00 	10日:85.00 	20日:49.04 	30日:49.04 	60日:49.04 	120日:38.20 	250日:25.89 		,当前价：9.97	,当前：2022-04-25 23:53:33
    }

    /**
     * xinGuan 医疗-新冠-汇总:概念：["新冠药物","新冠检测","体外诊断"];股票个数：29;
     */
    public static Map<String, String> xinGuan = new HashMap<>();

    static {
        xinGuan.putAll(xinGuan_xinGuanYaoWu);//新冠药物
        xinGuan.putAll(xinGuan_xinGuanJianCe);//新冠检测
        xinGuan.putAll(xinGuan_tiWaiZhenDuan);//体外诊断
    }

    /**
     * chuangXinYao 创新药：CRO,青蒿素,CAR-T细胞疗法
     */
    public static Map<String, String> chuangXinYao = new HashMap<>();

    static {
        chuangXinYao.putAll(chuangXinYao_qingGaoSu);//青蒿素
        chuangXinYao.putAll(chuangXinYao_cro);//CRO
        chuangXinYao.putAll(chuangXinYao_cart);//CAR-T细胞疗法
    }


    /**
     * zhongYao_liuGan ["流感"]：44;
     */
    public static Map<String, String> zhongYao_liuGan = new HashMap<>();

    static {
        zhongYao_liuGan.put("002349", "精华制药");//508	中药         7.94	153.88	14.42	价格区间: 5日:90.23 	10日:36.68 	20日:26.65 	30日:41.75 	60日:43.54 	120日:58.22 	250日:59.76 		,当前价：18.9	,当前：2022-04-15 11:23:31
        zhongYao_liuGan.put("002603", "以岭药业");//408	中药         -7.98	614.82	5.14	价格区间: 5日:12.20 	10日:51.51 	20日:59.92 	30日:70.72 	60日:72.72 	120日:77.43 	250日:77.43 		,当前价：36.8	,当前：2022-04-15 11:23:32
        zhongYao_liuGan.put("002317", "众生药业");//398	中药         10   	131.70	2.06	价格区间: 5日:100.00	10日:61.48 	20日:49.45 	30日:63.33 	60日:66.98 	120日:71.72 	250日:72.16 		,当前价：16.17	,当前：2022-04-15 11:23:33
        zhongYao_liuGan.put("600976", "健民集团");//358	中药         -4.95	70.69	2.05	价格区间: 5日:1.15  	10日:0.47  	20日:0.40  	30日:0.40  	60日:0.24  	120日:9.72  	250日:33.33 		,当前价：46.08	,当前：2022-04-15 11:23:35
        zhongYao_liuGan.put("600056", "中国医药");//357	医药商业     7.7 	306.23	2.7 	价格区间: 5日:77.64 	10日:13.79 	20日:13.79 	30日:49.45 	60日:52.63 	120日:52.63 	250日:52.63 		,当前价：28.66	,当前：2022-04-15 11:23:36
        zhongYao_liuGan.put("002411", "延安必康");//323	医药商业     -3.25	123.04	3.23	价格区间: 5日:2.67  	10日:1.55  	20日:0.84  	30日:0.84  	60日:9.43  	120日:3.98  	250日:26.83 		,当前价：8.03	,当前：2022-04-15 11:23:37
        zhongYao_liuGan.put("002435", "长江健康");//322	化学制药     1.54	73.54	3.01	价格区间: 5日:30.00 	10日:9.52  	20日:4.12  	30日:20.87 	60日:31.26 	120日:31.26 	250日:31.26 		,当前价：5.95	,当前：2022-04-15 11:23:38
        zhongYao_liuGan.put("600196", "复星医药");//319	化学制药     2.59	1219.94	2.5 	价格区间: 5日:34.10 	10日:18.26 	20日:16.85 	30日:46.72 	60日:46.72 	120日:46.72 	250日:18.66 		,当前价：47.6	,当前：2022-04-15 11:23:39
        zhongYao_liuGan.put("600129", "太极集团");//316	中药         0.87	109.60	1.31	价格区间: 5日:43.83 	10日:14.17 	20日:16.18 	30日:38.13 	60日:38.13 	120日:39.21 	250日:42.88 		,当前价：19.68	,当前：2022-04-15 11:23:40
    }

    /**
     * zhongYao_youMenLuoXuanGanJun ["幽门螺杆菌概念"]：17;
     */
    public static Map<String, String> zhongYao_youMenLuoXuanGanJun = new HashMap<>();

    static {
        zhongYao_youMenLuoXuanGanJun.put("605388", "均瑶健康");//298	食品饮料     0.51	85.23	3.26	价格区间: 5日:87.36 	10日:87.36 	20日:47.64 	30日:55.29 	60日:51.27 	120日:42.47 	250日:24.17 		,当前价：19.82	,当前：2022-04-15 11:30:06
        zhongYao_youMenLuoXuanGanJun.put("605199", "葫芦娃  ");//291	中药         -1.99	74.70	2.7 	价格区间: 5日:7.26  	10日:3.18  	20日:2.10  	30日:2.10  	60日:1.59  	120日:1.40  	250日:0.70  		,当前价：18.67	,当前：2022-04-15 11:30:08
        zhongYao_youMenLuoXuanGanJun.put("603392", "万泰生物");//289	医疗器械     2.54	1603.31	7.74	价格区间: 5日:26.53 	10日:26.53 	20日:37.83 	30日:52.10 	60日:70.90 	120日:72.72 	250日:73.28 		,当前价：264.12	,当前：2022-04-15 11:30:09
        zhongYao_youMenLuoXuanGanJun.put("002907", "华森制药");//279	中药         -0.65	55.07	3.71	价格区间: 5日:30.88 	10日:10.88 	20日:6.71  	30日:22.96 	60日:22.89 	120日:23.51 	250日:23.51 		,当前价：13.71	,当前：2022-04-15 11:30:10
        zhongYao_youMenLuoXuanGanJun.put("603222", "济民医疗");//274	化学制药     2.87	63.51	3.48	价格区间: 5日:94.16 	10日:80.13 	20日:80.13 	30日:86.33 	60日:53.82 	120日:57.28 	250日:60.65 		,当前价：18.64	,当前：2022-04-15 11:30:11
    }
    /**
     * zhongYao 中药：中药概念,长寿药,独家药品
     */
    public static Map<String, String> zhongYao = new HashMap<>();

    static {
        zhongYao.putAll(zhongYao_changShouYao);//长寿药
        zhongYao.putAll(zhongYao_zhongYaoGaiNian);//中药概念
        zhongYao.putAll(zhongYao_duJiaYaoPin);//独家药品
        zhongYao.putAll(zhongYao_liuGan);//流感
        zhongYao.putAll(zhongYao_youMenLuoXuanGanJun);//幽门螺杆菌概念
    }





    /**
     * yiMei 医疗美容:毛发医疗
     */
    public static Map<String, String> yiMei = new HashMap<>();

    static {
        yiMei.putAll(yiMei_maoFaYiLiao);//毛发医疗
    }

    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(xinGuan);//医疗-新冠
        all.putAll(chuangXinYao);//医疗-创新药
        all.putAll(zhongYao);//医疗-中药
        all.putAll(zhiYao);//制药
        all.putAll(yiMei);//医疗美容:毛发医疗

        all.putAll(chaoJiZhenJun);//超级真菌

    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStat.checkMaDemo(ContMapStYiLiao.all, date);
//        StockStat.checkMaDemo(ContMapStYiLiao.zhiYao, date);
//        StockStat.checkMaDemo(ContMapStYiLiao.xinGuan, date);
//        StockStat.checkMaDemo(ContMapStYiLiao.chuangXinYao, date);
    }
}
