package utils;

import ttjj.stat.StBizStatDemo;
import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：金融
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStJinRong {

    /**
     * quanShangGaiNian 概念：["券商概念"];股票个数：51;
     */
    public static Map<String, String> quanShangGaiNian = new HashMap<>();

    static {
        quanShangGaiNian.put("002945", "华林证券");//270	证券    	-0.55	389.61	1.34	价格区间: 5日:21.01 	10日:7.31  	20日:7.07  	30日:11.80 	60日:32.97 	120日:46.77 	250日:46.77 		,当前价：14.43	,当前：2022-04-01 13:41:07
        quanShangGaiNian.put("600906", "财达证券");//245	证券    	1.19	358.57	1.32	价格区间: 5日:64.62 	10日:32.56 	20日:28.04 	30日:28.04 	60日:22.81 	120日:17.75 	250日:46.01 		,当前价：11.05	,当前：2022-04-01 13:41:09
        quanShangGaiNian.put("600958", "东方证券");//215	证券    	1.55	779.79	1.39	价格区间: 5日:85.90 	10日:85.90 	20日:62.16 	30日:37.40 	60日:18.59 	120日:13.63 	250日:24.93 		,当前价：11.15	,当前：2022-04-01 13:41:10
        quanShangGaiNian.put("000776", "广发证券");//212	证券    	2.05	1367.22	2.61	价格区间: 5日:68.64 	10日:68.64 	20日:79.22 	30日:60.84 	60日:21.72 	120日:17.78 	250日:29.08 		,当前价：17.94	,当前：2022-04-01 13:41:11
        quanShangGaiNian.put("002939", "长城证券");//196	证券    	1.16	298.86	1.46	价格区间: 5日:86.96 	10日:57.14 	20日:28.78 	30日:19.14 	60日:9.83  	120日:7.52  	250日:10.05 		,当前价：9.63	,当前：2022-04-01 13:41:13
        quanShangGaiNian.put("601456", "国联证券");//195	证券    	0.08	374.08	1.26	价格区间: 5日:40.00 	10日:40.87 	20日:27.32 	30日:16.21 	60日:12.77 	120日:26.27 	250日:21.54 		,当前价：13.21	,当前：2022-04-01 13:41:14
        quanShangGaiNian.put("601696", "中银证券");//190	证券    	5.67	393.36	3.55	价格区间: 5日:85.89 	10日:85.89 	20日:80.65 	30日:80.65 	60日:80.65 	120日:76.81 	250日:32.15 		,当前价：14.16	,当前：2022-04-01 13:41:15
        quanShangGaiNian.put("601995", "中金公司");//186	证券    	1.85	2045.79	2.37	价格区间: 5日:89.32 	10日:89.32 	20日:69.63 	30日:69.63 	60日:45.73 	120日:28.91 	250日:21.39 		,当前价：42.38	,当前：2022-04-01 13:41:16
    }

    /**
     * jianZhuJieNeng ["建筑节能"]：6;
     */
    public static Map<String, String> jianZhuJieNeng = new HashMap<>();

    static {
        jianZhuJieNeng.put("002761", "浙江建投");//465	工程建设	-4.58	409.61	10.56	价格区间: 5日:67.55 	10日:83.76 	20日:86.13 	30日:89.10 	60日:89.23 	120日:89.28 	250日:89.32 		,当前价：37.88	,当前：2022-03-22 11:00:58
        jianZhuJieNeng.put("002810", "山东赫达");//263	化学制品	-2.39	145.29	1.42	价格区间: 5日:24.54 	10日:15.54 	20日:7.84  	30日:7.84  	60日:5.61  	120日:19.41 	250日:35.45 		,当前价：42.41	,当前：2022-03-22 11:00:59
        jianZhuJieNeng.put("000517", "荣安地产");//237	房地产开发	7.4 	106.34	66.03	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：3.34	,当前：2022-03-22 11:01:00
        jianZhuJieNeng.put("600586", "金晶科技");//235	玻璃玻纤	-0.95	118.59	3.11	价格区间: 5日:82.14 	10日:82.14 	20日:62.84 	30日:52.04 	60日:51.80 	120日:20.43 	250日:28.61 		,当前价：8.3	,当前：2022-03-22 11:01:01
    }

    /**
     * fangDiChan_zuShouTongQuan ["租售同权"]：14;
     */
    public static Map<String, String> fangDiChan_zuShouTongQuan = new HashMap<>();

    static {
        fangDiChan_zuShouTongQuan.put("000671", "阳光城  ");//339	房地产开发	0.78	159.82	1.6 	价格区间: 5日:80.00 	10日:84.86 	20日:84.86 	30日:84.86 	60日:84.86 	120日:77.08 	250日:45.01 		,当前价：3.86	,当前：2022-03-27 13:54:12
        fangDiChan_zuShouTongQuan.put("000732", "泰禾集团");//311	房地产开发	0.71	70.93	0.71	价格区间: 5日:32.73 	10日:49.32 	20日:49.32 	30日:32.73 	60日:48.97 	120日:58.43 	250日:58.43 		,当前价：2.85	,当前：2022-03-27 13:54:14
        fangDiChan_zuShouTongQuan.put("002285", "世联行  ");//311	房地产服务	9.95	89.88	1.98	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:97.48 	250日:27.34 		,当前价：4.42	,当前：2022-03-27 13:54:15
        fangDiChan_zuShouTongQuan.put("000056", "皇庭国际");//310	房地产服务	0.97	85.98	0.74	价格区间: 5日:75.82 	10日:88.04 	20日:45.00 	30日:45.00 	60日:62.00 	120日:69.30 	250日:70.54 		,当前价：7.32	,当前：2022-03-27 13:54:16
        fangDiChan_zuShouTongQuan.put("600048", "保利发展");//252	房地产开发	-1.76	2007.42	0.65	价格区间: 5日:41.10 	10日:78.55 	20日:78.55 	30日:78.55 	60日:78.55 	120日:84.64 	250日:90.00 		,当前价：16.77	,当前：2022-03-27 13:54:17
        fangDiChan_zuShouTongQuan.put("002244", "滨江集团");//231	房地产开发	-0.74	210.02	0.46	价格区间: 5日:28.57 	10日:78.66 	20日:78.66 	30日:78.66 	60日:86.94 	120日:89.16 	250日:89.49 		,当前价：6.75	,当前：2022-03-27 13:54:20
        fangDiChan_zuShouTongQuan.put("001979", "招商蛇口");//222	房地产开发	-0.97	1131.44	0.49	价格区间: 5日:61.08 	10日:76.08 	20日:73.87 	30日:73.87 	60日:73.87 	120日:85.89 	250日:86.66 		,当前价：14.28	,当前：2022-03-27 13:54:25
        fangDiChan_zuShouTongQuan.put("000560", "我爱我家");//207	房地产服务	2.08	81.03	0.68	价格区间: 5日:45.83 	10日:72.63 	20日:72.63 	30日:72.63 	60日:72.63 	120日:72.63 	250日:27.82 		,当前价：3.44	,当前：2022-03-27 13:54:27
        fangDiChan_zuShouTongQuan.put("000002", "万科Ａ  ");//198	房地产开发	-0.4	2023.98	0.59	价格区间: 5日:48.62 	10日:76.21 	20日:56.23 	30日:45.71 	60日:34.41 	120日:34.41 	250日:16.79 		,当前价：17.41	,当前：2022-03-27 13:54:33
    }

    /**
     * reits ["REITs概念"]：16;
     */
    public static Map<String, String> reits = new HashMap<>();

    static {
        reits.put("002059", "云南旅游");//318	旅游酒店	-2.59	68.64	5.07	价格区间: 5日:65.88 	10日:74.78 	20日:74.78 	30日:34.96 	60日:50.97 	120日:55.75 	250日:57.55 		,当前价：6.78	,当前：2022-03-22 10:56:13
        reits.put("600048", "保利发展");//259	房地产开发	3.18	2058.89	2.09	价格区间: 5日:95.42 	10日:95.42 	20日:88.72 	30日:88.72 	60日:88.72 	120日:91.94 	250日:94.76 		,当前价：17.2	,当前：2022-03-22 10:56:15
        reits.put("600466", "蓝光发展");//248	房地产开发	1.96	63.13	6.29	价格区间: 5日:96.08 	10日:96.08 	20日:96.08 	30日:90.74 	60日:32.67 	120日:33.11 	250日:17.30 		,当前价：2.08	,当前：2022-03-22 10:56:16
        reits.put("002285", "世联行  ");//245	房地产服务	4.91	73.82	11.16	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:59.12 	120日:59.12 	250日:16.58 		,当前价：3.63	,当前：2022-03-22 10:56:17
        reits.put("002314", "南山控股");//237	房地产开发	0.53	102.62	4.09	价格区间: 5日:100.00	10日:100.00	20日:93.94 	30日:31.79 	60日:38.71 	120日:46.80 	250日:46.80 		,当前价：3.79	,当前：2022-03-22 10:56:18
        reits.put("001979", "招商蛇口");//219	房地产开发	4   	1113.22	1.26	价格区间: 5日:93.45 	10日:71.10 	20日:69.03 	30日:69.03 	60日:69.03 	120日:83.28 	250日:84.18 		,当前价：14.05	,当前：2022-03-22 10:56:19
        reits.put("000002", "万科Ａ  ");//196	房地产开发	2.98	2011.19	1.92	价格区间: 5日:99.69 	10日:94.41 	20日:51.28 	30日:44.28 	60日:37.07 	120日:37.07 	250日:18.03 		,当前价：17.3	,当前：2022-03-22 10:56:20
    }



    /**
     * fangDiChan 房地产:租售同权,建筑节能
     */
    public static Map<String, String> fangDiChan = new HashMap<>();

    static {
        fangDiChan.putAll(fangDiChan_zuShouTongQuan);//租售同权
        fangDiChan.putAll(reits);
        fangDiChan.putAll(jianZhuJieNeng);//建筑节能
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(fangDiChan);//房地产
        all.putAll(quanShangGaiNian);//券商概念
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStJinRong.all, date);
//        StockStatDemo.checkMaDemo(ContMapStJinRong.fangDiChan_zuShouTongQuan, date);
//        StockStatDemo.checkMaDemo(ContMapStJinRong.quanShangGaiNian, date);
    }
}
