package utils;

import ttjj.service.KlineService;
import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：资源
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStZiYuan {

    /**
     * ["可燃冰"]：8;
     */
    public static Map<String, String> keRanBing = new HashMap<>();

    static {
        keRanBing.put("002353", "杰瑞股份");//268	专用设备	2.37	422.61	2.72	价格区间: 5日:52.18 	10日:51.24 	20日:51.24 	30日:51.24 	60日:55.05 	120日:43.37 	250日:60.53 		,当前价：44.12	,当前：2022-03-18 10:18:33
        keRanBing.put("600098", "广州发展");//211	电力行业	0.46	230.36	1.81	价格区间: 5日:61.04 	10日:42.73 	20日:38.84 	30日:26.55 	60日:15.56 	120日:13.43 	250日:23.29 		,当前价：6.5	,当前：2022-03-18 10:18:34
        keRanBing.put("601808", "中海油服");//202	采掘行业	2.56	650.85	4.1 	价格区间: 5日:53.01 	10日:24.91 	20日:22.72 	30日:22.72 	60日:22.72 	120日:22.72 	250日:28.16 		,当前价：13.64	,当前：2022-03-18 10:18:35
    }

    /**
     * ["油价相关"]：10;
     */
    public static Map<String, String> youJiaXiangGuan = new HashMap<>();
    static {
        youJiaXiangGuan.put("000822", "山东海化");//268	化学原料	0.61	59.43	2.89	价格区间: 5日:65.38 	10日:37.78 	20日:32.28 	30日:28.81 	60日:28.81 	120日:5.44  	250日:19.52 		,当前价：6.64	,当前：2022-03-18 10:22:47
        youJiaXiangGuan.put("600777", "新潮能源");//251	石油行业	3.03	138.73	5.36	价格区间: 5日:87.10 	10日:45.00 	20日:44.26 	30日:44.26 	60日:41.54 	120日:20.45 	250日:35.58 		,当前价：2.04	,当前：2022-03-18 10:22:49
        youJiaXiangGuan.put("601111", "中国国航");//207	航空机场	0.74	1391.48	2.86	价格区间: 5日:82.35 	10日:65.97 	20日:56.25 	30日:41.31 	60日:42.99 	120日:58.28 	250日:65.24 		,当前价：9.58	,当前：2022-03-18 10:22:51
        youJiaXiangGuan.put("601808", "中海油服");//202	采掘行业	2.56	650.85	4.1 	价格区间: 5日:50.60 	10日:23.77 	20日:21.69 	30日:21.69 	60日:21.69 	120日:21.69 	250日:27.20 		,当前价：13.64	,当前：2022-03-18 10:22:52
        youJiaXiangGuan.put("600115", "中国东航");//193	航空机场	3.33	1053.19	2.74	价格区间: 5日:95.24 	10日:81.63 	20日:64.52 	30日:57.14 	60日:60.00 	120日:63.19 	250日:69.54 		,当前价：5.58	,当前：2022-03-18 10:22:53
        youJiaXiangGuan.put("600688", "上海石化");//190	石油行业	1.42	386.41	3.83	价格区间: 5日:65.12 	10日:33.73 	20日:31.11 	30日:30.77 	60日:23.53 	120日:15.30 	250日:20.10 		,当前价：3.57	,当前：2022-03-18 10:22:54
        youJiaXiangGuan.put("601857", "中国石油");//189	石油行业	2.34	9608.60	6.15	价格区间: 5日:48.05 	10日:31.62 	20日:30.33 	30日:30.33 	60日:31.45 	120日:31.89 	250日:51.35 		,当前价：5.25	,当前：2022-03-18 10:22:55
    }

    /**
     * gangTie_diTanYeJin ["低碳冶金"]：9;
     */
    public static Map<String, String> gangTie_diTanYeJin = new HashMap<>();

    static {
        gangTie_diTanYeJin.put("600581", "八一钢铁");//346	钢铁行业     10.01	117.88	2.89	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:82.22 	250日:52.30 		,当前价：7.69	,当前：2022-04-08 14:16:10
        gangTie_diTanYeJin.put("000959", "首钢股份");//288	钢铁行业     4.27	395.57	1.24	价格区间: 5日:91.36 	10日:93.27 	20日:94.17 	30日:55.12 	60日:55.12 	120日:43.80 	250日:31.18 		,当前价：5.86	,当前：2022-04-08 14:16:11
        gangTie_diTanYeJin.put("000928", "中钢国际");//264	工程咨询服务 6.03	92.36	1.86	价格区间: 5日:76.40 	10日:76.40 	20日:80.56 	30日:55.41 	60日:27.19 	120日:21.75 	250日:18.81 		,当前价：7.21	,当前：2022-04-08 14:16:13
        gangTie_diTanYeJin.put("600307", "酒钢宏兴");//215	钢铁行业     1.74	146.56	1.75	价格区间: 5日:73.33 	10日:77.78 	20日:84.00 	30日:84.00 	60日:82.35 	120日:48.28 	250日:34.41 		,当前价：2.34	,当前：2022-04-08 14:16:14
        gangTie_diTanYeJin.put("601618", "中国中冶");//214	工程建设     3.98	812.37	2.27	价格区间: 5日:96.00 	10日:96.77 	20日:55.41 	30日:31.06 	60日:31.06 	120日:31.06 	250日:30.81 		,当前价：3.92	,当前：2022-04-08 14:16:15
        gangTie_diTanYeJin.put("002002", "鸿达兴业");//212	化学原料     -1.28	143.92	1.3 	价格区间: 5日:37.50 	10日:23.44 	20日:33.33 	30日:21.85 	60日:12.75 	120日:12.75 	250日:35.14 		,当前价：4.61	,当前：2022-04-08 14:16:16
        gangTie_diTanYeJin.put("600019", "宝钢股份");//194	钢铁行业     1.25	1623.37	1   	价格区间: 5日:86.96 	10日:90.22 	20日:93.33 	30日:78.26 	60日:66.32 	120日:65.63 	250日:22.11 		,当前价：7.29	,当前：2022-04-08 14:16:17
    }

    /**
     * jinShu_jiBenJinShu ["基本金属"]：37;
     */
    public static Map<String, String> jinShu_jiBenJinShu = new HashMap<>();

    static {
        jinShu_jiBenJinShu.put("002738", "中矿资源");//427	小金属  	-3.18	284.38	3.21	价格区间: 5日:7.38  	10日:4.87  	20日:4.29  	30日:3.01  	60日:56.05 	120日:58.96 	250日:72.54 		,当前价：87.32	,当前：2022-04-06 14:01:30
        jinShu_jiBenJinShu.put("600338", "西藏珠峰");//371	有色金属	-2.34	237.05	2.26	价格区间: 5日:9.02  	10日:4.73  	20日:4.09  	30日:2.18  	60日:1.86  	120日:1.57  	250日:38.95 		,当前价：25.93	,当前：2022-04-06 14:01:31
        jinShu_jiBenJinShu.put("600367", "红星发展");//340	化学原料	-5.58	69.50	3.75	价格区间: 5日:56.34 	10日:60.69 	20日:64.25 	30日:44.93 	60日:64.93 	120日:67.17 	250日:77.79 		,当前价：23.7	,当前：2022-04-06 14:01:32
        jinShu_jiBenJinShu.put("000807", "云铝股份");//340	有色金属	-1.78	460.20	3.5 	价格区间: 5日:30.29 	10日:30.29 	20日:40.97 	30日:35.43 	60日:45.06 	120日:48.40 	250日:29.26 		,当前价：13.27	,当前：2022-04-06 14:01:41
        jinShu_jiBenJinShu.put("603799", "华友钴业");//339	能源金属	-1.95	1169.12	2.1 	价格区间: 5日:21.34 	10日:19.28 	20日:31.76 	30日:25.35 	60日:25.35 	120日:17.71 	250日:38.17 		,当前价：95.72	,当前：2022-04-06 14:01:42
        jinShu_jiBenJinShu.put("601899", "紫金矿业");//204	贵金属  	1.14	3048.93	2.52	价格区间: 5日:58.62 	10日:68.82 	20日:88.45 	30日:77.89 	60日:78.05 	120日:78.05 	250日:66.67 		,当前价：11.58	,当前：2022-04-06 14:01:59

    }




    /**
     * meiTan_meiHuaGong ["煤化工"]：57;
     */
    public static Map<String, String> meiTan_meiHuaGong = new HashMap<>();

    static {
        meiTan_meiHuaGong.put("000422", "湖北宜化");//470	化学原料    	0.28	195.65	2.34	价格区间: 5日:83.64 	10日:91.11 	20日:93.41 	30日:90.43 	60日:91.06 	120日:29.47 	250日:58.07 		,当前价：21.79	,当前：2022-04-07 10:45:08
        meiTan_meiHuaGong.put("600096", "云天化  ");//458	化肥行业    	3.57	506.34	6.68	价格区间: 5日:96.15 	10日:97.55 	20日:97.96 	30日:97.45 	60日:98.70 	120日:75.72 	250日:68.96 		,当前价：27.58	,当前：2022-04-07 10:45:09
        meiTan_meiHuaGong.put("600188", "兖矿能源");//414	煤炭行业    	-0.87	1809.25	1.76	价格区间: 5日:39.79 	10日:36.13 	20日:66.06 	30日:68.47 	60日:79.92 	120日:80.63 	250日:87.36 		,当前价：36.56	,当前：2022-04-07 10:45:11
        meiTan_meiHuaGong.put("600277", "亿利洁能");//394	化学原料    	-2.28	213.99	2.23	价格区间: 5日:27.78 	10日:11.92 	20日:7.41  	30日:25.08 	60日:42.12 	120日:55.20 	250日:62.60 		,当前价：6.01	,当前：2022-04-07 10:45:12
        meiTan_meiHuaGong.put("601101", "昊华能源");//390	煤炭行业    	-0.94	126.12	1.57	价格区间: 5日:59.00 	10日:55.66 	20日:81.50 	30日:84.98 	60日:87.92 	120日:49.93 	250日:66.89 		,当前价：10.51	,当前：2022-04-07 10:45:13
        meiTan_meiHuaGong.put("000933", "神火股份");//363	有色金属    	-0.86	311.31	2.26	价格区间: 5日:50.00 	10日:26.11 	20日:71.27 	30日:70.51 	60日:78.18 	120日:80.87 	250日:58.66 		,当前价：13.83	,当前：2022-04-07 10:45:14
    }


    /**
     * qingNengYuan ["氢能源"]：91;
     */
    public static Map<String, String> qiTi_qingNengYuan = new HashMap<>();

    static {
        qiTi_qingNengYuan.put("002537", "海联金汇");//437	汽车零部件	1.29	138.42	2.39	价格区间: 5日:33.79 	10日:32.95 	20日:65.75 	30日:69.51 	60日:72.57 	120日:78.66 	250日:78.89 		,当前价：11.79	,当前：2022-04-06 14:34:18
        qiTi_qingNengYuan.put("600277", "亿利洁能");//402	化学原料	2.51	218.27	3.73	价格区间: 5日:58.33 	10日:19.21 	20日:11.93 	30日:28.43 	60日:44.70 	120日:57.20 	250日:64.27 		,当前价：6.13	,当前：2022-04-06 14:34:20
        qiTi_qingNengYuan.put("000980", "*ST众泰 ");//392	汽车整车	1.28	200.74	2.38	价格区间: 5日:61.76 	10日:69.23 	20日:62.96 	30日:38.06 	60日:14.33 	120日:7.85  	250日:11.91 		,当前价：3.96	,当前：2022-04-06 14:34:20
        qiTi_qingNengYuan.put("600860", "京城股份");//378	通用设备	2.67	97.05	2.55	价格区间: 5日:100.00	10日:44.51 	20日:60.97 	30日:61.94 	60日:59.88 	120日:67.92 	250日:69.51 		,当前价：20.01	,当前：2022-04-06 14:34:22
        qiTi_qingNengYuan.put("603938", "三孚股份");//364	化肥行业	-0.9	96.69	1.81	价格区间: 5日:10.24 	10日:45.90 	20日:63.07 	30日:68.71 	60日:75.89 	120日:68.80 	250日:45.12 		,当前价：49.53	,当前：2022-04-06 14:34:23
        qiTi_qingNengYuan.put("002060", "粤水电  ");//356	工程建设	4.29	114.09	3.68	价格区间: 5日:82.23 	10日:86.77 	20日:91.42 	30日:91.70 	60日:92.18 	120日:92.28 	250日:93.78 		,当前价：9.49	,当前：2022-04-06 14:34:24
        qiTi_qingNengYuan.put("600141", "兴发集团");//347	化肥行业	-0.09	371.98	1.61	价格区间: 5日:11.59 	10日:14.81 	20日:9.00  	30日:6.33  	60日:29.81 	120日:14.80 	250日:44.68 		,当前价：33.46	,当前：2022-04-06 14:34:25
        qiTi_qingNengYuan.put("600032", "浙江新能");//341	电力行业	-1   	289.54	1.63	价格区间: 5日:28.31 	10日:34.68 	20日:56.01 	30日:56.01 	60日:56.01 	120日:36.38 	250日:62.56 		,当前价：13.92	,当前：2022-04-06 14:34:26
        qiTi_qingNengYuan.put("002639", "雪人股份");//332	通用设备	2.99	87.92	2   	价格区间: 5日:91.96 	10日:26.75 	20日:50.09 	30日:50.09 	60日:30.59 	120日:43.98 	250日:48.84 		,当前价：11.38	,当前：2022-04-06 14:34:27
    }
    /**
     * qiTi_haiQi ["氦气概念"]：3;
     */
    public static Map<String, String> qiTi_haiQi = new HashMap<>();

    static {
        qiTi_haiQi.put("002639", "雪人股份");//343	通用设备     0.74	94.64	9.09	价格区间: 5日:85.10 	10日:45.97 	20日:63.19 	30日:63.19 	60日:38.59 	120日:50.44 	250日:54.67 		,当前价：12.25	,当前：2022-04-07 13:46:08
        qiTi_haiQi.put("002549", "凯美特气");//289	化学制品     -3.54	96.80	2.7 	价格区间: 5日:26.72 	10日:13.89 	20日:37.03 	30日:31.05 	60日:36.34 	120日:54.40 	250日:71.55 		,当前价：15.52	,当前：2022-04-07 13:46:09
        qiTi_haiQi.put("002430", "杭氧股份");//223	专用设备     -2.24	270.29	1.12	价格区间: 5日:1.27  	10日:0.95  	20日:40.98 	30日:40.98 	60日:30.32 	120日:41.27 	250日:21.74 		,当前价：27.5	,当前：2022-04-07 13:46:11
    }

    /**
     * huaGong_huaGongYuanLiao ["化工原料"]：44;
     */
    public static Map<String, String> huaGong_huaGongYuanLiao = new HashMap<>();

    static {
        huaGong_huaGongYuanLiao.put("000422", "湖北宜化");//509	化学原料     9.93	224.65	2.57	价格区间: 5日:98.81 	10日:99.13 	20日:99.23 	30日:99.28 	60日:99.31 	120日:46.30 	250日:67.94 		,当前价：25.02	,当前：2022-04-08 11:48:39
        huaGong_huaGongYuanLiao.put("600096", "云天化  ");//478	化肥行业     8.76	551.50	2.21	价格区间: 5日:94.36 	10日:95.45 	20日:96.01 	30日:96.29 	60日:97.81 	120日:89.39 	250日:75.66 		,当前价：30.04	,当前：2022-04-08 11:48:40
        huaGong_huaGongYuanLiao.put("000683", "远兴能源");//391	化学原料     1.83	367.71	1.1 	价格区间: 5日:81.82 	10日:78.40 	20日:88.56 	30日:88.56 	60日:89.51 	120日:92.46 	250日:68.66 		,当前价：10.01	,当前：2022-04-08 11:48:42
        huaGong_huaGongYuanLiao.put("600141", "兴发集团");//382	化肥行业     10   	414.56	3.77	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:52.54 	60日:64.44 	120日:31.99 	250日:53.67 		,当前价：37.29	,当前：2022-04-08 11:48:43
        huaGong_huaGongYuanLiao.put("600389", "江山股份");//354	农药兽药     6.54	144.19	2.4 	价格区间: 5日:96.77 	10日:97.62 	20日:98.81 	30日:98.81 	60日:94.06 	120日:94.84 	250日:63.81 		,当前价：48.55	,当前：2022-04-08 11:48:44
        huaGong_huaGongYuanLiao.put("600596", "新安股份");//333	农药兽药     4.99	232.34	2.3 	价格区间: 5日:99.23 	10日:76.95 	20日:85.16 	30日:85.09 	60日:90.13 	120日:54.56 	250日:47.13 		,当前价：28.39	,当前：2022-04-08 11:48:45
    }

    /**
     * huaGong_taiBaiFen ["钛白粉"]：8;
     */
    public static Map<String, String> huaGong_taiBaiFen = new HashMap<>();

    static {
        huaGong_taiBaiFen.put("002386", "天原股份");//260	化学原料     3.15	81.76	1.64	价格区间: 5日:51.69 	10日:54.26 	20日:66.41 	30日:29.93 	60日:27.07 	120日:18.16 	250日:34.59 		,当前价：10.47	,当前：2022-04-08 12:23:24
        huaGong_taiBaiFen.put("603826", "坤彩科技");//240	非金属材料   2.04	325.96	1.97	价格区间: 5日:73.72 	10日:78.46 	20日:83.10 	30日:83.10 	60日:88.04 	120日:88.20 	250日:89.17 		,当前价：69.65	,当前：2022-04-08 12:23:25
        huaGong_taiBaiFen.put("603067", "振华股份");//231	化学原料     2.01	56.89	1.37	价格区间: 5日:36.46 	10日:23.97 	20日:25.56 	30日:12.47 	60日:22.73 	120日:25.84 	250日:57.64 		,当前价：11.19	,当前：2022-04-08 12:23:26
        huaGong_taiBaiFen.put("600727", "鲁北化工");//226	化学原料     5.49	54.81	2.96	价格区间: 5日:88.60 	10日:91.28 	20日:92.49 	30日:81.22 	60日:73.06 	120日:37.04 	250日:37.34 		,当前价：10.37	,当前：2022-04-08 12:23:27
        huaGong_taiBaiFen.put("000629", "攀钢钒钛");//216	钢铁行业     1.59	329.50	2.53	价格区间: 5日:70.97 	10日:70.97 	20日:61.82 	30日:40.00 	60日:36.17 	120日:44.83 	250日:57.43 		,当前价：3.83	,当前：2022-04-08 12:23:28
    }

    /**
     * huaGong_youJiGui ["有机硅"]：11;
     */
    public static Map<String, String> huaGong_youJiGui = new HashMap<>();

    static {
        huaGong_youJiGui.put("603938", "三孚股份");//383	化肥行业     2.38	104.97	1.57	价格区间: 5日:88.16 	10日:92.86 	20日:95.13 	30日:95.40 	60日:96.82 	120日:87.77 	250日:52.51 		,当前价：53.77	,当前：2022-04-08 12:27:44
        huaGong_youJiGui.put("600141", "兴发集团");//382	化肥行业     10   	414.56	3.77	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:52.54 	60日:64.44 	120日:31.99 	250日:53.67 		,当前价：37.29	,当前：2022-04-08 12:27:45
        huaGong_youJiGui.put("600596", "新安股份");//333	农药兽药     4.99	232.34	2.3 	价格区间: 5日:99.23 	10日:76.95 	20日:85.16 	30日:85.09 	60日:90.13 	120日:54.56 	250日:47.13 		,当前价：28.39	,当前：2022-04-08 12:27:46
        huaGong_youJiGui.put("002709", "天赐材料");//306	化学制品     -0.56	876.40	1.02	价格区间: 5日:12.11 	10日:8.59  	20日:5.62  	30日:30.73 	60日:30.73 	120日:8.94  	250日:35.51 		,当前价：91.05	,当前：2022-04-08 12:27:47
        huaGong_youJiGui.put("603260", "合盛硅业");//292	非金属材料   1.16	1053.33	1.42	价格区间: 5日:21.20 	10日:8.69  	20日:6.24  	30日:4.96  	60日:4.96  	120日:3.13  	250日:25.75 		,当前价：98.06	,当前：2022-04-08 12:27:48
    }

    /**
     * huaGong_foHuaGong ["氟化工"]：21;
     */
    public static Map<String, String> huaGong_foHuaGong = new HashMap<>();

    static {
        huaGong_foHuaGong.put("600096", "云天化  ");//464	化肥行业     6.08	518.64	6.68	价格区间: 5日:89.25 	10日:92.71 	20日:93.84 	30日:93.84 	60日:96.69 	120日:78.05 	250日:70.11 		,当前价：28.25	,当前：2022-04-07 11:36:33
        huaGong_foHuaGong.put("002326", "永太科技");//455	化学制品     0.16	323.98	1.48	价格区间: 5日:15.81 	10日:33.07 	20日:64.07 	30日:64.07 	60日:44.16 	120日:19.22 	250日:38.76 		,当前价：36.96	,当前：2022-04-07 11:36:35
        huaGong_foHuaGong.put("002738", "中矿资源");//424	小金属       -0.32	285.03	1.61	价格区间: 5日:11.83 	10日:7.91  	20日:7.08  	30日:4.92  	60日:56.27 	120日:59.16 	250日:72.67 		,当前价：87.52	,当前：2022-04-07 11:36:37
        huaGong_foHuaGong.put("600141", "兴发集团");//353	化肥行业     2.68	379.65	2.22	价格区间: 5日:44.58 	10日:33.60 	20日:27.85 	30日:14.35 	60日:35.82 	120日:17.78 	250日:46.24 		,当前价：34.15	,当前：2022-04-07 11:36:39
        huaGong_foHuaGong.put("002759", "天际股份");//350	家电行业     0.3 	106.89	2.61	价格区间: 5日:8.81  	10日:6.42  	20日:42.52 	30日:42.52 	60日:42.52 	120日:19.52 	250日:34.74 		,当前价：26.58	,当前：2022-04-07 11:36:41
    }

    /**
     * nongYe_linHuaGong ["磷化工"]：26;
     */
    public static Map<String, String> nongYe_linHuaGong = new HashMap<>();

    static {
        nongYe_linHuaGong.put("000422", "湖北宜化");//509	化学原料     9.05	222.85	null	价格区间: 5日:96.16 	10日:97.21 	20日:97.52 	30日:97.69 	60日:98.03 	120日:45.23 	250日:67.30 		,当前价：24.82	,当前：2022-04-08 11:01:44
        nongYe_linHuaGong.put("600096", "云天化  ");//472	化肥行业     6.26	538.83	null	价格区间: 5日:97.46 	10日:98.00 	20日:98.26 	30日:98.40 	60日:99.08 	120日:86.59 	250日:74.29 		,当前价：29.35	,当前：2022-04-08 11:01:46
        nongYe_linHuaGong.put("600141", "兴发集团");//382	化肥行业     10   	414.56	null	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:52.54 	60日:64.44 	120日:31.99 	250日:53.67 		,当前价：37.29	,当前：2022-04-08 11:01:47
        nongYe_linHuaGong.put("002895", "川恒股份");//381	化肥行业     6.99	115.12	null	价格区间: 5日:94.34 	10日:94.34 	20日:95.69 	30日:52.02 	60日:51.35 	120日:16.17 	250日:33.42 		,当前价：23.57	,当前：2022-04-08 11:01:48
        nongYe_linHuaGong.put("600596", "新安股份");//333	农药兽药     4.55	231.36	null	价格区间: 5日:93.42 	10日:67.96 	20日:79.38 	30日:79.35 	60日:86.33 	120日:52.26 	250日:46.30 		,当前价：28.27	,当前：2022-04-08 11:01:49
    }

    /**
     * huaGong 化工
     */
    public static Map<String, String> huaGong = new HashMap<>();

    static {
        huaGong.putAll(huaGong_foHuaGong);//氟化工
        huaGong.putAll(huaGong_huaGongYuanLiao);//化工原料
        huaGong.putAll(huaGong_taiBaiFen);//钛白粉
        huaGong.putAll(huaGong_youJiGui);//有机硅
        huaGong.putAll(nongYe_linHuaGong);//磷化工
    }

    /**
     * nongYe_shuiChanYangZhi ["水产养殖"]：6;
     */
    public static Map<String, String> nongYe_shuiChanYangZhi = new HashMap<>();

    static {
        nongYe_shuiChanYangZhi.put("001313", "粤海饲料");//280	农牧饲渔	-1.86	110.81	1.35	价格区间: 5日:14.32 	10日:27.13 	20日:35.62 	30日:60.74 	60日:66.52 	120日:66.52 	250日:66.52 		,当前价：15.83	,当前：2022-03-30 14:48:56
        nongYe_shuiChanYangZhi.put("002385", "大北农  ");//275	农牧饲渔	0   	360.71	2.9 	价格区间: 5日:80.87 	10日:84.51 	20日:75.62 	30日:75.62 	60日:38.58 	120日:36.71 	250日:46.09 		,当前价：8.71	,当前：2022-03-30 14:48:57
        nongYe_shuiChanYangZhi.put("600438", "通威股份");//264	光伏设备	2.02	2002.29	1.58	价格区间: 5日:94.81 	10日:66.48 	20日:67.89 	30日:79.17 	60日:82.62 	120日:39.52 	250日:46.48 		,当前价：44.48	,当前：2022-03-30 14:48:58
    }
    /**
     * 农业-转基因 ["转基因"]：8;
     */
    public static Map<String, String> nongYe_zhuanJiYin = new HashMap<>();
    static {
        nongYe_zhuanJiYin.put("600596", "新安股份");//328	农药兽药    	1.93	224.40	2.52	价格区间: 5日:61.84 	10日:42.22 	20日:63.03 	30日:62.91 	60日:75.44 	120日:45.67 	250日:43.92 		,当前价：27.42	,当前：2022-04-07 11:21:28
        nongYe_zhuanJiYin.put("600313", "农发种业");//313	农牧饲渔    	-7.24	83.22	4.43	价格区间: 5日:41.32 	10日:63.31 	20日:68.93 	30日:68.93 	60日:69.13 	120日:70.04 	250日:72.64 		,当前价：7.69	,当前：2022-04-07 11:21:30
        nongYe_zhuanJiYin.put("002100", "天康生物");//261	农牧饲渔    	-5.18	163.44	1.83	价格区间: 5日:30.93 	10日:21.74 	20日:64.00 	30日:64.00 	60日:65.71 	120日:79.03 	250日:82.72 		,当前价：12.07	,当前：2022-04-07 11:21:31
        nongYe_zhuanJiYin.put("002385", "大北农  ");//258	农牧饲渔    	-2.04	357.81	1.51	价格区间: 5日:50.75 	10日:73.17 	20日:81.87 	30日:74.13 	60日:37.82 	120日:36.23 	250日:45.68 		,当前价：8.64	,当前：2022-04-07 11:21:32
        nongYe_zhuanJiYin.put("002041", "登海种业");//258	农牧饲渔    	-2.97	204.42	1.23	价格区间: 5日:33.02 	10日:45.29 	20日:70.57 	30日:70.57 	60日:59.71 	120日:44.82 	250日:61.77 		,当前价：23.23	,当前：2022-04-07 11:21:34
        nongYe_zhuanJiYin.put("000998", "隆平高科");//222	农牧饲渔    	-2.55	246.80	1.86	价格区间: 5日:23.70 	10日:16.58 	20日:59.14 	30日:59.14 	60日:29.99 	120日:21.09 	250日:30.30 		,当前价：18.74	,当前：2022-04-07 11:21:35
    }

    /**
     * nongYe_caoGanLin ["草甘膦"]：10;
     */
    public static Map<String, String> nongYe_caoGanLin = new HashMap<>();

    static {
        nongYe_caoGanLin.put("600141", "兴发集团");//382	化肥行业     10   	414.56	null	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:52.54 	60日:64.44 	120日:31.99 	250日:53.67 		,当前价：37.29	,当前：2022-04-08 10:59:36
        nongYe_caoGanLin.put("600389", "江山股份");//354	农药兽药     5.31	142.53	null	价格区间: 5日:92.97 	10日:94.95 	20日:97.54 	30日:97.54 	60日:90.14 	120日:91.48 	250日:62.71 		,当前价：47.99	,当前：2022-04-08 10:59:37
        nongYe_caoGanLin.put("600596", "新安股份");//333	农药兽药     4.55	231.36	null	价格区间: 5日:93.42 	10日:67.96 	20日:79.38 	30日:79.35 	60日:86.33 	120日:52.11 	250日:46.25 		,当前价：28.27	,当前：2022-04-08 10:59:38
        nongYe_caoGanLin.put("603077", "和邦生物");//267	化学原料     2.03	309.98	null	价格区间: 5日:36.36 	10日:48.15 	20日:41.27 	30日:27.96 	60日:26.26 	120日:34.82 	250日:55.52 		,当前价：3.51	,当前：2022-04-08 10:59:39
    }

    /**
     * nongYe_zhuRou ["猪肉概念"]：26;
     */
    public static Map<String, String> nongYe_zhuRou = new HashMap<>();

    static {
        nongYe_zhuRou.put("603363", "傲农生物");//391	农牧饲渔     -2.63	158.01	0.72	价格区间: 5日:55.63 	10日:49.87 	20日:78.26 	30日:78.49 	60日:83.32 	120日:87.92 	250日:89.25 		,当前价：22.96	,当前：2022-04-08 14:25:49
        nongYe_zhuRou.put("603477", "巨星农牧");//380	农牧饲渔     -0.88	125.92	0.95	价格区间: 5日:21.21 	10日:17.72 	20日:64.67 	30日:64.67 	60日:73.71 	120日:80.42 	250日:82.81 		,当前价：24.88	,当前：2022-04-08 14:25:50
        nongYe_zhuRou.put("002100", "天康生物");//261	农牧饲渔     -6.22	153.01	1.53	价格区间: 5日:17.61 	10日:14.00 	20日:42.67 	30日:42.67 	60日:45.40 	120日:66.60 	250日:72.48 		,当前价：11.3	,当前：2022-04-08 14:25:52
        nongYe_zhuRou.put("002385", "大北农  ");//258	农牧饲渔     -4.44	338.76	0.96	价格区间: 5日:19.28 	10日:45.53 	20日:63.19 	30日:57.71 	60日:32.49 	120日:28.02 	250日:38.68 		,当前价：8.18	,当前：2022-04-08 14:25:54
        nongYe_zhuRou.put("002124", "天邦股份");//254	农牧饲渔     -5.52	148.06	1.39	价格区间: 5日:27.35 	10日:44.07 	20日:70.80 	30日:70.80 	60日:70.88 	120日:70.97 	250日:43.77 		,当前价：8.05	,当前：2022-04-08 14:25:55
        nongYe_zhuRou.put("002505", "鹏都农牧");//240	贸易行业     -4.67	195.05	2.41	价格区间: 5日:21.57 	10日:16.67 	20日:13.58 	30日:13.58 	60日:10.58 	120日:13.55 	250日:44.17 		,当前价：3.06	,当前：2022-04-08 14:25:56
        nongYe_zhuRou.put("000002", "万科Ａ  ");//234	房地产开发   2.49	2491.32	0.61	价格区间: 5日:87.29 	10日:90.59 	20日:93.84 	30日:93.84 	60日:80.95 	120日:80.95 	250日:43.79 		,当前价：21.43	,当前：2022-04-08 14:25:57
        nongYe_zhuRou.put("002567", "唐人神  ");//233	农牧饲渔     -3.77	120.12	1.23	价格区间: 5日:16.26 	10日:13.33 	20日:58.33 	30日:58.33 	60日:65.97 	120日:76.19 	250日:77.43 		,当前价：9.96	,当前：2022-04-08 14:25:58
        nongYe_zhuRou.put("000876", "新希望  ");//226	农牧饲渔     -3.65	701.91	1.24	价格区间: 5日:14.29 	10日:14.29 	20日:57.46 	30日:57.46 	60日:46.17 	120日:49.63 	250日:51.98 		,当前价：15.58	,当前：2022-04-08 14:25:59
        nongYe_zhuRou.put("002714", "牧原股份");//219	农牧饲渔     -0.54	2864.34	1.31	价格区间: 5日:18.58 	10日:18.58 	20日:58.48 	30日:48.87 	60日:42.80 	120日:47.84 	250日:35.51 		,当前价：53.82	,当前：2022-04-08 14:26:00
        nongYe_zhuRou.put("002157", "正邦科技");//217	农牧饲渔     -4.24	220.25	1   	价格区间: 5日:20.21 	10日:47.30 	20日:64.55 	30日:64.86 	60日:26.52 	120日:25.90 	250日:15.55 		,当前价：7.0	,当前：2022-04-08 14:26:01
    }
    /**
     * nongYe_jiRou ["鸡肉概念"]：13;
     */
    public static Map<String, String> nongYe_jiRou = new HashMap<>();

    static {
        nongYe_jiRou.put("603477", "巨星农牧");//380	农牧饲渔     -0.88	125.92	0.95	价格区间: 5日:18.79 	10日:15.70 	20日:63.80 	30日:63.80 	60日:73.06 	120日:79.94 	250日:82.39 		,当前价：24.88	,当前：2022-04-08 14:19:54
        nongYe_jiRou.put("002100", "天康生物");//261	农牧饲渔     -6.22	153.01	1.53	价格区间: 5日:16.98 	10日:13.50 	20日:42.33 	30日:42.33 	60日:45.08 	120日:66.41 	250日:72.32 		,当前价：11.3	,当前：2022-04-08 14:19:55
        nongYe_jiRou.put("002746", "仙坛股份");//242	农牧饲渔     -4.26	77.45	1.17	价格区间: 5日:6.40  	10日:10.00 	20日:44.29 	30日:44.29 	60日:25.27 	120日:47.22 	250日:48.31 		,当前价：9.0	,当前：2022-04-08 14:19:57
        nongYe_jiRou.put("002567", "唐人神  ");//233	农牧饲渔     -3.77	120.12	1.23	价格区间: 5日:11.38 	10日:9.33  	20日:56.41 	30日:56.41 	60日:64.40 	120日:75.09 	250日:76.39 		,当前价：9.96	,当前：2022-04-08 14:19:58
        nongYe_jiRou.put("000876", "新希望  ");//226	农牧饲渔     -3.65	701.91	1.24	价格区间: 5日:7.39  	10日:7.39  	20日:54.03 	30日:54.03 	60日:43.42 	120日:47.06 	250日:50.76 		,当前价：15.58	,当前：2022-04-08 14:19:59
    }

    /**
     * nongYe_shengTaiNongYe ["生态农业"]：21;
     */
    public static Map<String, String> nongYe_shengTaiNongYe = new HashMap<>();

    static {
        nongYe_shengTaiNongYe.put("000893", "亚钾国际");//455	化肥行业     6.93	300.11	3.67	价格区间: 5日:91.30 	10日:93.99 	20日:96.13 	30日:96.13 	60日:97.00 	120日:97.43 	250日:97.94 		,当前价：39.65	,当前：2022-04-07 11:41:23
        nongYe_shengTaiNongYe.put("002539", "云图控股");//285	化肥行业     2.93	142.12	1.37	价格区间: 5日:72.83 	10日:85.80 	20日:89.88 	30日:76.29 	60日:71.61 	120日:37.03 	250日:38.04 		,当前价：14.07	,当前：2022-04-07 11:41:25
        nongYe_shengTaiNongYe.put("000505", "京粮控股");//278	农牧饲渔     -4.42	77.06	2.99	价格区间: 5日:28.06 	10日:48.35 	20日:59.77 	30日:59.77 	60日:61.99 	120日:62.15 	250日:62.15 		,当前价：10.6	,当前：2022-04-07 11:41:26
//        nongYe_shengTaiNongYe.put("002470", "ST金正  ");//272	化肥行业     1.13	88.07	1.69	价格区间: 5日:50.00 	10日:21.74 	20日:37.50 	30日:37.50 	60日:42.00 	120日:46.79 	250日:63.33 		,当前价：2.68	,当前：2022-04-07 11:41:27
        nongYe_shengTaiNongYe.put("000902", "新洋丰  ");//259	化肥行业     3.74	239.12	1.2 	价格区间: 5日:90.13 	10日:94.38 	20日:96.01 	30日:96.01 	60日:96.01 	120日:72.34 	250日:42.01 		,当前价：18.33	,当前：2022-04-07 11:41:28
    }

    /**
     * nongYe_huangChongFangZhi ["蝗虫防治"]：10;
     */
    public static Map<String, String> nongYe_huangChongFangZhi = new HashMap<>();

    static {
        nongYe_huangChongFangZhi.put("600389", "江山股份");//354	农药兽药     6.54	144.19	2.4 	价格区间: 5日:96.77 	10日:97.62 	20日:98.81 	30日:98.81 	60日:94.06 	120日:94.84 	250日:63.81 		,当前价：48.55	,当前：2022-04-08 12:12:00
        nongYe_huangChongFangZhi.put("000009", "中国宝安");//290	综合行业     -2.14	271.59	1.29	价格区间: 5日:12.67 	10日:10.61 	20日:9.36  	30日:4.51  	60日:4.08  	120日:1.61  	250日:9.17  		,当前价：10.53	,当前：2022-04-08 12:12:01
    }

    /**
     * nongYe 农业:转基因,草甘膦,水产养殖,磷化工,鸡肉概念,猪肉概念,生态农业
     */
    public static Map<String, String> nongYe = new HashMap<>();

    static {
        nongYe.putAll(nongYe_zhuanJiYin);//转基因
        nongYe.putAll(nongYe_caoGanLin);//草甘膦
        nongYe.putAll(nongYe_shuiChanYangZhi);//水产养殖
        nongYe.putAll(nongYe_jiRou);//鸡肉概念
        nongYe.putAll(nongYe_zhuRou);//猪肉概念
        nongYe.putAll(nongYe_shengTaiNongYe);//生态农业
        nongYe.putAll(nongYe_huangChongFangZhi);//蝗虫防治
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(keRanBing);//可燃冰
        all.putAll(youJiaXiangGuan);//油价相关
        all.putAll(gangTie_diTanYeJin);//低碳冶金
        all.putAll(jinShu_jiBenJinShu);//基本金属
        all.putAll(qiTi_qingNengYuan);//氢能源
        all.putAll(qiTi_haiQi);//氦气概念
        all.putAll(meiTan_meiHuaGong);//煤化工
        all.putAll(huaGong);//化工
        all.putAll(nongYe); //农业:转基因,草甘膦,水产养殖,磷化工
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);
//                String date = "2022-04-07";
//                String spDate = "2022-04-08";//特定日期：下一交易日
        KlineService.checkMaDemo(all, date,spDate);// all   huaGong   nongYe_linHuaGong
    }
}
