package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：消费
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStXiaoFei {




    /**
     * shiPin_tiaoWeiPin ["调味品概念"]：19;
     */
    public static Map<String, String> shiPin_tiaoWeiPin = new HashMap<>();

    static {
        shiPin_tiaoWeiPin.put("002053", "云南能投");//374	化学原料	2.03	103.04	1.23	价格区间: 5日:18.60 	10日:5.13  	20日:35.20 	30日:35.37 	60日:39.54 	120日:42.72 	250日:47.63 		,当前价：13.54	,当前：2022-03-30 14:19:50
        shiPin_tiaoWeiPin.put("000505", "京粮控股");//332	农牧饲渔	4   	96.39	6.56	价格区间: 5日:86.45 	10日:88.53 	20日:89.44 	30日:89.44 	60日:90.03 	120日:90.07 	250日:90.07 		,当前价：13.26	,当前：2022-03-30 14:19:52
        shiPin_tiaoWeiPin.put("600328", "中盐化工");//299	化学原料	4.21	161.08	2.34	价格区间: 5日:94.71 	10日:95.65 	20日:75.16 	30日:73.55 	60日:73.55 	120日:33.63 	250日:39.60 		,当前价：16.82	,当前：2022-03-30 14:19:53
//        shiPin_tiaoWeiPin.put("002539", "云图控股");//284	化肥行业	-0.73	137.88	2.65	价格区间: 5日:78.81 	10日:82.42 	20日:69.09 	30日:65.29 	60日:61.29 	120日:31.96 	250日:35.96 		,当前价：13.65	,当前：2022-03-30 14:19:54
//        shiPin_tiaoWeiPin.put("002597", "金禾实业");//271	食品饮料	0.45	223.75	1.05	价格区间: 5日:55.03 	10日:59.75 	20日:81.89 	30日:73.46 	60日:35.56 	120日:33.73 	250日:45.23 		,当前价：39.89	,当前：2022-03-30 14:19:56
//        shiPin_tiaoWeiPin.put("600251", "冠农股份");//268	农牧饲渔	-5.79	78.85	2.44	价格区间: 5日:14.29 	10日:36.25 	20日:42.29 	30日:55.89 	60日:63.31 	120日:63.31 	250日:60.00 		,当前价：10.09	,当前：2022-03-30 14:19:57
//        shiPin_tiaoWeiPin.put("002568", "百润股份");//250	酿酒行业	7.38	276.61	2.41	价格区间: 5日:71.47 	10日:52.92 	20日:29.29 	30日:24.46 	60日:11.16 	120日:8.40  	250日:5.46  		,当前价：36.83	,当前：2022-03-30 14:19:57
    }






    /**
     * ["在线旅游"]：8;
     */
    public static Map<String, String> lvYou_zaiXianLvYou = new HashMap<>();

    static {
        lvYou_zaiXianLvYou.put("000524", "岭南控股");//348	旅游酒店     2.69	86.99	3.56	价格区间: 5日:63.25 	10日:69.93 	20日:55.07 	30日:57.32 	60日:64.04 	120日:67.69 	250日:67.69 		,当前价：12.98	,当前：2022-04-12 10:27:32
        lvYou_zaiXianLvYou.put("000796", "凯撒旅业");//320	旅游酒店     3.44	94.27	4.03	价格区间: 5日:62.27 	10日:68.32 	20日:73.82 	30日:78.16 	60日:82.30 	120日:84.77 	250日:85.34 		,当前价：11.74	,当前：2022-04-12 10:27:33
        lvYou_zaiXianLvYou.put("002707", "众信旅游");//258	旅游酒店     2.23	66.62	4.08	价格区间: 5日:30.88 	10日:37.50 	20日:70.10 	30日:70.10 	60日:52.70 	120日:63.57 	250日:67.96 		,当前价：7.35	,当前：2022-04-12 10:27:35
        lvYou_zaiXianLvYou.put("002244", "滨江集团");//255	房地产开发   -0.14	226.82	1.3 	价格区间: 5日:33.70 	10日:54.14 	20日:74.48 	30日:74.48 	60日:79.25 	120日:84.67 	250日:85.05 		,当前价：7.29	,当前：2022-04-12 10:27:36
        lvYou_zaiXianLvYou.put("600258", "首旅酒店");//252	旅游酒店     5.01	256.12	2.51	价格区间: 5日:36.18 	10日:33.71 	20日:35.28 	30日:21.51 	60日:19.07 	120日:19.07 	250日:39.40 		,当前价：22.84	,当前：2022-04-12 10:27:37
        lvYou_zaiXianLvYou.put("600640", "新国脉  ");//236	文化传媒     0.78	81.96	1.58	价格区间: 5日:5.04  	10日:5.04  	20日:24.57 	30日:24.57 	60日:7.88  	120日:7.74  	250日:7.74  		,当前价：10.3	,当前：2022-04-12 10:27:38
        lvYou_zaiXianLvYou.put("000069", "华侨城Ａ");//224	房地产开发   -0.14	602.01	1.25	价格区间: 5日:3.23  	10日:48.86 	20日:63.27 	30日:63.27 	60日:54.39 	120日:54.39 	250日:33.26 		,当前价：7.34	,当前：2022-04-12 10:27:39
        lvYou_zaiXianLvYou.put("600138", "中青旅  ");//190	旅游酒店     4.51	90.55	4.17	价格区间: 5日:38.21 	10日:47.22 	20日:65.14 	30日:65.14 	60日:62.34 	120日:70.48 	250日:72.94 		,当前价：12.51	,当前：2022-04-12 10:27:40
    }

    /**
     * lvYou_mianShui ["免税概念"]：22;
     */
    public static Map<String, String> lvYou_mianShui = new HashMap<>();

    static {
        lvYou_mianShui.put("600338", "西藏珠峰");//373	有色金属	-0.08	241.63	2.19	价格区间: 5日:32.39 	10日:17.32 	20日:13.40 	30日:7.76  	60日:6.49  	120日:5.55  	250日:40.92 		,当前价：26.43	,当前：2022-04-01 10:34:10
        lvYou_mianShui.put("000524", "岭南控股");//352	旅游酒店	10   	84.04	12.97	价格区间: 5日:100.00	10日:38.74 	20日:54.48 	30日:56.76 	60日:63.57 	120日:67.16 	250日:67.16 		,当前价：12.54	,当前：2022-04-01 10:34:12
        lvYou_mianShui.put("000796", "凯撒旅业");//315	旅游酒店	4.27	84.32	6.1 	价格区间: 5日:80.77 	10日:61.40 	20日:75.00 	30日:77.16 	60日:75.06 	120日:77.91 	250日:78.65 		,当前价：10.5	,当前：2022-04-01 10:34:13
        lvYou_mianShui.put("002707", "众信旅游");//271	旅游酒店	4.92	69.52	4.54	价格区间: 5日:86.36 	10日:80.85 	20日:91.18 	30日:91.18 	60日:66.46 	120日:74.08 	250日:77.20 		,当前价：7.67	,当前：2022-04-01 10:34:14
        lvYou_mianShui.put("000861", "海印股份");//235	综合行业	3.71	84.42	2.45	价格区间: 5日:59.26 	10日:55.26 	20日:83.65 	30日:83.65 	60日:86.82 	120日:90.66 	250日:91.41 		,当前价：3.63	,当前：2022-04-01 10:34:15
        lvYou_mianShui.put("601888", "中国中免");//229	旅游酒店	6.68	3423.67	2.52	价格区间: 5日:84.86 	10日:83.02 	20日:39.79 	30日:26.17 	60日:22.09 	120日:13.60 	250日:8.74  		,当前价：175.35	,当前：2022-04-01 10:34:16
        lvYou_mianShui.put("001979", "招商蛇口");//226	房地产开发	-0.92	1190.07	2.48	价格区间: 5日:53.85 	10日:74.47 	20日:82.91 	30日:82.91 	60日:82.91 	120日:90.24 	250日:90.74 		,当前价：15.02	,当前：2022-04-01 10:34:17
        lvYou_mianShui.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:93.10 	10日:63.82 	20日:55.02 	30日:45.82 	60日:38.39 	120日:47.75 	250日:54.33 		,当前价：50.49	,当前：2022-04-01 10:34:19
        lvYou_mianShui.put("600018", "上港集团");//193	航运港口	10.05	1401.38	25.96	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:91.58 	60日:81.31 	120日:84.80 	250日:82.30 		,当前价：6.02	,当前：2022-04-01 10:34:20
        lvYou_mianShui.put("002163", "海南发展");//190	玻璃玻纤	9.96	86.94	6.84	价格区间: 5日:100.00	10日:100.00	20日:73.89 	30日:56.23 	60日:43.72 	120日:30.47 	250日:12.80 		,当前价：10.82	,当前：2022-04-01 10:34:21
//        lvYou_mianShui.put("000564", "*ST大集 ");//181	商业百货	-1.02	185.89	8.38	价格区间: 5日:23.08 	10日:20.00 	20日:12.00 	30日:9.09  	60日:3.90  	120日:0.74  	250日:0.74  		,当前价：0.97	,当前：2022-04-01 10:34:22
//        lvYou_mianShui.put("600029", "南方航空");//177	航空机场	2.75	1077.92	2.04	价格区间: 5日:55.36 	10日:43.06 	20日:39.37 	30日:33.78 	60日:23.47 	120日:23.47 	250日:44.56 		,当前价：6.36	,当前：2022-04-01 10:34:23
//        lvYou_mianShui.put("600515", "*ST基础 ");//175	房地产开发	3.93	422.74	11.33	价格区间: 5日:86.11 	10日:86.11 	20日:47.89 	30日:44.74 	60日:26.15 	120日:4.10  	250日:3.31  		,当前价：3.7	,当前：2022-04-01 10:34:23
        lvYou_mianShui.put("600859", "王府井  ");//172	商业百货	9.99	258.29	3.1 	价格区间: 5日:100.00	10日:100.00	20日:53.99 	30日:34.48 	60日:30.34 	120日:21.30 	250日:18.99 		,当前价：22.8	,当前：2022-04-01 10:34:25
    }

    /**
     * lvYou_hangKongJiChang 航空机场
     */
    public static Map<String, String> lvYou_hangKongJiChang = new HashMap<>();

    static {
        lvYou_hangKongJiChang.put("600004", "白云机场");//230	航空机场	3.84	301.05	2.56	价格区间: 5日:90.43 	10日:65.82 	20日:71.43 	30日:51.24 	60日:42.75 	120日:50.89 	250日:67.11 		,当前价：12.72	,当前：2022-04-01 11:39:04
        lvYou_hangKongJiChang.put("601111", "中国国航");//224	航空机场	4.94	1388.57	2.28	价格区间: 5日:87.50 	10日:73.04 	20日:73.82 	30日:62.95 	60日:46.23 	120日:55.91 	250日:68.16 		,当前价：9.56	,当前：2022-04-01 11:39:05
        lvYou_hangKongJiChang.put("002928", "华夏航空");//223	航空机场	1.36	105.72	2.56	价格区间: 5日:43.75 	10日:37.23 	20日:32.84 	30日:18.23 	60日:14.93 	120日:14.93 	250日:17.28 		,当前价：10.43	,当前：2022-04-01 11:39:07
        lvYou_hangKongJiChang.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:91.75 	10日:66.73 	20日:56.71 	30日:47.23 	60日:39.57 	120日:48.75 	250日:54.94 		,当前价：50.49	,当前：2022-04-01 11:39:08
    }

    /**
     * yuZhiCaiGaiNian ["预制菜概念"]：16;
     */
    public static Map<String, String> shiPin_yuZhiCai = new HashMap<>();

    static {
        shiPin_yuZhiCai.put("000524", "岭南控股");//369	旅游酒店     -2.37	90.95	8.06	价格区间: 5日:86.67 	10日:88.72 	20日:69.20 	30日:69.74 	60日:75.68 	120日:78.07 	250日:78.07 		,当前价：13.57	,当前：2022-04-13 11:36:02
        shiPin_yuZhiCai.put("605089", "味知香  ");//332	食品饮料     0.9 	63.87	5.66	价格区间: 5日:87.51 	10日:82.59 	20日:86.00 	30日:72.30 	60日:20.84 	120日:20.84 	250日:23.09 		,当前价：63.87	,当前：2022-04-13 11:36:04
        shiPin_yuZhiCai.put("600965", "福成股份");//242	农牧饲渔     2.02	57.80	3.62	价格区间: 5日:80.00 	10日:54.37 	20日:71.60 	30日:71.60 	60日:29.88 	120日:29.88 	250日:41.44 		,当前价：7.06	,当前：2022-04-13 11:36:05
        shiPin_yuZhiCai.put("603345", "安井食品");//241	食品饮料     0.67	316.19	2.07	价格区间: 5日:58.00 	10日:47.00 	20日:36.25 	30日:23.34 	60日:9.37  	120日:5.53  	250日:3.62  		,当前价：107.8	,当前：2022-04-13 11:36:06
        shiPin_yuZhiCai.put("002124", "天邦股份");//237	农牧饲渔     -1.22	148.61	3.97	价格区间: 5日:19.59 	10日:26.38 	20日:64.60 	30日:64.60 	60日:64.71 	120日:64.81 	250日:41.27 		,当前价：8.08	,当前：2022-04-13 11:36:08
        shiPin_yuZhiCai.put("000019", "深粮控股");//236	贸易行业     5.59	104.53	4.17	价格区间: 5日:66.67 	10日:59.44 	20日:74.83 	30日:74.83 	60日:77.47 	120日:78.65 	250日:78.65 		,当前价：9.07	,当前：2022-04-13 11:36:09
        shiPin_yuZhiCai.put("000876", "新希望  ");//222	农牧饲渔     -1.38	708.67	2.97	价格区间: 5日:18.95 	10日:13.88 	20日:55.99 	30日:55.99 	60日:46.36 	120日:48.53 	250日:54.16 		,当前价：15.73	,当前：2022-04-13 11:36:10
        shiPin_yuZhiCai.put("601933", "永辉超市");//210	商业百货     -4.32	441.95	8.27	价格区间: 5日:63.92 	10日:70.34 	20日:71.77 	30日:81.58 	60日:81.58 	120日:81.58 	250日:44.16 		,当前价：4.87	,当前：2022-04-13 11:36:11
    }

    /**
     * shiPin_sheQuTuanGou ["社区团购"]：18;
     */
    public static Map<String, String> shiPin_sheQuTuanGou = new HashMap<>();

    static {
        shiPin_sheQuTuanGou.put("000607", "华媒控股");//288	文化传媒     -9.45	55.57	3.01	价格区间: 5日:5.79  	10日:17.39 	20日:37.70 	30日:37.70 	60日:31.77 	120日:51.54 	250日:54.13 		,当前价：5.46	,当前：2022-04-13 11:09:22
        shiPin_sheQuTuanGou.put("600327", "大东方  ");//238	汽车服务     -4.07	50.08	5.14	价格区间: 5日:5.71  	10日:3.77  	20日:2.33  	30日:2.01  	60日:15.58 	120日:23.83 	250日:37.21 		,当前价：5.66	,当前：2022-04-13 11:09:24
        shiPin_sheQuTuanGou.put("002183", "怡亚通  ");//225	物流行业     7.65	146.21	12.1	价格区间: 5日:82.35 	10日:83.87 	20日:87.29 	30日:87.29 	60日:51.24 	120日:44.02 	250日:32.88 		,当前价：5.63	,当前：2022-04-13 11:09:25
        shiPin_sheQuTuanGou.put("601933", "永辉超市");//210	商业百货     -3.14	447.40	8.27	价格区间: 5日:69.07 	10日:74.58 	20日:75.81 	30日:84.21 	60日:84.21 	120日:84.21 	250日:45.58 		,当前价：4.93	,当前：2022-04-13 11:09:26
    }

    /**
     * shiPin_ruYe ["乳业"]：14;
     */
    public static Map<String, String> shiPin_ruYe = new HashMap<>();

    static {
        shiPin_ruYe.put("605388", "均瑶健康");//301	食品饮料     5.36	83.72	6.42	价格区间: 5日:77.42 	10日:55.81 	20日:41.80 	30日:46.89 	60日:43.82 	120日:36.30 	250日:20.80 		,当前价：19.47	,当前：2022-04-13 11:14:57
        shiPin_ruYe.put("605337", "李子园  ");//285	食品饮料     6.13	71.30	9.63	价格区间: 5日:82.59 	10日:82.59 	20日:82.59 	30日:53.24 	60日:23.22 	120日:20.46 	250日:17.80 		,当前价：32.9	,当前：2022-04-13 11:14:58
        shiPin_ruYe.put("002557", "洽洽食品");//264	食品饮料     -2.09	287.37	1.51	价格区间: 5日:60.42 	10日:73.29 	20日:82.26 	30日:73.77 	60日:72.54 	120日:54.36 	250日:65.73 		,当前价：56.68	,当前：2022-04-13 11:15:00
        shiPin_ruYe.put("002385", "大北农  ");//252	农牧饲渔     0.24	344.55	4.4 	价格区间: 5日:45.95 	10日:45.95 	20日:67.21 	30日:61.19 	60日:40.07 	120日:29.71 	250日:40.12 		,当前价：8.32	,当前：2022-04-13 11:15:01
    }

    /**
     * shiPin 食品: 预制菜概念,社区团购,调味品概念
     */
    public static Map<String, String> shiPin = new HashMap<>();

    static {
        shiPin.putAll(shiPin_yuZhiCai);
        shiPin.putAll(shiPin_tiaoWeiPin);
        shiPin.putAll(shiPin_sheQuTuanGou);
        shiPin.putAll(shiPin_ruYe);//乳业
    }

    /**
     * jiuShui_baiJiu ["白酒"]：37;
     */
    public static Map<String, String> jiuShui_baiJiu = new HashMap<>();

    static {
        jiuShui_baiJiu.put("600199", "金种子酒");//404	酿酒行业     3.92	162.21	2.6 	价格区间: 5日:31.28 	10日:43.21 	20日:21.79 	30日:29.02 	60日:58.98 	120日:58.98 	250日:60.21 		,当前价：24.66	,当前：2022-04-12 11:40:42
        jiuShui_baiJiu.put("600381", "青海春天");//374	食品饮料     10   	109.13	2.99	价格区间: 5日:75.93 	10日:86.81 	20日:89.14 	30日:91.90 	60日:92.87 	120日:93.18 	250日:93.51 		,当前价：18.59	,当前：2022-04-12 11:40:44
        jiuShui_baiJiu.put("600771", "广誉远  ");//333	中药         0.89	156.75	1.96	价格区间: 5日:10.07 	10日:6.16  	20日:29.05 	30日:29.05 	60日:20.46 	120日:23.21 	250日:41.20 		,当前价：31.86	,当前：2022-04-12 11:40:45
        jiuShui_baiJiu.put("600238", "海南椰岛");//328	酿酒行业     1.52	57.01	1.48	价格区间: 5日:36.55 	10日:43.56 	20日:50.00 	30日:30.90 	60日:16.39 	120日:9.79  	250日:17.29 		,当前价：12.72	,当前：2022-04-12 11:40:46
        jiuShui_baiJiu.put("600702", "舍得酒业");//311	酿酒行业     1.59	480.27	2.7 	价格区间: 5日:14.93 	10日:12.93 	20日:7.54  	30日:5.79  	60日:4.74  	120日:2.88  	250日:34.83 		,当前价：144.63	,当前：2022-04-12 11:40:47
    }

    /**
     * jiuShui_piJiu ["啤酒概念"]：6;
     */
    public static Map<String, String> jiuShui_piJiu = new HashMap<>();

    static {
        jiuShui_piJiu.put("600132", "重庆啤酒");//272	酿酒行业     -0.75	551.73	3.56	价格区间: 5日:77.70 	10日:83.52 	20日:63.50 	30日:31.51 	60日:30.09 	120日:19.33 	250日:12.53 		,当前价：114.0	,当前：2022-04-13 10:14:32
        jiuShui_piJiu.put("600108", "亚盛集团");//246	农牧饲渔     0.78	75.35	2.39	价格区间: 5日:32.14 	10日:32.14 	20日:64.49 	30日:64.49 	60日:67.80 	120日:69.84 	250日:76.69 		,当前价：3.87	,当前：2022-04-13 10:14:33
        jiuShui_piJiu.put("600600", "青岛啤酒");//215	酿酒行业     -0.92	1090.67	7.33	价格区间: 5日:82.19 	10日:74.15 	20日:44.71 	30日:23.10 	60日:23.10 	120日:19.63 	250日:15.71 		,当前价：79.94	,当前：2022-04-13 10:14:34
    }

    /**
     * jiuShui 酒水
     */
    public static Map<String, String> jiuShui = new HashMap<>();

    static {
        jiuShui.putAll(jiuShui_baiJiu);
        jiuShui.putAll(jiuShui_piJiu);//啤酒概念
    }


    /**
     * lvYou 旅游
     */
    public static Map<String, String> lvYou = new HashMap<>();

    static {
        lvYou.putAll(lvYou_zaiXianLvYou);//在线旅游
        lvYou.putAll(lvYou_mianShui);//免税概念
        lvYou.putAll(lvYou_hangKongJiChang);//航空机场
    }

    /**
     * wuLiu_kuaiDi ["快递概念"]：23;
     */
    public static Map<String, String> wuLiu_kuaiDi = new HashMap<>();

    static {
        wuLiu_kuaiDi.put("002210", "飞马国际");//305	物流行业     10.12	98.47	77   	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:50.62 	250日:55.56 		,当前价：3.7	,当前：2022-04-13 10:05:01
        wuLiu_kuaiDi.put("603056", "德邦股份");//280	物流行业     3.94	151.78	5.93	价格区间: 5日:30.41 	10日:14.80 	20日:9.21  	30日:35.57 	60日:37.84 	120日:39.95 	250日:40.47 		,当前价：14.78	,当前：2022-04-13 10:05:02
        wuLiu_kuaiDi.put("600787", "中储股份");//275	物流行业     9.97	157.73	53.57	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:96.44 	250日:79.48 		,当前价：7.17	,当前：2022-04-13 10:05:03
        wuLiu_kuaiDi.put("002120", "韵达股份");//259	物流行业     1.49	512.63	2.38	价格区间: 5日:89.32 	10日:85.19 	20日:56.62 	30日:38.82 	60日:24.24 	120日:24.24 	250日:46.91 		,当前价：17.66	,当前：2022-04-13 10:05:05
        wuLiu_kuaiDi.put("600153", "建发股份");//250	贸易行业     1.55	375.11	2.88	价格区间: 5日:25.00 	10日:49.66 	20日:72.88 	30日:72.88 	60日:73.13 	120日:79.30 	250日:80.53 		,当前价：13.1	,当前：2022-04-13 10:05:06
        wuLiu_kuaiDi.put("600233", "圆通速递");//246	物流行业     2.79	569.97	2.54	价格区间: 5日:90.00 	10日:54.62 	20日:52.50 	30日:46.44 	60日:39.13 	120日:57.33 	250日:72.52 		,当前价：16.59	,当前：2022-04-13 10:05:07
        wuLiu_kuaiDi.put("002010", "传化智联");//239	物流行业     6.1 	218.99	15.58	价格区间: 5日:76.99 	10日:76.99 	20日:78.15 	30日:54.71 	60日:34.07 	120日:25.27 	250日:29.77 		,当前价：7.13	,当前：2022-04-13 10:05:08
        wuLiu_kuaiDi.put("002183", "怡亚通  ");//225	物流行业     7.65	146.21	12.1	价格区间: 5日:80.00 	10日:81.72 	20日:85.59 	30日:85.59 	60日:50.25 	120日:43.16 	250日:32.33 		,当前价：5.63	,当前：2022-04-13 10:05:09
    }

    /**
     * wuLiu_tongYiDaShiChang ["统一大市场"]：6;
     */
    public static Map<String, String> wuLiu_tongYiDaShiChang = new HashMap<>();

    static {
        wuLiu_tongYiDaShiChang.put("002210", "飞马国际");//305	物流行业     10.12	98.47	77   	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:50.62 	250日:55.56 		,当前价：3.7	,当前：2022-04-13 10:00:21
        wuLiu_tongYiDaShiChang.put("600787", "中储股份");//275	物流行业     9.97	157.73	53.57	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:96.44 	250日:79.48 		,当前价：7.17	,当前：2022-04-13 10:00:22
        wuLiu_tongYiDaShiChang.put("002010", "传化智联");//239	物流行业     6.1 	218.99	15.58	价格区间: 5日:87.61 	10日:87.61 	20日:88.24 	30日:62.94 	60日:39.19 	120日:29.08 	250日:32.95 		,当前价：7.13	,当前：2022-04-13 10:00:23
        wuLiu_tongYiDaShiChang.put("002183", "怡亚通  ");//225	物流行业     7.65	146.21	12.1	价格区间: 5日:83.53 	10日:84.95 	20日:88.14 	30日:88.14 	60日:51.74 	120日:44.44 	250日:33.15 		,当前价：5.63	,当前：2022-04-13 10:00:24
        wuLiu_tongYiDaShiChang.put("001213", "中铁特货");//224	物流行业     9.78	284.44	22.23	价格区间: 5日:99.17 	10日:99.19 	20日:99.22 	30日:99.22 	60日:99.22 	120日:54.62 	250日:37.16 		,当前价：6.4	,当前：2022-04-13 10:00:25
        wuLiu_tongYiDaShiChang.put("000927", "中国铁物");//208	物流行业     10.05	258.35	16.58	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:98.44 		,当前价：4.27	,当前：2022-04-13 10:00:26
    }

    /**
     * wuLiu_haiYangJingJi ["海洋经济"]：17;
     */
    public static Map<String, String> wuLiu_haiYangJingJi = new HashMap<>();

    static {
        wuLiu_haiYangJingJi.put("002639", "雪人股份");//369	通用设备     5.76	99.36	2.49	价格区间: 5日:75.12 	10日:76.71 	20日:61.59 	30日:61.59 	60日:39.06 	120日:49.65 	250日:53.95 		,当前价：12.86	,当前：2022-04-12 11:47:22
        wuLiu_haiYangJingJi.put("600522", "中天科技");//330	通信设备     -0.87	503.41	1.23	价格区间: 5日:1.18  	10日:1.02  	20日:0.59  	30日:0.50  	60日:12.30 	120日:50.08 	250日:56.37 		,当前价：14.75	,当前：2022-04-12 11:47:23
        wuLiu_haiYangJingJi.put("600026", "中远海能");//293	航运港口     2.04	332.91	2.09	价格区间: 5日:81.01 	10日:90.13 	20日:91.33 	30日:91.33 	60日:93.48 	120日:93.48 	250日:79.93 		,当前价：6.99	,当前：2022-04-12 11:47:24
        wuLiu_haiYangJingJi.put("601919", "中远海控");//284	航运港口     0.4 	2411.74	0.78	价格区间: 5日:15.08 	10日:12.33 	20日:12.33 	30日:7.11  	60日:7.05  	120日:12.45 	250日:36.42 		,当前价：15.06	,当前：2022-04-12 11:47:26
        wuLiu_haiYangJingJi.put("601890", "亚星锚链");//270	船舶制造     5.34	71.96	0.99	价格区间: 5日:83.33 	10日:83.33 	20日:82.42 	30日:38.07 	60日:21.93 	120日:35.82 	250日:50.19 		,当前价：7.5	,当前：2022-04-12 11:47:27
    }

    /**
     * wuLiu_rcep ["RCEP概念"]：13;
     */
    public static Map<String, String> wuLiu_rcep = new HashMap<>();

    static {
        wuLiu_rcep.put("000811", "冰轮环境");//287	通用设备     0.84	80.92	1.92	价格区间: 5日:41.86 	10日:36.73 	20日:23.15 	30日:22.86 	60日:12.24 	120日:11.52 	250日:37.50 		,当前价：10.85	,当前：2022-04-12 13:51:45
        wuLiu_rcep.put("002803", "吉宏股份");//277	文化传媒     -0.61	50.41	1.17	价格区间: 5日:14.00 	10日:12.21 	20日:19.25 	30日:19.25 	60日:5.38  	120日:5.38  	250日:3.30  		,当前价：13.01	,当前：2022-04-12 13:51:47
        wuLiu_rcep.put("002612", "朗姿股份");//244	纺织服装     -0.57	91.98	1.73	价格区间: 5日:16.50 	10日:13.51 	20日:11.65 	30日:7.29  	60日:5.82  	120日:3.11  	250日:1.31  		,当前价：20.79	,当前：2022-04-12 13:51:48
        wuLiu_rcep.put("000582", "北部湾港");//239	航运港口     10   	186.86	8.54	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：11.44	,当前：2022-04-12 13:51:49
        wuLiu_rcep.put("603565", "中谷物流");//236	航运港口     -1.6	253.21	2.92	价格区间: 5日:45.39 	10日:38.78 	20日:64.35 	30日:38.87 	60日:28.60 	120日:28.60 	250日:22.37 		,当前价：26.41	,当前：2022-04-12 13:51:50
        wuLiu_rcep.put("600190", "锦州港  ");//231	航运港口     6.68	83.10	2.66	价格区间: 5日:85.71 	10日:86.67 	20日:32.91 	30日:32.55 	60日:50.69 	120日:51.85 	250日:51.85 		,当前价：4.15	,当前：2022-04-12 13:51:51
    }

    /**
     * wuLiu_zhongEMaoYi ["中俄贸易概念"]：11;
     */
    public static Map<String, String> wuLiu_zhongEMaoYi = new HashMap<>();

    static {
        wuLiu_zhongEMaoYi.put("002758", "浙农股份");//265	综合行业     3.94	76.91	2.11	价格区间: 5日:66.50 	10日:39.71 	20日:51.96 	30日:35.16 	60日:48.24 	120日:51.91 	250日:55.95 		,当前价：15.3	,当前：2022-04-13 11:39:49
        wuLiu_zhongEMaoYi.put("600251", "冠农股份");//263	农牧饲渔     1.59	84.79	5.21	价格区间: 5日:82.86 	10日:83.33 	20日:86.67 	30日:77.53 	60日:85.71 	120日:85.71 	250日:71.61 		,当前价：10.85	,当前：2022-04-13 11:39:50
        wuLiu_zhongEMaoYi.put("600798", "宁波海运");//260	航运港口     -1.47	64.55	7   	价格区间: 5日:63.92 	10日:70.83 	20日:76.03 	30日:57.81 	60日:66.25 	120日:66.25 	250日:66.25 		,当前价：5.35	,当前：2022-04-13 11:39:52
        wuLiu_zhongEMaoYi.put("002353", "杰瑞股份");//259	专用设备     -0.15	382.57	2.26	价格区间: 5日:42.25 	10日:23.81 	20日:20.34 	30日:17.61 	60日:17.61 	120日:16.89 	250日:40.98 		,当前价：39.94	,当前：2022-04-13 11:39:53
        wuLiu_zhongEMaoYi.put("600190", "锦州港  ");//230	航运港口     -1.94	80.89	5.33	价格区间: 5日:62.50 	10日:63.79 	20日:36.45 	30日:20.00 	60日:46.21 	120日:47.47 	250日:47.47 		,当前价：4.04	,当前：2022-04-13 11:39:54
    }

    /**
     * wuLiu 物流
     */
    public static Map<String, String> wuLiu = new HashMap<>();

    static {
        wuLiu.putAll(wuLiu_kuaiDi);//快递概念
        wuLiu.putAll(wuLiu_tongYiDaShiChang);//统一大市场
        wuLiu.putAll(wuLiu_haiYangJingJi);//海洋经济
        wuLiu.putAll(wuLiu_rcep);//RCEP概念
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {

        all.putAll(shiPin); //食品
        all.putAll(jiuShui); //酒水
        all.putAll(wuLiu); //物流

        all.putAll(lvYou); //旅游
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStXiaoFei.all, date);//all nongYe
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.lvYou, date);//all nongYe lvYou
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.shiPin, date);//
    }
}
