package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：消费
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStXiaoFei {






    /**
     * ["在线旅游"]：8;
     */
    public static Map<String, String> lvYou_zaiXianLvYou = new HashMap<>();

    static {
        lvYou_zaiXianLvYou.put("000524", "岭南控股");//337	旅游酒店     3.82	72.92	1.12	价格区间: 5日:29.76 	10日:16.58 	20日:11.36 	30日:30.10 	60日:44.07 	120日:49.58 	250日:49.58 		,当前价：10.88	,当前：2022-04-20 11:51:37
        lvYou_zaiXianLvYou.put("000796", "凯撒旅业");//317	旅游酒店     2.9 	85.44	0.99	价格区间: 5日:40.85 	10日:19.65 	20日:25.95 	30日:40.82 	60日:52.51 	120日:58.04 	250日:59.35 		,当前价：10.64	,当前：2022-04-20 11:51:39
        lvYou_zaiXianLvYou.put("600258", "首旅酒店");//266	旅游酒店     2.49	282.03	1.2 	价格区间: 5日:94.19 	10日:97.53 	20日:97.53 	30日:87.45 	60日:52.78 	120日:52.78 	250日:61.17 		,当前价：25.15	,当前：2022-04-20 11:51:40
        lvYou_zaiXianLvYou.put("002707", "众信旅游");//263	旅游酒店     0.88	62.36	0.95	价格区间: 5日:28.70 	10日:24.26 	20日:24.26 	30日:50.95 	60日:36.64 	120日:54.77 	250日:60.22 		,当前价：6.88	,当前：2022-04-20 11:51:41
        lvYou_zaiXianLvYou.put("600640", "新国脉  ");//260	文化传媒     1.08	81.96	0.93	价格区间: 5日:94.67 	10日:38.59 	20日:36.41 	30日:36.41 	60日:13.50 	120日:10.04 	250日:10.04 		,当前价：10.3	,当前：2022-04-20 11:51:42
        lvYou_zaiXianLvYou.put("002244", "滨江集团");//247	房地产开发   -5.02	205.98	1.47	价格区间: 5日:4.13  	10日:3.91  	20日:7.52  	30日:48.54 	60日:48.54 	120日:69.10 	250日:69.85 		,当前价：6.62	,当前：2022-04-20 11:51:43
        lvYou_zaiXianLvYou.put("000069", "华侨城Ａ");//227	房地产开发   -3.59	572.49	0.95	价格区间: 5日:5.77  	10日:5.77  	20日:39.69 	30日:52.24 	60日:44.91 	120日:44.91 	250日:27.83 		,当前价：6.98	,当前：2022-04-20 11:51:44
        lvYou_zaiXianLvYou.put("600138", "中青旅  ");//191	旅游酒店     2.06	85.99	1   	价格区间: 5日:34.71 	10日:25.93 	20日:25.93 	30日:45.95 	60日:44.48 	120日:60.31 	250日:64.29 		,当前价：11.88	,当前：2022-04-20 11:51:45
    }

    /**
     * lvYou_mianShui ["免税概念"]：22;
     */
    public static Map<String, String> lvYou_mianShui = new HashMap<>();

    static {
        lvYou_mianShui.put("600338", "西藏珠峰");//376	有色金属     -2.23	216.12	2.34	价格区间: 5日:27.62 	10日:10.68 	20日:6.76  	30日:4.94  	60日:3.90  	120日:2.97  	250日:33.25 		,当前价：23.64	,当前：2022-04-15 10:00:02
        lvYou_mianShui.put("000524", "岭南控股");//354	旅游酒店     0.95	78.68	2.01	价格区间: 5日:16.23 	10日:26.00 	20日:22.73 	30日:42.58 	60日:54.05 	120日:58.58 	250日:58.58 		,当前价：11.74	,当前：2022-04-15 10:00:04
        lvYou_mianShui.put("000796", "凯撒旅业");//328	旅游酒店     -1.08	88.01	2.16	价格区间: 5日:9.26  	10日:29.80 	20日:33.78 	30日:47.08 	60日:57.54 	120日:62.48 	250日:63.65 		,当前价：10.96	,当前：2022-04-15 10:00:05
        lvYou_mianShui.put("002707", "众信旅游");//280	旅游酒店     -0.93	67.62	1.8 	价格区间: 5日:46.59 	10日:46.59 	20日:64.12 	30日:77.62 	60日:55.97 	120日:68.46 	250日:72.26 		,当前价：7.46	,当前：2022-04-15 10:00:08
        lvYou_mianShui.put("001979", "招商蛇口");//274	房地产开发   5.58	1394.49	2.74	价格区间: 5日:89.63 	10日:90.51 	20日:93.91 	30日:95.10 	60日:95.10 	120日:96.65 	250日:96.77 		,当前价：17.6	,当前：2022-04-15 10:00:09
        lvYou_mianShui.put("601888", "中国中免");//251	旅游酒店     -0.63	3523.05	2.74	价格区间: 5日:86.19 	10日:86.19 	20日:86.19 	30日:49.93 	60日:34.69 	120日:22.83 	250日:13.95 		,当前价：180.44	,当前：2022-04-15 10:00:10
        lvYou_mianShui.put("002251", "步步高  ");//251	商业百货     9.97	87.69	44.91	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：10.15	,当前：2022-04-15 10:00:12
        lvYou_mianShui.put("002163", "海南发展");//247	玻璃玻纤     -1.56	91.52	1.88	价格区间: 5日:9.09  	10日:43.14 	20日:43.52 	30日:46.79 	60日:46.79 	120日:43.21 	250日:17.32 		,当前价：11.39	,当前：2022-04-15 10:00:13
        lvYou_mianShui.put("000861", "海印股份");//233	综合行业     1.27	73.96	2.29	价格区间: 5日:31.43 	10日:16.42 	20日:15.71 	30日:43.27 	60日:54.26 	120日:67.58 	250日:70.20 		,当前价：3.18	,当前：2022-04-15 10:00:14
        lvYou_mianShui.put("600009", "上海机场");//229	航空机场     0.56	1007.61	1.53	价格区间: 5日:79.01 	10日:79.01 	20日:81.16 	30日:59.72 	60日:50.04 	120日:57.63 	250日:64.13 		,当前价：52.29	,当前：2022-04-15 10:00:14
    }



    /**
     * lvYou_hangKongJiChang 航空机场
     */
    public static Map<String, String> lvYou_hangKongJiChang = new HashMap<>();

    static {
        lvYou_hangKongJiChang.put("600004", "白云机场");//230	航空机场	3.84	301.05	2.56	价格区间: 5日:90.43 	10日:65.82 	20日:71.43 	30日:51.24 	60日:42.75 	120日:50.89 	250日:67.11 		,当前价：12.72	,当前：2022-04-01 11:39:04
        lvYou_hangKongJiChang.put("601111", "中国国航");//224	航空机场	4.94	1388.57	2.28	价格区间: 5日:87.50 	10日:73.04 	20日:73.82 	30日:62.95 	60日:46.23 	120日:55.91 	250日:68.16 		,当前价：9.56	,当前：2022-04-01 11:39:05
        lvYou_hangKongJiChang.put("002928", "华夏航空");//223	航空机场	1.36	105.72	2.56	价格区间: 5日:43.75 	10日:37.23 	20日:32.84 	30日:18.23 	60日:14.93 	120日:14.93 	250日:17.28 		,当前价：10.43	,当前：2022-04-01 11:39:07
        lvYou_hangKongJiChang.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:91.75 	10日:66.73 	20日:56.71 	30日:47.23 	60日:39.57 	120日:48.75 	250日:54.94 		,当前价：50.49	,当前：2022-04-01 11:39:08
    }

    /**
     * lvYou 旅游
     */
    public static Map<String, String> lvYou = new HashMap<>();

    static {
        lvYou.putAll(lvYou_zaiXianLvYou);//在线旅游
        lvYou.putAll(lvYou_mianShui);//免税概念

        lvYou.putAll(lvYou_hangKongJiChang);//航空机场
    }

    /**
     * yuZhiCaiGaiNian ["预制菜概念"]：16;
     */
    public static Map<String, String> shiPin_yuZhiCai = new HashMap<>();

    static {
        shiPin_yuZhiCai.put("605089", "味知香  ");//350	食品饮料     -2.3	66.80	2.73	价格区间: 5日:34.19 	10日:63.79 	20日:63.79 	30日:68.17 	60日:37.80 	120日:26.79 	250日:26.05 		,当前价：66.8	,当前：2022-04-21 11:38:45
        shiPin_yuZhiCai.put("000524", "岭南控股");//337	旅游酒店     -8.92	67.76	3.62	价格区间: 5日:0.53  	10日:0.26  	20日:0.26  	30日:18.80 	60日:35.02 	120日:41.42 	250日:41.42 		,当前价：10.11	,当前：2022-04-21 11:38:47
        shiPin_yuZhiCai.put("002251", "步步高  ");//308	商业百货     5.93	104.96	7.76	价格区间: 5日:96.53 	10日:97.91 	20日:98.00 	30日:98.07 	60日:98.07 	120日:98.07 	250日:98.07 		,当前价：12.15	,当前：2022-04-21 11:38:48
        shiPin_yuZhiCai.put("603345", "安井食品");//268	食品饮料     -3.31	355.87	2.93	价格区间: 5日:37.08 	10日:70.57 	20日:70.57 	30日:70.57 	60日:41.75 	120日:18.43 	250日:12.07 		,当前价：121.33	,当前：2022-04-21 11:38:49
        shiPin_yuZhiCai.put("002124", "天邦股份");//267	农牧饲渔     -2.26	159.09	2.68	价格区间: 5日:13.16 	10日:43.10 	20日:54.79 	30日:73.53 	60日:73.60 	120日:73.60 	250日:58.41 		,当前价：8.65	,当前：2022-04-21 11:38:50
        shiPin_yuZhiCai.put("002481", "双塔食品");//253	食品饮料     -4.09	116.75	3.49	价格区间: 5日:54.78 	10日:72.16 	20日:72.16 	30日:74.37 	60日:74.37 	120日:56.13 	250日:30.25 		,当前价：9.39	,当前：2022-04-21 11:38:51
    }

    /**
     * shiPin_sheQuTuanGou ["社区团购"]：18;
     */
    public static Map<String, String> shiPin_sheQuTuanGou = new HashMap<>();

    static {
        shiPin_sheQuTuanGou.put("002251", "步步高  ");//297	商业百货     9.97	99.09	13.55	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：11.47	,当前：2022-04-20 11:12:23
        shiPin_sheQuTuanGou.put("000607", "华媒控股");//282	文化传媒     -0.19	53.73	0.81	价格区间: 5日:60.71 	10日:19.32 	20日:19.32 	30日:22.40 	60日:21.66 	120日:44.36 	250日:47.33 		,当前价：5.28	,当前：2022-04-20 11:12:24
        shiPin_sheQuTuanGou.put("600327", "大东方  ");//250	汽车服务     -0.16	53.97	3.33	价格区间: 5日:87.23 	10日:68.57 	20日:27.91 	30日:24.12 	60日:34.63 	120日:41.02 	250日:44.33 		,当前价：6.1	,当前：2022-04-20 11:12:25
        shiPin_sheQuTuanGou.put("002183", "怡亚通  ");//233	物流行业     -2.13	143.35	1.26	价格区间: 5日:73.13 	10日:77.65 	20日:80.41 	30日:83.90 	60日:69.72 	120日:42.31 	250日:31.78 		,当前价：5.52	,当前：2022-04-20 11:12:26
    }

    /**
     * shiPin_ruYe ["乳业"]：14;
     */
    public static Map<String, String> shiPin_ruYe = new HashMap<>();

    static {
        shiPin_ruYe.put("605337", "李子园  ");//302	食品饮料     4.14	76.89	0.84	价格区间: 5日:91.83 	10日:95.95 	20日:95.95 	30日:95.95 	60日:47.19 	120日:31.86 	250日:19.78 		,当前价：35.48	,当前：2022-04-20 11:11:02
        shiPin_ruYe.put("605388", "均瑶健康");//295	食品饮料     -2.03	85.01	5.98	价格区间: 5日:67.31 	10日:84.13 	20日:52.17 	30日:59.16 	60日:60.16 	120日:45.31 	250日:25.73 		,当前价：19.77	,当前：2022-04-20 11:11:04
        shiPin_ruYe.put("002557", "洽洽食品");//272	食品饮料     2.28	293.55	0.96	价格区间: 5日:98.79 	10日:99.16 	20日:99.41 	30日:99.57 	60日:97.73 	120日:72.18 	250日:79.47 		,当前价：57.9	,当前：2022-04-20 11:11:05
        shiPin_ruYe.put("002385", "大北农  ");//268	农牧饲渔     0.11	379.34	2.45	价格区间: 5日:76.30 	10日:78.52 	20日:80.25 	30日:85.52 	60日:67.74 	120日:45.65 	250日:53.70 		,当前价：9.16	,当前：2022-04-20 11:11:07
        shiPin_ruYe.put("600882", "妙可蓝多");//253	食品饮料     -0.37	178.45	1.41	价格区间: 5日:93.07 	10日:93.82 	20日:83.89 	30日:85.28 	60日:25.54 	120日:17.57 	250日:10.95 		,当前价：34.57	,当前：2022-04-20 11:11:08
        shiPin_ruYe.put("002505", "鹏都农牧");//241	贸易行业     1.22	210.99	0.76	价格区间: 5日:92.50 	10日:84.09 	20日:51.39 	30日:42.53 	60日:42.53 	120日:24.50 	250日:52.50 		,当前价：3.31	,当前：2022-04-20 11:11:09
        shiPin_ruYe.put("601515", "东风股份");//232	包装材料     -0.14	107.66	0.67	价格区间: 5日:38.46 	10日:51.58 	20日:64.89 	30日:73.26 	60日:46.84 	120日:32.06 	250日:37.18 		,当前价：7.01	,当前：2022-04-20 11:11:10
    }

    /**
     * shiPin_renZaoRou ["人造肉"]：6;
     */
    public static Map<String, String> shiPin_renZaoRou = new HashMap<>();

    static {
        shiPin_renZaoRou.put("002810", "山东赫达");//274	化学制品     -4.64	127.51	3.37	价格区间: 5日:35.53 	10日:17.45 	20日:17.41 	30日:9.13  	60日:8.57  	120日:6.61  	250日:10.85 		,当前价：37.22	,当前：2022-04-15 10:55:19
        shiPin_renZaoRou.put("002481", "双塔食品");//234	食品饮料     2.31	110.16	11.51	价格区间: 5日:86.89 	10日:86.89 	20日:73.27 	30日:75.73 	60日:49.32 	120日:49.32 	250日:26.58 		,当前价：8.86	,当前：2022-04-15 10:55:21
    }
    /**
     * shiPin_tiaoWeiPin ["调味品概念"]：19;
     */
    public static Map<String, String> shiPin_tiaoWeiPin = new HashMap<>();

    static {
        shiPin_tiaoWeiPin.put("600328", "中盐化工");//339	化学原料     0.05	187.99	0.29	价格区间: 5日:37.77 	10日:65.10 	20日:68.35 	30日:75.15 	60日:75.15 	120日:64.54 	250日:49.89 		,当前价：19.63	,当前：2022-04-20 10:38:57
        shiPin_tiaoWeiPin.put("000505", "京粮控股");//337	农牧饲渔     5.26	91.60	2.03	价格区间: 5日:75.21 	10日:80.86 	20日:73.08 	30日:79.03 	60日:80.19 	120日:80.27 	250日:80.27 		,当前价：12.6	,当前：2022-04-20 10:38:58
        shiPin_tiaoWeiPin.put("002053", "云南能投");//327	化学原料     -0.5	91.47	0.73	价格区间: 5日:55.84 	10日:24.02 	20日:4.59  	30日:16.15 	60日:26.80 	120日:30.88 	250日:35.99 		,当前价：12.02	,当前：2022-04-20 10:39:00
        shiPin_tiaoWeiPin.put("002539", "云图控股");//324	化肥行业     -2.15	155.96	1.71	价格区间: 5日:79.51 	10日:80.39 	20日:85.88 	30日:88.24 	60日:88.24 	120日:61.23 	250日:47.98 		,当前价：15.44	,当前：2022-04-20 10:39:01
    }

    /**
     * shiPin_daiTang ["代糖概念"]：7;
     */
    public static Map<String, String> shiPin_daiTang = new HashMap<>();

    static {
        shiPin_daiTang.put("605300", "佳禾食品");//275	食品饮料     -1.22	64.76	1.03	价格区间: 5日:88.31 	10日:72.02 	20日:52.08 	30日:52.08 	60日:20.64 	120日:16.14 	250日:13.89 		,当前价：16.19	,当前：2022-04-20 10:41:22
        shiPin_daiTang.put("002597", "金禾实业");//255	食品饮料     1.6 	223.75	1.52	价格区间: 5日:78.33 	10日:82.72 	20日:74.94 	30日:87.40 	60日:68.94 	120日:36.01 	250日:47.11 		,当前价：39.89	,当前：2022-04-20 10:41:23
    }

    /**
     * shiPin_chaoJiPinPai
     */
    public static Map<String, String> shiPin_chaoJiPinPai = new HashMap<>();

    static {

    }
    /**
     * shiPin_jiRou ["鸡肉概念"]：13;
     */
    public static Map<String, String> shiPin_jiRou = new HashMap<>();

    static {
        shiPin_jiRou.put("603477", "巨星农牧");//366	农牧饲渔     -4.72	103.19	3.75	价格区间: 5日:2.38  	10日:2.38  	20日:1.96  	30日:12.93 	60日:30.04 	120日:51.75 	250日:57.64 		,当前价：20.39	,当前：2022-04-21 11:37:26
        shiPin_jiRou.put("002746", "仙坛股份");//272	农牧饲渔     -3.34	84.59	5.45	价格区间: 5日:70.09 	10日:70.09 	20日:70.09 	30日:72.08 	60日:47.01 	120日:62.57 	250日:63.35 		,当前价：9.83	,当前：2022-04-21 11:37:27
        shiPin_jiRou.put("002100", "天康生物");//264	农牧饲渔     -5.18	146.24	2.39	价格区间: 5日:4.28  	10日:4.28  	20日:3.23  	30日:20.00 	60日:23.81 	120日:49.90 	250日:61.60 		,当前价：10.8	,当前：2022-04-21 11:37:29
        shiPin_jiRou.put("002567", "唐人神  ");//241	农牧饲渔     -5.56	106.49	3.88	价格区间: 5日:8.37  	10日:8.37  	20日:6.88  	30日:17.63 	60日:32.55 	120日:51.69 	250日:55.38 		,当前价：8.83	,当前：2022-04-21 11:37:30
        shiPin_jiRou.put("002234", "民和股份");//229	农牧饲渔     -6.9	62.64	2.96	价格区间: 5日:13.20 	10日:22.97 	20日:43.56 	30日:54.88 	60日:54.88 	120日:54.88 	250日:58.65 		,当前价：17.95	,当前：2022-04-21 11:37:31
        shiPin_jiRou.put("000876", "新希望  ");//227	农牧饲渔     -3.78	710.90	3.2 	价格区间: 5日:33.33 	10日:33.33 	20日:27.27 	30日:56.97 	60日:48.24 	120日:45.78 	250日:60.66 		,当前价：15.78	,当前：2022-04-21 11:37:32
    }
    /**
     * shiPin 食品: 预制菜概念,社区团购,调味品概念
     */
    public static Map<String, String> shiPin = new HashMap<>();

    static {
        shiPin.putAll(shiPin_yuZhiCai);
        shiPin.putAll(shiPin_tiaoWeiPin);
        shiPin.putAll(shiPin_sheQuTuanGou);
        shiPin.putAll(shiPin_ruYe);//乳业
        shiPin.putAll(shiPin_renZaoRou);//人造肉
        shiPin.putAll(shiPin_daiTang);
        shiPin.putAll(shiPin_chaoJiPinPai);
        shiPin.putAll(shiPin_jiRou);//鸡肉概念
    }

    /**
     * jiuShui_baiJiu ["白酒"]：37;
     */
    public static Map<String, String> jiuShui_baiJiu = new HashMap<>();

    static {
        jiuShui_baiJiu.put("600199", "金种子酒");//427	酿酒行业     0.54	183.39	0.85	价格区间: 5日:50.47 	10日:74.56 	20日:69.81 	30日:52.81 	60日:75.25 	120日:75.25 	250日:75.99 		,当前价：27.88	,当前：2022-04-20 10:22:11
        jiuShui_baiJiu.put("600238", "海南椰岛");//373	酿酒行业     1.11	65.03	0.45	价格区间: 5日:43.16 	10日:68.05 	20日:69.75 	30日:72.73 	60日:42.92 	120日:27.93 	250日:23.73 		,当前价：14.51	,当前：2022-04-20 10:22:12
//        jiuShui_baiJiu.put("600771", "广誉远  ");//336	中药         2.25	158.42	0.18	价格区间: 5日:62.16 	10日:26.73 	20日:16.62 	30日:32.15 	60日:34.96 	120日:24.62 	250日:41.68 		,当前价：32.2	,当前：2022-04-20 10:22:14
        jiuShui_baiJiu.put("600702", "舍得酒业");//316	酿酒行业     0.05	509.99	0.81	价格区间: 5日:33.62 	10日:57.73 	20日:32.94 	30日:25.04 	60日:20.14 	120日:11.16 	250日:38.74 		,当前价：153.58	,当前：2022-04-20 10:22:15
//        jiuShui_baiJiu.put("600395", "盘江股份");//312	煤炭行业     -3.9	185.25	1.18	价格区间: 5日:7.41  	10日:12.28 	20日:23.95 	30日:46.09 	60日:52.04 	120日:52.04 	250日:39.60 		,当前价：8.63	,当前：2022-04-20 10:22:16
        jiuShui_baiJiu.put("600381", "青海春天");//297	食品饮料     2.73	103.91	3.57	价格区间: 5日:28.23 	10日:35.06 	20日:62.83 	30日:71.86 	60日:78.46 	120日:79.32 	250日:80.25 		,当前价：17.7	,当前：2022-04-20 10:22:17
        jiuShui_baiJiu.put("603198", "迎驾贡酒");//290	酿酒行业     2.3 	463.36	0.48	价格区间: 5日:82.96 	10日:89.05 	20日:78.54 	30日:39.17 	60日:30.01 	120日:29.66 	250日:55.22 		,当前价：57.92	,当前：2022-04-20 10:22:18
    }

    /**
     * jiuShui_piJiu ["啤酒概念"]：6;
     */
    public static Map<String, String> jiuShui_piJiu = new HashMap<>();

    static {
        jiuShui_piJiu.put("600132", "重庆啤酒");//278	酿酒行业     -0.67	588.94	0.37	价格区间: 5日:63.38 	10日:82.16 	20日:84.80 	30日:84.80 	60日:53.82 	120日:34.57 	250日:22.41 		,当前价：121.69	,当前：2022-04-20 10:20:10
        jiuShui_piJiu.put("000993", "闽东电力");//273	电力行业     -0.57	56.28	13.75	价格区间: 5日:70.95 	10日:71.98 	20日:71.98 	30日:74.46 	60日:74.46 	120日:27.73 	250日:45.18 		,当前价：12.29	,当前：2022-04-20 10:20:12
        jiuShui_piJiu.put("600108", "亚盛集团");//252	农牧饲渔     -0.75	77.29	2.53	价格区间: 5日:86.05 	10日:69.64 	20日:72.13 	30日:85.05 	60日:86.44 	120日:87.30 	250日:90.18 		,当前价：3.97	,当前：2022-04-20 10:20:13
        jiuShui_piJiu.put("600600", "青岛啤酒");//237	酿酒行业     -1.57	1135.42	0.37	价格区间: 5日:58.72 	10日:86.53 	20日:86.53 	30日:52.83 	60日:38.32 	120日:32.56 	250日:26.06 		,当前价：83.22	,当前：2022-04-20 10:20:14
    }

    /**
     * jiuShui 酒水
     */
    public static Map<String, String> jiuShui = new HashMap<>();

    static {
        jiuShui.putAll(jiuShui_baiJiu);
        jiuShui.putAll(jiuShui_piJiu);//啤酒概念
    }




    /**
     * wuLiu_kuaiDi ["快递概念"]：23;
     */
    public static Map<String, String> wuLiu_kuaiDi = new HashMap<>();

    static {
        wuLiu_kuaiDi.put("002210", "飞马国际");//291	物流行业     -0.34	77.44	0.36	价格区间: 5日:6.45  	10日:16.35 	20日:19.44 	30日:19.44 	60日:19.44 	120日:16.39 	250日:26.30 		,当前价：2.91	,当前：2022-04-20 11:56:40
        wuLiu_kuaiDi.put("600153", "建发股份");//268	贸易行业     -2.15	391.14	0.93	价格区间: 5日:20.25 	10日:43.97 	20日:67.90 	30日:77.51 	60日:77.70 	120日:82.57 	250日:83.57 		,当前价：13.66	,当前：2022-04-20 11:56:42
        wuLiu_kuaiDi.put("603056", "德邦股份");//253	物流行业     -0.43	143.36	0.53	价格区间: 5日:34.17 	10日:15.65 	20日:4.71  	30日:29.51 	60日:31.20 	120日:34.41 	250日:34.98 		,当前价：13.96	,当前：2022-04-20 11:56:43
        wuLiu_kuaiDi.put("002120", "韵达股份");//243	物流行业     -0.65	490.28	0.43	价格区间: 5日:10.47 	10日:41.67 	20日:39.29 	30日:25.17 	60日:18.06 	120日:14.49 	250日:40.07 		,当前价：16.89	,当前：2022-04-20 11:56:44
        wuLiu_kuaiDi.put("600233", "圆通速递");//238	物流行业     -0.43	562.41	0.45	价格区间: 5日:28.95 	10日:67.86 	20日:49.42 	30日:42.01 	60日:42.01 	120日:51.63 	250日:70.84 		,当前价：16.37	,当前：2022-04-20 11:56:45
        wuLiu_kuaiDi.put("600787", "中储股份");//235	物流行业     1.56	129.13	0.49	价格区间: 5日:27.62 	10日:32.29 	20日:34.67 	30日:40.09 	60日:40.09 	120日:38.67 	250日:37.13 		,当前价：5.87	,当前：2022-04-20 11:56:47
        wuLiu_kuaiDi.put("002183", "怡亚通  ");//233	物流行业     -1.24	144.65	0.75	价格区间: 5日:82.09 	10日:84.71 	20日:86.60 	30日:88.98 	60日:73.94 	120日:44.87 	250日:33.42 		,当前价：5.57	,当前：2022-04-20 11:56:47
    }

    /**
     * wuLiu_tongYiDaShiChang ["统一大市场"]：11;
     */
    public static Map<String, String> wuLiu_tongYiDaShiChang = new HashMap<>();

    static {
        wuLiu_tongYiDaShiChang.put("002314", "南山控股");//339	房地产开发   -5.86	121.85	0.66	价格区间: 5日:7.69  	10日:3.10  	20日:25.15 	30日:33.33 	60日:33.33 	120日:41.86 	250日:41.86 		,当前价：4.5	,当前：2022-04-20 11:46:37
        wuLiu_tongYiDaShiChang.put("002210", "飞马国际");//291	物流行业     -0.34	77.44	0.36	价格区间: 5日:6.45  	10日:16.35 	20日:19.44 	30日:19.44 	60日:19.44 	120日:16.39 	250日:26.30 		,当前价：2.91	,当前：2022-04-20 11:46:38
        wuLiu_tongYiDaShiChang.put("600787", "中储股份");//235	物流行业     1.56	129.13	0.49	价格区间: 5日:27.62 	10日:32.29 	20日:34.67 	30日:40.09 	60日:40.09 	120日:38.67 	250日:37.13 		,当前价：5.87	,当前：2022-04-20 11:46:39
        wuLiu_tongYiDaShiChang.put("002183", "怡亚通  ");//233	物流行业     -1.24	144.65	0.75	价格区间: 5日:82.09 	10日:84.71 	20日:86.60 	30日:88.98 	60日:73.94 	120日:44.87 	250日:33.42 		,当前价：5.57	,当前：2022-04-20 11:46:40
        wuLiu_tongYiDaShiChang.put("000582", "北部湾港");//227	航运港口     -0.12	139.50	0.94	价格区间: 5日:6.59  	10日:12.90 	20日:18.49 	30日:24.34 	60日:24.34 	120日:24.34 	250日:24.34 		,当前价：8.26	,当前：2022-04-20 11:46:42
        wuLiu_tongYiDaShiChang.put("600603", "广汇物流");//213	房地产开发   0   	57.57	1.16	价格区间: 5日:10.53 	10日:31.45 	20日:39.07 	30日:43.52 	60日:43.52 	120日:43.52 	250日:43.52 		,当前价：4.58	,当前：2022-04-20 11:46:42
        wuLiu_tongYiDaShiChang.put("002010", "传化智联");//213	物流行业     0.16	195.96	0.56	价格区间: 5日:32.94 	10日:22.76 	20日:22.76 	30日:21.54 	60日:10.77 	120日:7.53  	250日:14.09 		,当前价：6.38	,当前：2022-04-20 11:46:43
        wuLiu_tongYiDaShiChang.put("001213", "中铁特货");//206	物流行业     0.38	236.89	0.38	价格区间: 5日:14.47 	10日:10.00 	20日:14.29 	30日:16.28 	60日:16.28 	120日:9.66  	250日:13.06 		,当前价：5.33	,当前：2022-04-20 11:46:44
    }

    /**
     * wuLiu_haiYangJingJi ["海洋经济"]：17;
     */
    public static Map<String, String> wuLiu_haiYangJingJi = new HashMap<>();

    static {
        wuLiu_haiYangJingJi.put("002639", "雪人股份");//375	通用设备     -0.65	94.72	2.02	价格区间: 5日:65.00 	10日:37.14 	20日:32.21 	30日:53.81 	60日:53.81 	120日:45.24 	250日:47.90 		,当前价：12.26	,当前：2022-04-20 11:16:36
        wuLiu_haiYangJingJi.put("600522", "中天科技");//344	通信设备     -2.09	511.26	0.86	价格区间: 5日:39.79 	10日:38.00 	20日:16.63 	30日:14.08 	60日:14.89 	120日:52.30 	250日:58.73 		,当前价：14.98	,当前：2022-04-20 11:16:37
        wuLiu_haiYangJingJi.put("600026", "中远海能");//319	航运港口     2.23	370.54	1.2 	价格区间: 5日:91.67 	10日:94.96 	20日:97.11 	30日:97.13 	60日:97.67 	120日:97.67 	250日:97.67 		,当前价：7.78	,当前：2022-04-20 11:16:39
        wuLiu_haiYangJingJi.put("601919", "中远海控");//274	航运港口     1.13	2432.55	2.87	价格区间: 5日:63.44 	10日:41.84 	20日:23.98 	30日:17.88 	60日:14.50 	120日:13.36 	250日:28.89 		,当前价：15.19	,当前：2022-04-20 11:16:40
        wuLiu_haiYangJingJi.put("601890", "亚星锚链");//270	船舶制造     -1.01	75.12	0.59	价格区间: 5日:21.21 	10日:59.38 	20日:59.38 	30日:58.02 	60日:22.22 	120日:36.06 	250日:50.19 		,当前价：7.83	,当前：2022-04-20 11:16:40
    }

    /**
     * wuLiu_rcep ["RCEP概念"]：13;
     */
    public static Map<String, String> wuLiu_rcep = new HashMap<>();

    static {
        wuLiu_rcep.put("000811", "冰轮环境");//287	通用设备     0.84	80.92	1.92	价格区间: 5日:41.86 	10日:36.73 	20日:23.15 	30日:22.86 	60日:12.24 	120日:11.52 	250日:37.50 		,当前价：10.85	,当前：2022-04-12 13:51:45
        wuLiu_rcep.put("002803", "吉宏股份");//277	文化传媒     -0.61	50.41	1.17	价格区间: 5日:14.00 	10日:12.21 	20日:19.25 	30日:19.25 	60日:5.38  	120日:5.38  	250日:3.30  		,当前价：13.01	,当前：2022-04-12 13:51:47
        wuLiu_rcep.put("002612", "朗姿股份");//244	纺织服装     -0.57	91.98	1.73	价格区间: 5日:16.50 	10日:13.51 	20日:11.65 	30日:7.29  	60日:5.82  	120日:3.11  	250日:1.31  		,当前价：20.79	,当前：2022-04-12 13:51:48
        wuLiu_rcep.put("000582", "北部湾港");//239	航运港口     10   	186.86	8.54	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：11.44	,当前：2022-04-12 13:51:49
        wuLiu_rcep.put("603565", "中谷物流");//236	航运港口     -1.6	253.21	2.92	价格区间: 5日:45.39 	10日:38.78 	20日:64.35 	30日:38.87 	60日:28.60 	120日:28.60 	250日:22.37 		,当前价：26.41	,当前：2022-04-12 13:51:50
        wuLiu_rcep.put("600190", "锦州港  ");//231	航运港口     6.68	83.10	2.66	价格区间: 5日:85.71 	10日:86.67 	20日:32.91 	30日:32.55 	60日:50.69 	120日:51.85 	250日:51.85 		,当前价：4.15	,当前：2022-04-12 13:51:51
    }

    /**
     * wuLiu_zhongEMaoYi ["中俄贸易概念"]：11;
     */
    public static Map<String, String> wuLiu_zhongEMaoYi = new HashMap<>();

    static {
        wuLiu_zhongEMaoYi.put("002758", "浙农股份");//265	综合行业     3.94	76.91	2.11	价格区间: 5日:66.50 	10日:39.71 	20日:51.96 	30日:35.16 	60日:48.24 	120日:51.91 	250日:55.95 		,当前价：15.3	,当前：2022-04-13 11:39:49
        wuLiu_zhongEMaoYi.put("600251", "冠农股份");//263	农牧饲渔     1.59	84.79	5.21	价格区间: 5日:82.86 	10日:83.33 	20日:86.67 	30日:77.53 	60日:85.71 	120日:85.71 	250日:71.61 		,当前价：10.85	,当前：2022-04-13 11:39:50
        wuLiu_zhongEMaoYi.put("600798", "宁波海运");//260	航运港口     -1.47	64.55	7   	价格区间: 5日:63.92 	10日:70.83 	20日:76.03 	30日:57.81 	60日:66.25 	120日:66.25 	250日:66.25 		,当前价：5.35	,当前：2022-04-13 11:39:52
        wuLiu_zhongEMaoYi.put("002353", "杰瑞股份");//259	专用设备     -0.15	382.57	2.26	价格区间: 5日:42.25 	10日:23.81 	20日:20.34 	30日:17.61 	60日:17.61 	120日:16.89 	250日:40.98 		,当前价：39.94	,当前：2022-04-13 11:39:53
        wuLiu_zhongEMaoYi.put("600190", "锦州港  ");//230	航运港口     -1.94	80.89	5.33	价格区间: 5日:62.50 	10日:63.79 	20日:36.45 	30日:20.00 	60日:46.21 	120日:47.47 	250日:47.47 		,当前价：4.04	,当前：2022-04-13 11:39:54
    }

    /**
     * wuLiu_jinKouBoLan ["进口博览"]：11;
     */
    public static Map<String, String> wuLiu_jinKouBoLan = new HashMap<>();

    static {
        wuLiu_jinKouBoLan.put("002183", "怡亚通  ");//233	物流行业     -1.24	144.65	0.75	价格区间: 5日:86.57 	10日:88.24 	20日:89.69 	30日:91.53 	60日:76.06 	120日:46.15 	250日:34.25 		,当前价：5.57	,当前：2022-04-20 13:23:53
        wuLiu_jinKouBoLan.put("600115", "中国东航");//185	航空机场     1.43	939.95	1   	价格区间: 5日:84.00 	10日:92.00 	20日:46.94 	30日:35.38 	60日:27.06 	120日:27.06 	250日:37.06 		,当前价：4.98	,当前：2022-04-20 13:23:54
        wuLiu_jinKouBoLan.put("600655", "豫园股份");//166	珠宝首饰     -0.3	389.82	0.81	价格区间: 5日:37.78 	10日:28.33 	20日:44.38 	30日:61.94 	60日:61.94 	120日:61.94 	250日:25.89 		,当前价：10.02	,当前：2022-04-20 13:23:56
        wuLiu_jinKouBoLan.put("600597", "光明乳业");//150	食品饮料     1.94	166.54	1.34	价格区间: 5日:79.17 	10日:88.46 	20日:88.46 	30日:62.05 	60日:36.34 	120日:26.02 	250日:14.37 		,当前价：12.08	,当前：2022-04-20 13:23:57
    }

    /**
     * wuLiu 物流
     */
    public static Map<String, String> wuLiu = new HashMap<>();

    static {
        wuLiu.putAll(wuLiu_kuaiDi);//快递概念
        wuLiu.putAll(wuLiu_tongYiDaShiChang);//统一大市场
        wuLiu.putAll(wuLiu_haiYangJingJi);//海洋经济
        wuLiu.putAll(wuLiu_rcep);//RCEP概念
        wuLiu.putAll(wuLiu_jinKouBoLan);//RCEP概念
    }

    /**
     * lingShou_tuiShuiShangDian 退税商店
     */
    public static Map<String, String> lingShou_tuiShuiShangDian = new HashMap<>();

    static {
        lingShou_tuiShuiShangDian.put("600828", "茂业商业");//202	商业百货     -6.32	74.48	2.37	价格区间: 5日:26.88 	10日:33.33 	20日:39.29 	30日:57.50 	60日:58.54 	120日:59.76 	250日:59.76 		,当前价：4.3	,当前：2022-04-22 13:52:33
        lingShou_tuiShuiShangDian.put("002187", "广百股份");//181	商业百货     9.96	69.98	2.09	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：9.94	,当前：2022-04-22 13:52:35
        lingShou_tuiShuiShangDian.put("600415", "小商品城");//178	商业百货     1.76	286.10	1.05	价格区间: 5日:34.43 	10日:29.58 	20日:49.49 	30日:58.33 	60日:64.29 	120日:64.29 	250日:55.90 		,当前价：5.21	,当前：2022-04-22 13:52:36
        lingShou_tuiShuiShangDian.put("600655", "豫园股份");//166	珠宝首饰     1.46	377.37	1.12	价格区间: 5日:34.67 	10日:27.08 	20日:16.88 	30日:48.18 	60日:48.18 	120日:48.18 	250日:20.14 		,当前价：9.7	,当前：2022-04-22 13:52:37
        lingShou_tuiShuiShangDian.put("600827", "百联股份");//163	商业百货     1.87	203.75	0.69	价格区间: 5日:33.85 	10日:21.78 	20日:40.08 	30日:51.24 	60日:47.69 	120日:32.61 	250日:11.10 		,当前价：11.42	,当前：2022-04-22 13:52:38
        lingShou_tuiShuiShangDian.put("600814", "杭州解百");//162	商业百货     3.02	57.74	0.98	价格区间: 5日:31.07 	10日:22.38 	20日:26.00 	30日:54.13 	60日:59.34 	120日:66.26 	250日:66.26 		,当前价：7.84	,当前：2022-04-22 13:52:39
        lingShou_tuiShuiShangDian.put("600628", "新世界  ");//88	商业百货     1.14	51.56	1.93	价格区间: 5日:68.84 	10日:68.84 	20日:72.44 	30日:77.60 	60日:77.60 	120日:73.76 	250日:53.19 		,当前价：7.97	,当前：2022-04-22 13:52:40
    }

    /**
     * lingShou_xinLingShou
     */
    public static Map<String, String> lingShou_xinLingShou = new HashMap<>();

    static {
        lingShou_xinLingShou.put("600335", "国机汽车");//376	汽车服务     -6.18	104.02	1.61	价格区间: 5日:9.09  	10日:9.09  	20日:4.22  	30日:17.52 	60日:18.74 	120日:28.07 	250日:36.78 		,当前价：7.14	,当前：2022-04-22 13:59:50
        lingShou_xinLingShou.put("000681", "视觉中国");//341	文化传媒     -2.98	88.90	1.48	价格区间: 5日:16.67 	10日:6.09  	20日:4.45  	30日:4.45  	60日:2.72  	120日:5.73  	250日:12.79 		,当前价：12.69	,当前：2022-04-22 13:59:51
        lingShou_xinLingShou.put("000756", "新华制药");//306	化学制药     -8.61	66.09	5.21	价格区间: 5日:50.97 	10日:59.42 	20日:58.79 	30日:58.79 	60日:58.79 	120日:48.87 	250日:48.87 		,当前价：9.87	,当前：2022-04-22 13:59:52
        lingShou_xinLingShou.put("002251", "步步高  ");//306	商业百货     -6.66	101.77	2.26	价格区间: 5日:68.25 	10日:78.25 	20日:79.74 	30日:80.38 	60日:80.38 	120日:80.38 	250日:80.38 		,当前价：11.78	,当前：2022-04-22 13:59:54
        lingShou_xinLingShou.put("002612", "朗姿股份");//296	纺织服装     0.76	111.10	3.4 	价格区间: 5日:86.61 	10日:88.10 	20日:88.10 	30日:55.96 	60日:51.80 	120日:22.08 	250日:9.33  		,当前价：25.11	,当前：2022-04-22 13:59:55
        lingShou_xinLingShou.put("605499", "东鹏饮料");//296	食品饮料     -0.15	519.21	0.96	价格区间: 5日:40.49 	10日:43.89 	20日:43.89 	30日:21.70 	60日:13.74 	120日:9.74  	250日:34.05 		,当前价：129.8	,当前：2022-04-22 13:59:56
    }
    /**
     * lingShou 零售
     */
    public static Map<String, String> lingShou = new HashMap<>();

    static {
        lingShou.putAll(lingShou_tuiShuiShangDian);//退税商店
        lingShou.putAll(lingShou_xinLingShou);
    }

    /**
     * lingShou_c2m ["C2M概念"]：13;
     */
    public static Map<String, String> lingShou_c2m = new HashMap<>();
    static {
        lingShou_c2m.put("600702", "舍得酒业");//315	酿酒行业     1.8 	502.02	2.73	价格区间: 5日:45.73 	10日:53.22 	20日:27.56 	30日:19.23 	60日:15.47 	120日:8.57  	250日:33.79 		,当前价：151.18	,当前：2022-04-22 14:04:37
        lingShou_c2m.put("002612", "朗姿股份");//296	纺织服装     0.76	111.10	3.4 	价格区间: 5日:86.82 	10日:88.29 	20日:88.29 	30日:56.08 	60日:51.69 	120日:22.03 	250日:9.31  		,当前价：25.11	,当前：2022-04-22 14:04:38
        lingShou_c2m.put("002154", "报喜鸟  ");//253	纺织服装     2.93	61.44	2.67	价格区间: 5日:86.15 	10日:86.76 	20日:86.76 	30日:87.67 	60日:39.02 	120日:28.19 	250日:25.72 		,当前价：4.21	,当前：2022-04-22 14:04:40
        lingShou_c2m.put("002269", "美邦服饰");//242	纺织服装     6.34	54.77	3.67	价格区间: 5日:77.42 	10日:77.42 	20日:64.86 	30日:52.17 	60日:38.10 	120日:23.08 	250日:7.67  		,当前价：2.18	,当前：2022-04-22 14:04:41
    }
    /**
     * fuZhuang 服装
     */
    public static Map<String, String> fuZhuang = new HashMap<>();

    static {
        fuZhuang.putAll(lingShou_c2m);//
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {

        all.putAll(shiPin); //食品
        all.putAll(jiuShui); //酒水
        all.putAll(wuLiu); //物流
        all.putAll(lvYou); //旅游
        all.putAll(lingShou); //零售
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStXiaoFei.all, date);//all nongYe
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.lvYou, date);//all nongYe lvYou
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.shiPin, date);//
    }
}
