package utils;

import ttjj.service.KlineService;
import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：指数
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStZhiShu {
    /**
     * shangzheng_50 上证50_
     */
    public static Map<String, String> shangZheng_50 = new HashMap<>();

    static {
        shangZheng_50.put("600048", "保利发展");//195	房地产开发   -4.44	2033.75	0.97	价格区间: 5日:11.96 	10日:7.07  	20日:14.24 	30日:53.83 	60日:53.83 	120日:63.18 	250日:73.36 		,当前价：16.99	,当前：2022-04-26 00:21:32
        shangZheng_50.put("601088", "中国神华");//193	煤炭行业     -3.33	5702.27	1.13	价格区间: 5日:20.61 	10日:12.47 	20日:31.41 	30日:55.65 	60日:59.16 	120日:70.30 	250日:73.71 		,当前价：28.7	,当前：2022-04-26 00:21:33
        shangZheng_50.put("603259", "药明康德");//183	医疗服务     -3.67	2892.86	1.05	价格区间: 5日:17.79 	10日:13.97 	20日:9.81  	30日:23.69 	60日:42.07 	120日:23.96 	250日:17.70 		,当前价：97.87	,当前：2022-04-26 00:21:35
        shangZheng_50.put("601888", "中国中免");//181	旅游酒店     -1.97	3387.35	1.78	价格区间: 5日:37.14 	10日:56.03 	20日:61.40 	30日:54.72 	60日:25.42 	120日:16.88 	250日:10.22 		,当前价：173.49	,当前：2022-04-26 00:21:36
        shangZheng_50.put("600196", "复星医药");//179	化学制药     0.34	1046.94	1.69	价格区间: 5日:19.62 	10日:14.02 	20日:7.54  	30日:7.79  	60日:16.86 	120日:16.86 	250日:6.73  		,当前价：40.85	,当前：2022-04-26 00:21:37
        shangZheng_50.put("601899", "紫金矿业");//172	贵金属       -6.27	2796.17	1.24	价格区间: 5日:4.92  	10日:3.78  	20日:3.78  	30日:36.21 	60日:36.21 	120日:36.57 	250日:37.26 		,当前价：10.62	,当前：2022-04-26 00:21:37
        shangZheng_50.put("600809", "山西汾酒");//169	酿酒行业     -2.9	3092.99	1.34	价格区间: 5日:17.15 	10日:43.53 	20日:48.34 	30日:39.19 	60日:33.62 	120日:20.93 	250日:16.32 		,当前价：253.5	,当前：2022-04-26 00:21:38
        shangZheng_50.put("601668", "中国建筑");//165	工程建设     -3.74	2378.05	1.03	价格区间: 5日:0.00  	10日:0.00  	20日:47.22 	30日:63.69 	60日:63.69 	120日:66.86 	250日:69.35 		,当前价：5.67	,当前：2022-04-26 00:21:39
        shangZheng_50.put("601857", "中国石油");//164	石油行业     -4.36	9242.56	1.1 	价格区间: 5日:1.75  	10日:1.52  	20日:1.52  	30日:22.62 	60日:15.57 	120日:28.47 	250日:44.40 		,当前价：5.05	,当前：2022-04-26 00:21:40
        shangZheng_50.put("603986", "兆易创新");//164	半导体       -5.38	820.98	1.22	价格区间: 5日:2.38  	10日:5.49  	20日:2.73  	30日:2.24  	60日:2.24  	120日:1.59  	250日:7.79  		,当前价：123.0	,当前：2022-04-26 00:21:40
    }

    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(shangZheng_50);
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStYiLiao.all, date);
    }
}
