package utils;

import ttjj.rank.stat.BizEtfStat;

import java.util.HashMap;
import java.util.Map;

/**
 * ETF
 *
 * @author Administrator
 * @date 2022-08-07 00:01
 */
public class ContMapEtf {
    /**
     * etf-市值-指数-A50
     */
    public static Map<String, String> ETF_MV_ZS_A50 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_ZZ100= new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_HS300 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_ZZ500 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_KCB = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_CYB = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_ZS180 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_HG = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_MG = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_ZS1000 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_SZ100 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_SC = new HashMap<>();

    static {
        ETF_MV_ZS_A50.put("510050", "上证50ETF");//上证50ETF
    }
    static {
        ETF_MV_ZS_ZZ100.put("562000", "华宝中证100ETF");//华宝中证100ETF
    }
    static {
        ETF_MV_ZS_ZS180.put("510180", "上证180ETF");//上证180ETF
    }
    static {
        ETF_MV_ZS_HS300.put("510300", "沪深300ETF");//沪深300ETF
//        ETF_MV_ZS_HS300.put("510330", "209.41");//300ETF基金
//        ETF_MV_ZS_HS300.put("159919", "181.46");//沪深300ETF
//        ETF_MV_ZS_HS300.put("510310", "107.57");//沪深300ETF易方达
//        ETF_MV_ZS_HS300.put("515330", "63.93");//300ETF天弘
//        ETF_MV_ZS_HS300.put("515380", "37.87");//泰康沪深300ETF
//        ETF_MV_ZS_HS300.put("510350", "28.41");//工银沪深300ETF
//        ETF_MV_ZS_HS300.put("517300", "22.03");//沪港深300ETF
//        ETF_MV_ZS_HS300.put("159925", "16.93");//沪深300ETF南方
//        ETF_MV_ZS_HS300.put("510360", "15.56");//沪深300ETF基金
//        ETF_MV_ZS_HS300.put("561300", "13.28");//300增强ETF
//        ETF_MV_ZS_HS300.put("510380", "12.34");//国寿300ETF
    }

    static {
        ETF_MV_ZS_ZZ500.put("510500", "中证500ETF");//中证500ETF
//        ETF_MV_ZS_ZZ500.put("512500", "38.78");//500ETF基金
//        ETF_MV_ZS_ZZ500.put("159922", "30.08");//中证500ETF嘉实
//        ETF_MV_ZS_ZZ500.put("510510", "26.55");//中证500ETF基金
//        ETF_MV_ZS_ZZ500.put("159820", "23.91");//中证500ETF天弘
//        ETF_MV_ZS_ZZ500.put("510580", "20.17");//中证500ETF易方达
    }

    static {
        ETF_MV_ZS_ZS1000.put("512100", "中证1000ETF");//中证1000ETF
//        ETF_MV_ZS_ZS1000.put("560010", "87.90");//中证1000ETF指数
//        ETF_MV_ZS_ZS1000.put("159629", "80.96");//1000ETF
//        ETF_MV_ZS_ZS1000.put("159633", "79.32");//中证1000指数ETF
//        ETF_MV_ZS_ZS1000.put("159845", "52.41");//中证1000ETF
//        ETF_MV_ZS_ZS1000.put("515800", "19.78");//800ETF
    }

    static {
        ETF_MV_ZS_KCB.put("588000", "科创50ETF");//科创50ETF
//        ETF_MV_ZS_KCB.put("588080", "134.19");//科创板50ETF
//        ETF_MV_ZS_KCB.put("588050", "47.76");//科创ETF
//        ETF_MV_ZS_KCB.put("588090", "32.56");//科创板ETF
//        ETF_MV_ZS_KCB.put("588180", "16.46");//科创50ETF基金
    }

    static {
        ETF_MV_ZS_CYB.put("159949", "创业板50ETF");//创业板50ETF
//        ETF_MV_ZS_CYB.put("159915", "149.28");//创业板ETF易方达
//        ETF_MV_ZS_CYB.put("159977", "46.14");//创业板ETF天弘
//        ETF_MV_ZS_CYB.put("159948", "22.07");//创业板ETF南方
//        ETF_MV_ZS_CYB.put("588380", "19.12");//创50ETF
//        ETF_MV.put("159952", "18.22");//创业板ETF广发
    }
    static {
        ETF_MV_ZS_SC.put("159781", "双创50ETF");//双创50ETF
//        ETF_MV_ZS_SC.put("159783", "45.56");//双创基金ETF
//        ETF_MV_ZS_SC.put("159780", "32.18");//双创ETF
//        ETF_MV_ZS_SC.put("588400", "18.82");//双创50ETF
//        ETF_MV_ZS_SC.put("588300", "15.63");//双创ETF
    }



    static {
        ETF_MV_ZS_HG.put("159920", "恒生ETF");//恒生ETF
//        ETF_MV_ZS_HG.put("510900", "89.48");//H股ETF
    }

    static {
        ETF_MV_ZS_MG.put("159941", "纳指ETF");//纳指ETF
//        ETF_MV_ZS_MG.put("513500", "74.38");//标普500ETF
//        ETF_MV_ZS_MG.put("513100", "52.02");//纳指ETF
//        ETF_MV_ZS_MG.put("513300", "12.09");//纳斯达克ETF
    }


    static {
        ETF_MV_ZS_SZ100.put("159901", "深证100ETF易方达");//深证100ETF易方达
    }



    /**
     * etf-市值-指数
     */
    public static Map<String, String> ETF_ZS = new HashMap<>();

    static {
        ETF_ZS.put("512100", "中证1000ETF");		//103.53	0.19
        ETF_ZS.put("510500", "中证500ETF");		//375.91	0.17
//        ETF_ZS.put("159901", "深证100ETF易方达");		//65.12	-0.12
        ETF_ZS.put("510300", "沪深300ETF");		//434.68	-0.24
        ETF_ZS.put("510050", "上证50ETF");		//492.63	-0.5
        ETF_ZS.put("159949", "创业板50ETF");		//89.61	-0.51
        ETF_ZS.put("159920", "恒生ETF");		//136.84	-0.54
        ETF_ZS.put("159941", "纳指ETF");		//120.13	-0.72
//        ETF_ZS.put("513500", "标普500ETF");		//74.86	-0.38
//        ETF_ZS.put("159781", "双创50ETF");		//63.51	-0.74
        ETF_ZS.put("588000", "科创50ETF");		//305.66	-1.23
//        ETF_ZS.put("562000", "华宝中证100ETF");		//5.05	-0.41
//        ETF_ZS.put("510180", "上证180ETF");		//199.61	-0.36

//        ETF_ZS.putAll(ETF_MV_ZS_A50);
//        ETF_ZS.putAll(ETF_MV_ZS_ZZ100);
//        ETF_ZS.putAll(ETF_MV_ZS_HS300);
//        ETF_ZS.putAll(ETF_MV_ZS_ZZ500);
//        ETF_ZS.putAll(ETF_MV_ZS_KCB);
//        ETF_ZS.putAll(ETF_MV_ZS_CYB);
//        ETF_ZS.putAll(ETF_MV_ZS_ZS180);
//        ETF_ZS.putAll(ETF_MV_ZS_HG);
//        ETF_ZS.putAll(ETF_MV_ZS_MG);
//        ETF_ZS.putAll(ETF_MV_ZS_ZS1000);
//        ETF_ZS.putAll(ETF_MV_ZS_SZ100);
//        ETF_ZS.putAll(ETF_MV_ZS_SC);
    }
    public static Map<String, String> ZHISHU_MORE = new HashMap<>();//指数
    static {
        ZHISHU_MORE.put("513080", "法国CAC40ETF    ");//1    513080  法国CAC40ETF    4.08%     0.64          2022-07-25    2022-10-25
        ZHISHU_MORE.put("513030", "德国ETF         ");//2    513030  德国ETF         2.40%     6.11          2022-07-25    2022-10-25
        ZHISHU_MORE.put("513500", "标普500ETF      ");//3    513500  标普500ETF      1.34%     83.39         2022-07-25    2022-10-25
        ZHISHU_MORE.put("159941", "纳指ETF         ");//4    159941  纳指ETF         -1.53%    115.89        2022-07-25    2022-10-25
        ZHISHU_MORE.put("159866", "日经ETF         ");//5    159866  日经ETF         -1.67%    0.70          2022-07-25    2022-10-25
        ZHISHU_MORE.put("159628", "国证2000ETF     ");//6    159628  国证2000ETF     -5.69%    2.80          2022-07-25    2022-10-25
        ZHISHU_MORE.put("510500", "中证500ETF      ");//7    510500  中证500ETF      -6.52%    413.40        2022-07-25    2022-10-25
        ZHISHU_MORE.put("562520", "1000成长ETF     ");//8    562520  1000成长ETF     -6.60%    0.46          2022-07-25    2022-10-25
//        ZHISHU_MORE.put("512750", "基本面50ETF     ");//9    512750  基本面50ETF     -7.46%    1.19          2022-07-25    2022-10-25
        ZHISHU_MORE.put("159966", "创蓝筹ETF       ");//10   159966  创蓝筹ETF       -8.06%    5.06          2022-07-25    2022-10-25
        ZHISHU_MORE.put("510210", "上证指数ETF     ");//11   510210  上证指数ETF     -8.78%    9.44          2022-07-25    2022-10-25
        ZHISHU_MORE.put("512100", "中证1000ETF     ");//12   512100  中证1000ETF     -9.71%    90.60         2022-07-25    2022-10-25
        ZHISHU_MORE.put("159781", "双创50ETF       ");//13   159781  双创50ETF       -10.28%   59.74         2022-07-25    2022-10-25
        ZHISHU_MORE.put("588000", "科创50ETF       ");//14   588000  科创50ETF       -10.33%   313.71        2022-07-25    2022-10-25
        ZHISHU_MORE.put("515800", "800ETF          ");//15   515800  800ETF          -11.97%   17.88         2022-07-25    2022-10-25
        ZHISHU_MORE.put("510180", "上证180ETF      ");//16   510180  上证180ETF      -12.87%   178.40        2022-07-25    2022-10-25
        ZHISHU_MORE.put("510300", "沪深300ETF      ");//17   510300  沪深300ETF      -14.01%   497.17        2022-07-25    2022-10-25
        ZHISHU_MORE.put("159902", "中小100ETF      ");//18   159902  中小100ETF      -14.09%   4.39          2022-07-25    2022-10-25
        ZHISHU_MORE.put("512910", "中证100ETF      ");//19   512910  中证100ETF      -15.21%   3.70          2022-07-25    2022-10-25
        ZHISHU_MORE.put("159915", "创业板ETF       ");//20   159915  创业板ETF       -15.47%   170.75        2022-07-25    2022-10-25
        ZHISHU_MORE.put("510050", "上证50ETF       ");//21   510050  上证50ETF       -15.79%   591.12        2022-07-25    2022-10-25
        ZHISHU_MORE.put("159949", "创业板50ETF     ");//22   159949  创业板50ETF     -16.22%   93.80         2022-07-25    2022-10-25
        ZHISHU_MORE.put("159901", "深证100ETF易方达");//23   159901  深证100ETF易方达-16.49%   56.66         2022-07-25    2022-10-25
//        ZHISHU_MORE.put("510900", "H股ETF          ");//24   510900  H股ETF          -20.95%   75.26         2022-07-25    2022-10-25
        ZHISHU_MORE.put("159920", "恒生ETF         ");//25   159920  恒生ETF         -21.45%   151.72        2022-07-25    2022-10-25
    }
    public static Map<String, String> ZHISHU_ALL= new HashMap<>();//指数-全部-etf
    static {
        ZHISHU_ALL.put("513990", "指数");//1    513990  港股通ETF       -16.03%   0.58          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159954", "指数");//2    159954  H股ETF          -16.09%   2.15          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159712", "指数");//3    159712  港股通50ETF     -16.21%   0.61          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159788", "指数");//4    159788  港股通100ETF    -16.70%   0.34          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510900", "指数");//5    510900  H股ETF          -17.11%   79.18         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159823", "指数");//6    159823  H股ETF基金      -17.70%   0.37          2022-07-21    2022-10-21
        ZHISHU_ALL.put("513550", "指数");//7    513550  港股通50ETF     -17.82%   29.80         2022-07-21    2022-10-21
        ZHISHU_ALL.put("513900", "指数");//8    513900  港股通100ETF    -19.35%   1.95          2022-07-21    2022-10-21

        ZHISHU_ALL.put("513680", "指数");//1    513680  恒生国企ETF     -14.32%   0.26          2022-07-21    2022-10-21
        ZHISHU_ALL.put("513660", "指数");//2    513660  恒生ETF         -14.49%   19.21         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159960", "指数");//3    159960  H股ETF港股通    -14.79%   3.51          2022-07-21    2022-10-21
        ZHISHU_ALL.put("513600", "指数");//6    513600  恒生指数ETF     -14.93%   6.19          2022-07-21    2022-10-21
        ZHISHU_ALL.put("517350", "指数");//14   517350  中概科技ETF     -15.50%   1.10          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159711", "指数");//15   159711  港股通ETF       -15.59%   0.55          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159850", "指数");//12   159850  恒生国企ETF     -17.45%   5.54          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159920", "指数");//14   159920  恒生ETF         -17.58%   150.17        2022-07-21    2022-10-21

        ZHISHU_ALL.put("517170", "指数");//1    517170  沪港深ETF       -14.27%   0.25          2022-07-21    2022-10-21
        ZHISHU_ALL.put("517270", "指数");//2    517270  沪港深科技TOPETF-15.55%   0.28          2022-07-21    2022-10-21

        ZHISHU_ALL.put("159721", "指数");//1    159721  深创龙头ETF     -12.72%   0.70          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159716", "指数");//7    159716  深创100ETF      -13.12%   1.34          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159961", "指数");//9    159961  深100ETF方正富邦-13.54%   5.27          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159975", "指数");//16   159975  深100ETF招商    -13.94%   0.99          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159969", "指数");//21   159969  深100ETF银华    -14.12%   0.31          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159970", "指数");//23   159970  深100ETF工银    -14.21%   0.22          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159906", "指数");//3    159906  深成长龙头ETF   -11.76%   1.00          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159903", "指数");//1    159903  深成ETF         -12.12%   2.32          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159943", "指数");//5    159943  深证成指ETF     -12.40%   0.90          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159706", "指数");//4    159706  深证100ETF华安  -14.23%   0.78          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159901", "指数");//5    159901  深证100ETF易方达-14.29%   58.75         2022-07-21    2022-10-21

        ZHISHU_ALL.put("159991", "指数");//2    159991  创大盘ETF       -12.82%   0.81          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510020", "指数");//4    510020  超大盘ETF       -12.87%   0.96          2022-07-21    2022-10-21

        ZHISHU_ALL.put("159815", "指数");//3    159815  浙江100ETF      -12.82%   0.27          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159962", "指数");//8    159962  四川ETF         -13.36%   0.34          2022-07-21    2022-10-21
        ZHISHU_ALL.put("512650", "指数");//10   512650  长三角ETF       -13.58%   4.45          2022-07-21    2022-10-21

        ZHISHU_ALL.put("159984", "指数");//1    159984  湾区100ETF      -12.74%   0.48          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159983", "指数");//2    159983  粤港澳大湾区ETF -14.05%   0.64          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159976", "指数");//3    159976  湾创ETF         -14.06%   1.00          2022-07-21    2022-10-21
        ZHISHU_ALL.put("512870", "指数");//4    512870  杭州湾区ETF     -14.31%   0.46          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159978", "指数");//5    159978  大湾区ETF       -15.29%   0.29          2022-07-21    2022-10-21

        ZHISHU_ALL.put("515670", "指数");//1    515670  中银中证100ETF  -12.68%   1.64          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159923", "指数");//2    159923  中证100ETF      -12.81%   0.19          2022-07-21    2022-10-21
        ZHISHU_ALL.put("512910", "指数");//3    512910  中证100ETF      -13.28%   3.84          2022-07-21    2022-10-21

        ZHISHU_ALL.put("159821", "指数");//1    159821  BOCI创业板ETF   -10.99%   0.22          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159956", "指数");//2    159956  创业板ETF建信   -11.43%   0.68          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159964", "指数");//3    159964  平安创业板ETF   -12.17%   3.25          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159810", "指数");//4    159810  浦银创业板ETF   -12.56%   0.29          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159971", "指数");//5    159971  创业板ETF富国   -12.72%   0.10          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159957", "指数");//6    159957  创业板ETF华夏   -13.01%   3.25          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159952", "指数");//7    159952  创业板ETF广发   -13.09%   18.41         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159958", "指数");//8    159958  创业板ETF工银   -13.15%   1.71          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159955", "指数");//9    159955  创业板ETF嘉实   -13.28%   0.29          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159908", "指数");//10   159908  创业板ETF博时   -13.38%   10.36         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159915", "指数");//11   159915  创业板ETF       -13.40%   171.65        2022-07-21    2022-10-21
        ZHISHU_ALL.put("159977", "指数");//12   159977  创业板ETF天弘   -13.42%   46.84         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159948", "指数");//13   159948  创业板ETF南方   -13.45%   20.94         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159808", "指数");//14   159808  创业板ETF融通   -13.49%   0.75          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159814", "指数");//15   159814  创业大盘ETF     -13.62%   2.49          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159949", "指数");//16   159949  创业板50ETF     -13.84%   94.90         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159836", "指数");//10   159836  创300ETF        -11.43%   0.55          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159967", "指数");//14   159967  创成长ETF       -14.43%   30.56         2022-07-21    2022-10-21
        ZHISHU_ALL.put("588380", "指数");//1    588380  创50ETF         -8.89%    18.00         2022-07-21    2022-10-21

        ZHISHU_ALL.put("515810", "指数");//1    515810  中证800ETF      -10.50%   1.28          2022-07-21    2022-10-21
        ZHISHU_ALL.put("515800", "指数");//2    515800  800ETF          -10.82%   18.32         2022-07-21    2022-10-21

        ZHISHU_ALL.put("588060", "指数");//2    588060  科创50ETF龙头   -9.51%    3.90          2022-07-21    2022-10-21
        ZHISHU_ALL.put("588180", "指数");//3    588180  科创50ETF基金   -9.78%    15.58         2022-07-21    2022-10-21
        ZHISHU_ALL.put("588280", "指数");//4    588280  科创50ETF华安   -10.14%   1.50          2022-07-21    2022-10-21
        ZHISHU_ALL.put("588000", "指数");//5    588000  科创50ETF       -10.28%   312.11        2022-07-21    2022-10-21
        ZHISHU_ALL.put("588150", "指数");//7    588150  科创龙头ETF     -10.16%   1.02          2022-07-21    2022-10-21
        ZHISHU_ALL.put("588050", "指数");//11   588050  科创ETF         -10.39%   44.35         2022-07-21    2022-10-21
        ZHISHU_ALL.put("588080", "指数");//12   588080  科创板50ETF     -10.42%   128.81        2022-07-21    2022-10-21
        ZHISHU_ALL.put("588090", "指数");//13   588090  科创板ETF       -10.43%   30.23         2022-07-21    2022-10-21


        ZHISHU_ALL.put("510220", "指数");//1    510220  中小盘ETF       -8.14%    0.22          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510130", "指数");//8    510130  中盘ETF         -8.52%    2.08          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159902", "指数");//1    159902  中小100ETF      -13.66%   4.48          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159973", "指数");//2    159973  民企领先100ETF  -13.73%   5.15          2022-07-21    2022-10-21

        ZHISHU_ALL.put("588310", "指数");//1    588310  双创ETF基金     -8.04%    0.58          2022-07-21    2022-10-21
        ZHISHU_ALL.put("588300", "指数");//2    588300  双创ETF         -8.60%    14.38         2022-07-21    2022-10-21
        ZHISHU_ALL.put("588400", "指数");//3    588400  双创50ETF       -8.65%    17.78         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159782", "指数");//4    159782  双创50ETF基金   -8.93%    8.28          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159781", "指数");//5    159781  双创50ETF       -8.94%    60.30         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159783", "指数");//6    159783  双创基金ETF     -9.12%    40.67         2022-07-21    2022-10-21
        ZHISHU_ALL.put("588330", "指数");//7    588330  双创龙头ETF     -9.12%    11.04         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159603", "指数");//8    159603  双创龙头ETF     -9.13%    9.56          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159780", "指数");//9    159780  双创ETF         -9.16%    30.16         2022-07-21    2022-10-21
        ZHISHU_ALL.put("588360", "指数");//1    588360  科创创业ETF     -9.03%    5.28          2022-07-21    2022-10-21
        ZHISHU_ALL.put("588390", "指数");//2    588390  科创创业50ETF   -9.21%    2.96          2022-07-21    2022-10-21

        ZHISHU_ALL.put("159628", "指数");//1    159628  国证2000ETF     -6.58%    2.79          2022-07-21    2022-10-21

        ZHISHU_ALL.put("159966", "指数");//5    159966  创蓝筹ETF       -5.68%    5.21          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159773", "指数");//8    159773  创科技ETF       -6.13%    0.63          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159804", "指数");//20   159804  创中盘88ETF     -6.69%    1.18          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159918", "指数");//4    159918  中创400ETF      -8.38%    0.60          2022-07-21    2022-10-21

        ZHISHU_ALL.put("562520", "指数");//1    562520  1000成长ETF     -6.06%    0.49          2022-07-21    2022-10-21
        ZHISHU_ALL.put("516300", "指数");//2    516300  中证1000指数ETF -9.36%    1.76          2022-07-21    2022-10-21
        ZHISHU_ALL.put("512100", "指数");//3    512100  中证1000ETF     -9.76%    93.30         2022-07-21    2022-10-21

        ZHISHU_ALL.put("510760", "指数");//1    510760  上证综指ETF     -5.03%    2.91          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510210", "指数");//4    510210  上证指数ETF     -8.16%    9.66          2022-07-21    2022-10-21

        ZHISHU_ALL.put("512750", "指数");//6    512750  基本面50ETF     -5.86%    1.23          2022-07-21    2022-10-21
        ZHISHU_ALL.put("560650", "指数");//3    560650  核心50ETF       -6.61%    0.38          2022-07-21    2022-10-21
        ZHISHU_ALL.put("561500", "指数");//7    561500  漂亮50ETF       -6.98%    1.01          2022-07-21    2022-10-21

        ZHISHU_ALL.put("512040", "指数");//10   512040  价值100ETF      -6.09%    2.84          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510290", "指数");//12   510290  上证380ETF      -6.24%    1.61          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510190", "指数");//5    510190  上证龙头ETF     -10.11%   0.56          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510180", "指数");//6    510180  上证180ETF      -11.29%   183.51        2022-07-21    2022-10-21
        ZHISHU_ALL.put("510990", "指数");//1    510990  180ESGETF       -11.95%   0.48          2022-07-21    2022-10-21
        ZHISHU_ALL.put("516720", "指数");//3    516720  ESGETF          -12.05%   0.48          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510010", "指数");//3    510010  180治理ETF      -7.38%    2.11          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159910", "指数");//3    159910  基本面120ETF    -9.65%    3.34          2022-07-21    2022-10-21

        ZHISHU_ALL.put("512150", "指数");//11   512150  A50ETF          -11.47%   0.79          2022-07-21    2022-10-21
        ZHISHU_ALL.put("512550", "指数");//2    512550  A50ETF基金      -12.23%   2.67          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510800", "指数");//4    510800  50ETF基金       -12.39%   6.65          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510680", "指数");//7    510680  上证50ETF基金   -12.57%   0.31          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510100", "指数");//8    510100  上证50ETF易方达 -12.69%   10.87         2022-07-21    2022-10-21
        ZHISHU_ALL.put("510710", "指数");//9    510710  上证50ETF博时   -12.69%   5.45          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510600", "指数");//10   510600  申万上证50ETF   -12.85%   0.44          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510850", "指数");//11   510850  工银上证50ETF   -12.96%   2.17          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510050", "指数");//12   510050  上证50ETF       -13.10%   612.71        2022-07-21    2022-10-21

        ZHISHU_ALL.put("510370", "指数");//2    510370  兴业沪深300ETF  -10.61%   0.29          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510380", "指数");//2    510380  国寿300ETF      -10.93%   11.34         2022-07-21    2022-10-21
        ZHISHU_ALL.put("515930", "指数");//3    515930  永赢沪深300ETF  -11.12%   0.58          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510390", "指数");//4    510390  平安沪深300ETF  -11.66%   5.08          2022-07-21    2022-10-21
        ZHISHU_ALL.put("515390", "指数");//5    515390  华安沪深300ETF  -11.76%   3.31          2022-07-21    2022-10-21
        ZHISHU_ALL.put("515360", "指数");//6    515360  方正沪深300ETF  -11.77%   1.50          2022-07-21    2022-10-21
        ZHISHU_ALL.put("561900", "指数");//7    561900  沪深300ESGETF   -11.78%   0.62          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510310", "指数");//8    510310  沪深300ETF易方达-11.87%   115.94        2022-07-21    2022-10-21
        ZHISHU_ALL.put("510350", "指数");//9    510350  工银沪深300ETF  -11.88%   25.08         2022-07-21    2022-10-21
        ZHISHU_ALL.put("515380", "指数");//10   515380  泰康沪深300ETF  -11.99%   34.07         2022-07-21    2022-10-21
        ZHISHU_ALL.put("515660", "指数");//11   515660  国联安沪深300ETF-12.03%   21.32         2022-07-21    2022-10-21
        ZHISHU_ALL.put("510360", "指数");//12   510360  沪深300ETF基金  -12.12%   14.68         2022-07-21    2022-10-21
        ZHISHU_ALL.put("515310", "指数");//13   515310  沪深300添富ETF  -12.21%   0.29          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510300", "指数");//14   510300  沪深300ETF      -12.21%   512.95        2022-07-21    2022-10-21
        ZHISHU_ALL.put("159919", "指数");//15   159919  沪深300ETF      -12.25%   182.59        2022-07-21    2022-10-21
        ZHISHU_ALL.put("159925", "指数");//16   159925  沪深300ETF南方  -12.33%   15.13         2022-07-21    2022-10-21
        ZHISHU_ALL.put("515130", "指数");//17   515130  沪深300ETF博时  -12.54%   0.59          2022-07-21    2022-10-21
        ZHISHU_ALL.put("561990", "指数");//18   561990  沪深300增强ETF  -12.58%   4.46          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159907", "指数");//1    159907  中小300ETF      -11.47%   0.94          2022-07-21    2022-10-21
        ZHISHU_ALL.put("515350", "指数");//2    515350  民生加银300ETF  -11.72%   1.20          2022-07-21    2022-10-21
        ZHISHU_ALL.put("516830", "指数");//3    516830  300ESGETF       -12.05%   2.43          2022-07-21    2022-10-21
        ZHISHU_ALL.put("515330", "指数");//4    515330  300ETF天弘      -12.19%   62.76         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159791", "指数");//5    159791  300ESGETF       -12.22%   0.16          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510330", "指数");//6    510330  300ETF基金      -12.26%   201.53        2022-07-21    2022-10-21
        ZHISHU_ALL.put("561300", "指数");//7    561300  300增强ETF      -12.56%   8.08          2022-07-21    2022-10-21
        ZHISHU_ALL.put("517030", "指数");//8    517030  沪港深300ETF基金-12.76%   0.34          2022-07-21    2022-10-21
        ZHISHU_ALL.put("517300", "指数");//9    517300  沪港深300ETF    -13.13%   19.67         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159912", "指数");//10   159912  深300ETF        -13.28%   0.77          2022-07-21    2022-10-21
        ZHISHU_ALL.put("517780", "指数");//11   517780  红300ETF        -13.56%   0.20          2022-07-21    2022-10-21

        ZHISHU_ALL.put("513300", "指数");//1    513300  纳斯达克ETF     -4.07%    11.72         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159941", "指数");//2    159941  纳指ETF         -4.22%    110.10        2022-07-21    2022-10-21
        ZHISHU_ALL.put("513100", "指数");//3    513100  纳指ETF         -5.37%    48.75         2022-07-21    2022-10-21

        ZHISHU_ALL.put("513080", "指数");//1    513080  法国CAC40ETF    0.45%     0.62          2022-07-21    2022-10-21
        ZHISHU_ALL.put("513030", "指数");//16   513030  德国ETF         -3.34%    5.84          2022-07-21    2022-10-21

        ZHISHU_ALL.put("159612", "指数");//1    159612  标普500ETF      -0.70%    0.54          2022-07-21    2022-10-21
        ZHISHU_ALL.put("513500", "指数");//7    513500  标普500ETF      -2.14%    78.77         2022-07-21    2022-10-21


        ZHISHU_ALL.put("159866", "指数");//3    159866  日经ETF         -1.44%    0.69          2022-07-21    2022-10-21
        ZHISHU_ALL.put("513520", "指数");//10   513520  日经ETF         -2.69%    0.57          2022-07-21    2022-10-21
        ZHISHU_ALL.put("513800", "指数");//11   513800  东京证券指数ETF -2.71%    0.54          2022-07-21    2022-10-21
        ZHISHU_ALL.put("513880", "指数");//15   513880  日经225ETF      -3.18%    0.50          2022-07-21    2022-10-21
        ZHISHU_ALL.put("513000", "指数");//17   513000  日经225ETF易方达-3.43%    0.60          2022-07-21    2022-10-21

        ZHISHU_ALL.put("515190", "指数");//1    515190  中银证券500ETF  -3.71%    0.68          2022-07-21    2022-10-21
        ZHISHU_ALL.put("512260", "指数");//2    512260  中证500低波ETF  -4.35%    1.11          2022-07-21    2022-10-21
        ZHISHU_ALL.put("515550", "指数");//3    515550  中融中证500ETF  -4.54%    0.35          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510440", "指数");//4    510440  500沪市ETF      -5.13%    0.41          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159617", "指数");//5    159617  500价值ETF      -5.18%    2.92          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510570", "指数");//6    510570  兴业中证500ETF  -5.83%    0.10          2022-07-21    2022-10-21
        ZHISHU_ALL.put("515590", "指数");//7    515590  500等权ETF      -6.01%    0.34          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510590", "指数");//8    510590  平安中证500ETF  -6.05%    5.62          2022-07-21    2022-10-21
        ZHISHU_ALL.put("512510", "指数");//9    512510  中证500指数ETF  -6.06%    5.15          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510560", "指数");//10   510560  国寿500ETF      -6.16%    2.34          2022-07-21    2022-10-21
        ZHISHU_ALL.put("561550", "指数");//11   561550  500增强ETF      -6.24%    8.08          2022-07-21    2022-10-21
        ZHISHU_ALL.put("560100", "指数");//12   560100  中证500增强ETF  -6.30%    1.49          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159982", "指数");//13   159982  中证500ETF鹏华  -6.45%    3.80          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159968", "指数");//14   159968  中证500ETF博时  -6.46%    7.68          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159820", "指数");//15   159820  中证500ETF天弘  -6.46%    23.29         2022-07-21    2022-10-21
        ZHISHU_ALL.put("510580", "指数");//16   510580  中证500ETF易方达-6.49%    19.97         2022-07-21    2022-10-21
        ZHISHU_ALL.put("515530", "指数");//17   515530  泰康中证500ETF  -6.54%    0.66          2022-07-21    2022-10-21
        ZHISHU_ALL.put("515510", "指数");//18   515510  500成长ETF      -6.65%    0.13          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510550", "指数");//19   510550  方正中证500ETF  -6.67%    0.23          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510510", "指数");//20   510510  中证500ETF基金  -6.68%    25.30         2022-07-21    2022-10-21
        ZHISHU_ALL.put("512500", "指数");//21   512500  500ETF基金      -6.70%    38.14         2022-07-21    2022-10-21
        ZHISHU_ALL.put("159922", "指数");//22   159922  中证500ETF      -6.70%    66.77         2022-07-21    2022-10-21
        ZHISHU_ALL.put("510500", "指数");//23   510500  中证500ETF      -6.71%    422.00        2022-07-21    2022-10-21
        ZHISHU_ALL.put("561350", "指数");//24   561350  国泰中证500ETF  -6.75%    1.92          2022-07-21    2022-10-21
        ZHISHU_ALL.put("510530", "指数");//25   510530  工银中证500ETF  -6.84%    2.68          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159610", "指数");//26   159610  500ETF增强      -7.56%    6.64          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159606", "指数");//27   159606  中证500成长ETF  -8.75%    6.55          2022-07-21    2022-10-21
        ZHISHU_ALL.put("159932", "指数");//28   159932  中证500深ETF    -8.92%    0.33          2022-07-21    2022-10-21
        ZHISHU_ALL.put("560500", "指数");//29   560500  500质量成长ETF  -9.00%    1.00          2022-07-21    2022-10-21
        ZHISHU_ALL.put("517010", "指数");//30   517010  沪港深500ETF指数-12.63%   0.42          2022-07-21    2022-10-21
        ZHISHU_ALL.put("517080", "指数");//31   517080  沪港深500ETF基金-13.14%   4.80          2022-07-21    2022-10-21
        ZHISHU_ALL.put("517100", "指数");//32   517100  AH500ETF        -13.25%   3.34          2022-07-21    2022-10-21
        ZHISHU_ALL.put("517000", "指数");//33   517000  沪港深500ETF    -13.50%   4.87          2022-07-21    2022-10-21
    }

    /**
     * 科技-最少元素
     */
    public static Map<String, String> KEJI = new HashMap<>();
    static {
//        KEJI.put("159967", "创成长ETF     ");//29.98   	0.15
        KEJI.put("515790", "光伏ETF       ");//147.52  	-0.18
        KEJI.put("515030", "新能源车ETF   ");//110.75  	-0.23
//        KEJI.put("515050", "5GETF         ");//99.94   	-0.42
        KEJI.put("516110", "汽车ETF       ");//9.23    	-0.81
        KEJI.put("159995", "芯片ETF       ");//205.39  	-0.94
        KEJI.put("513050", "中概互联网ETF ");//367.01  	-1.43
        KEJI.put("513330", "恒生互联网ETF ");//246.99  	-1.67

        KEJI.put("512660", "军工ETF       ");//139.20  	1.74
        //4     512670    国防ETF         2.69%     -0.20%    22.58         2022-08-25    2022-09-23

        KEJI.put("515230", "软件ETF       ");//3.35    	3.02

        KEJI.put("513360", "教育ETF");//513360  教育ETF         4.50%     1.95%     5.19          2022-07-21    2022-10-21

//        etf.put("515230", "软件ETF       ");//3.35    	3.02
//        etf.put("515400", "大数据ETF     ");//2.32    	3.02
//        etf.put("159899", "软件基金ETF   ");//1.12    	2.89
//        etf.put("516000", "大数据50ETF   ");//0.56    	2.84
//        etf.put("516700", "大数据产业ETF ");//0.24    	2.81
//        etf.put("159852", "软件ETF       ");//2.72    	2.76
//        etf.put("159739", "大数据ETF     ");//0.72    	2.75
//        etf.put("560660", "云50ETF       ");//1.30    	2.7
//        etf.put("516630", "云计算50ETF   ");//0.70    	2.7
//        etf.put("159890", "云计算ETF     ");//0.41    	2.61
//        etf.put("159998", "计算机ETF     ");//18.80   	2.56
//        etf.put("512720", "计算机ETF     ");//10.11   	2.56
//        etf.put("516510", "云计算ETF     ");//1.88    	2.37
//        etf.put("512930", "AIETF         ");//1.89    	2.06
//        etf.put("515070", "人工智能AIETF ");//6.33    	1.96
//        etf.put("159702", "AIETF         ");//0.20    	1.69
//        etf.put("159738", "沪港深云计算ETF");//0.75    	1.44
//        etf.put("517390", "云计算沪港深ETF");//0.55    	1.08

//        KEJI.put("513180", "118.13");//恒生科技指数ETF
//        KEJI.put("512760", "135.48");//芯片ETF
//        KEJI.put("512480", "124.78");//半导体ETF

//        KEJI.put("515700", "66.24");//新能车ETF
//        KEJI.put("513130", "65.51");//恒生科技ETF
//        KEJI.put("512710", "49.38");//军工龙头ETF
//        KEJI.put("512680", "37.29");//军工ETF基金
//        KEJI.put("159605", "36.09");//中概互联ETF
//        KEJI.put("515000", "35.76");//科技ETF
//        KEJI.put("562990", "33.72");//碳中和100ETF
//        KEJI.put("159790", "32.40");//碳中和ETF
//        KEJI.put("513010", "29.62");//恒生科技30ETF
//        KEJI.put("513550", "29.04");//港股通50ETF
//        KEJI.put("512670", "28.01");//国防ETF
//        KEJI.put("516160", "24.50");//新能源ETF
//        KEJI.put("159639", "23.64");//碳中和ETF南方
//        KEJI.put("159939", "23.07");//信息技术ETF
//        KEJI.put("512580", "22.92");//碳中和龙头ETF
//        KEJI.put("561190", "21.79");//双碳ETF
//        KEJI.put("159994", "21.75");//5GETF
//        KEJI.put("513660", "20.86");//恒生ETF
//        KEJI.put("159801", "20.52");//芯片龙头ETF
//        KEJI.put("159755", "20.51");//电池ETF
//        KEJI.put("159792", "20.10");//港股通互联网ETF
//        KEJI.put("517160", "18.81");//长江保护主题ETF
//        KEJI.put("159998", "18.65");//计算机ETF
//        KEJI.put("517330", "18.39");//长江保护ETF
//        KEJI.put("159813", "17.84");//半导体ETF
//        KEJI.put("159806", "17.15");//新能源车ETF
//        KEJI.put("513980", "16.39");//港股科技50ETF
//        KEJI.put("159819", "15.01");//人工智能ETF
//        KEJI.put("560550", "14.98");//碳中和ETF环交所
//        KEJI.put("515880", "13.86");//通信ETF
//        KEJI.put("159997", "12.91");//电子ETF
//        KEJI.put("159857", "12.49");//光伏ETF
//        KEJI.put("588330", "11.38");//双创龙头ETF
//        KEJI.put("159740", "10.19");//恒生科技ETF
    }
    public static Map<String, String> KEJI_MORE = new HashMap<>();
    static {
        KEJI_MORE.put("513360", "教育ETF         ");//1    513360  教育ETF         5.26%     5.10          2022-07-22    2022-10-24
        KEJI_MORE.put("159852", "软件ETF         ");//2    159852  软件ETF         -0.76%    3.15          2022-07-22    2022-10-24
        KEJI_MORE.put("512670", "国防ETF         ");//3    512670  国防ETF         -1.42%    23.28         2022-07-22    2022-10-24

        KEJI_MORE.put("159998", "计算机ETF       ");//5    159998  计算机ETF       -3.02%    19.23         2022-07-22    2022-10-24
        KEJI_MORE.put("159851", "金融科技ETF     ");//6    159851  金融科技ETF     -3.56%    2.07          2022-07-22    2022-10-24
        KEJI_MORE.put("512660", "军工ETF         ");//7    512660  军工ETF         -3.60%    114.18        2022-07-22    2022-10-24
//        KEJI_MORE.put("510160", "产业升级ETF     ");//8    510160  产业升级ETF     -6.36%    2.33          2022-07-22    2022-10-24
        KEJI_MORE.put("515400", "大数据ETF       ");//9    515400  大数据ETF       -7.97%    2.58          2022-07-22    2022-10-24
        KEJI_MORE.put("515880", "通信ETF         ");//10   515880  通信ETF         -8.59%    13.57         2022-07-22    2022-10-24
        KEJI_MORE.put("159939", "信息技术ETF     ");//11   159939  信息技术ETF     -8.93%    22.11         2022-07-22    2022-10-24
        KEJI_MORE.put("515000", "科技ETF         ");//12   515000  科技ETF         -9.91%    32.49         2022-07-22    2022-10-24
        KEJI_MORE.put("515790", "光伏ETF         ");//13   515790  光伏ETF         -10.86%   140.24        2022-07-22    2022-10-24
        KEJI_MORE.put("560800", "数字经济ETF     ");//14   560800  数字经济ETF     -11.07%   5.49          2022-07-22    2022-10-24
        KEJI_MORE.put("159819", "人工智能ETF     ");//15   159819  人工智能ETF     -13.55%   13.76         2022-07-22    2022-10-24
        KEJI_MORE.put("512480", "半导体ETF       ");//16   512480  半导体ETF       -14.08%   128.60        2022-07-22    2022-10-24
        KEJI_MORE.put("159790", "碳中和ETF       ");//17   159790  碳中和ETF       -15.59%   28.58         2022-07-22    2022-10-24
        KEJI_MORE.put("517050", "互联网50ETF     ");//18   517050  互联网50ETF     -15.97%   5.30          2022-07-22    2022-10-24
        KEJI_MORE.put("159995", "芯片ETF         ");//19   159995  芯片ETF         -16.32%   181.40        2022-07-22    2022-10-24
        KEJI_MORE.put("515050", "5GETF           ");//20   515050  5GETF           -16.38%   81.08         2022-07-22    2022-10-24
        KEJI_MORE.put("516160", "新能源ETF       ");//21   516160  新能源ETF       -16.73%   25.44         2022-07-22    2022-10-24
        KEJI_MORE.put("513050", "中概互联网ETF   ");//22   513050  中概互联网ETF   -17.64%   325.52        2022-07-22    2022-10-24
        KEJI_MORE.put("515250", "智能汽车ETF     ");//23   515250  智能汽车ETF     -19.31%   6.25          2022-07-22    2022-10-24
        KEJI_MORE.put("515030", "新能源车ETF     ");//24   515030  新能源车ETF     -20.90%   96.47         2022-07-22    2022-10-24
        KEJI_MORE.put("159755", "电池ETF         ");//25   159755  电池ETF         -21.52%   20.88         2022-07-22    2022-10-24
        KEJI_MORE.put("513330", "恒生互联网ETF   ");//26   513330  恒生互联网ETF   -23.51%   202.23        2022-07-22    2022-10-24
        KEJI_MORE.put("513180", "恒生科技指数ETF ");//27   513180  恒生科技指数ETF -27.03%   124.92        2022-07-22    2022-10-24
    }

    public static Map<String, String> ZIYUAN = new HashMap<>();//资源
    static {
        ZIYUAN.put("515220", "煤炭ETF       ");//51.65   	1.62
        ZIYUAN.put("159930", "能源ETF       ");//2.67    	1.41
//        ZIYUAN.put("515210", "钢铁ETF       ");//17.02   	1.1
        ZIYUAN.put("516150", "稀土ETF基金   ");//24.14   	0.36
        ZIYUAN.put("159870", "化工ETF       ");//7.80    	0.34
        ZIYUAN.put("512400", "有色金属ETF   ");//30.77   	-0.08
        ZIYUAN.put("159865", "养殖ETF       ");//41.80   	0.59
//        ZIYUAN.put("159825", "农业ETF       ");//17.63   	0.41
        ZIYUAN.put("159985", "豆粕ETF");//豆粕ETF	159985	2.43
    }
    public static Map<String, String> ZIYUAN_MORE = new HashMap<>();//资源
    static {
        ZIYUAN_MORE.put("159985", "豆粕ETF         ");//1    159985  豆粕ETF         16.30%    2.90          2022-07-22    2022-10-24
        ZIYUAN_MORE.put("159930", "能源ETF         ");//2    159930  能源ETF         9.85%     4.47          2022-07-22    2022-10-24
        ZIYUAN_MORE.put("515220", "煤炭ETF         ");//3    515220  煤炭ETF         5.19%     49.32         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("159865", "养殖ETF         ");//4    159865  养殖ETF         -4.04%    36.40         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("159825", "农业ETF         ");//5    159825  农业ETF         -10.63%   19.37         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("515210", "钢铁ETF         ");//6    515210  钢铁ETF         -12.25%   14.25         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("512400", "有色金属ETF     ");//7    512400  有色金属ETF     -13.78%   26.69         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("159870", "化工ETF         ");//8    159870  化工ETF         -14.19%   9.56          2022-07-22    2022-10-24
        ZIYUAN_MORE.put("159745", "建材ETF         ");//9    159745  建材ETF         -16.28%   7.47          2022-07-22    2022-10-24
        ZIYUAN_MORE.put("516150", "稀土ETF基金     ");//10   516150  稀土ETF基金     -16.42%   20.58         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("562800", "稀有金属ETF     ");//11   562800  稀有金属ETF     -18.40%   6.70          2022-07-22    2022-10-24
    }

    //金融
    public static Map<String, String> JINRONG = new HashMap<>();
    static {
//        JINRONG.put("510880", "红利ETF       ");//166.99  	0.6
        JINRONG.put("512200", "房地产ETF     ");//52.10   	-0.14
        JINRONG.put("512880", "证券ETF       ");//316.81  	-0.22
        JINRONG.put("516970", "基建50ETF     ");//98.25   	-0.27
        JINRONG.put("159611", "电力ETF       ");//12.86   	0.68
        JINRONG.put("512800", "银行ETF       ");//97.45   	-0.47
        JINRONG.put("518880", "黄金ETF       ");//112.54  	-0.55

        //        JINRONG.put("511990", "1532.55");//华宝添益ETF
//        JINRONG.put("511880", "1355.05");//银华日利ETF
//        JINRONG.put("511660", "228.88");//货币ETF建信添益
//        JINRONG.put("512000", "228.39");//券商ETF
//        JINRONG.put("511360", "174.73");//短融ETF
//        JINRONG.put("511850", "92.60");//财富宝ETF
//        JINRONG.put("512900", "82.71");//证券ETF基金
//        JINRONG.put("159937", "74.00");//黄金ETF基金
//        JINRONG.put("515290", "71.88");//银行ETF天弘
//        JINRONG.put("510810", "65.61");//上海国企ETF
//        JINRONG.put("512960", "54.75");//央调ETF
//        JINRONG.put("511030", "52.74");//公司债ETF
//        JINRONG.put("512950", "50.97");//央企改革ETF
//        JINRONG.put("159934", "45.00");//黄金ETF
//        JINRONG.put("159841", "42.78");//证券ETF
//        JINRONG.put("515900", "39.23");//央创ETF
//        JINRONG.put("159972", "39.05");//5年地债ETF
//        JINRONG.put("510230", "33.40");//金融ETF
//        JINRONG.put("512070", "32.99");//证券保险ETF
//        JINRONG.put("159905", "28.74");//深红利ETF
//        JINRONG.put("511810", "25.85");//理财金货币ETF
//        JINRONG.put("512700", "25.62");//银行ETF基金
//        JINRONG.put("159001", "23.99");//货币ETF
//        JINRONG.put("159959", "23.80");//央企ETF
//        JINRONG.put("159940", "19.83");//金融地产ETF
//        JINRONG.put("515180", "18.13");//红利ETF易方达
//        JINRONG.put("159816", "16.92");//0-4地债ETF
//        JINRONG.put("511690", "16.09");//交易货币ETF
//        JINRONG.put("515600", "15.83");//央企创新ETF
//        JINRONG.put("511900", "15.80");//富国货币ETF
//        JINRONG.put("515680", "15.66");//嘉实央企创新ETF
//        JINRONG.put("511700", "15.57");//场内货币ETF
//        JINRONG.put("516950", "14.75");//基建ETF
//        JINRONG.put("159993", "14.65");//龙头券商ETF
//        JINRONG.put("511220", "13.29");//城投债ETF
//        JINRONG.put("511020", "11.94");//活跃国债ETF
//        JINRONG.put("513090", "11.86");//香港证券ETF
    }
    public static Map<String, String> JINRONG_MORE = new HashMap<>();//金融
    static {
        JINRONG_MORE.put("518880", "黄金ETF         ");//1    518880  黄金ETF         5.33%     87.56         2022-07-22    2022-10-24
        JINRONG_MORE.put("510880", "红利ETF         ");//2    510880  红利ETF         2.19%     140.50        2022-07-22    2022-10-24
        JINRONG_MORE.put("511880", "银华日利ETF     ");//4    511880  银华日利ETF     0.38%     1364.23       2022-07-22    2022-10-24
        JINRONG_MORE.put("511030", "公司债ETF       ");//5    511030  公司债ETF       -0.91%    52.42         2022-07-22    2022-10-24
        JINRONG_MORE.put("511380", "可转债ETF       ");//6    511380  可转债ETF       -3.04%    13.42         2022-07-22    2022-10-24
        JINRONG_MORE.put("512200", "房地产ETF       ");//7    512200  房地产ETF       -3.32%    44.38         2022-07-22    2022-10-24
        JINRONG_MORE.put("510230", "金融ETF         ");//8    510230  金融ETF         -5.72%    31.93         2022-07-22    2022-10-24
        JINRONG_MORE.put("512800", "银行ETF         ");//9    512800  银行ETF         -6.07%    86.00         2022-07-22    2022-10-24
        JINRONG_MORE.put("512880", "证券ETF         ");//10   512880  证券ETF         -7.77%    294.07        2022-07-22    2022-10-24
        JINRONG_MORE.put("516970", "基建50ETF       ");//11   516970  基建50ETF       -7.90%    90.14         2022-07-22    2022-10-24
        JINRONG_MORE.put("159611", "电力ETF         ");//4    159611  电力ETF         -2.93%    16.67         2022-07-22    2022-10-24
    }

    //医疗
    public static Map<String, String> YILIAO = new HashMap<>();
    static {
//        YILIAO.put("513060", "恒生医疗ETF   ");//55.08   	-0.18
        YILIAO.put("512170", "医疗ETF       ");//148.20  	-0.37
        YILIAO.put("159992", "创新药ETF     ");//43.44   	-0.89
        YILIAO.put("159883", "医疗器械ETF");//159883  医疗器械ETF     2.19%     0.57%     17.75         2022-07-21    2022-10-21

//        YILIAO.put("512010", "101.39");//医药ETF
//        YILIAO.put("512290", "40.51");//生物医药ETF
//        YILIAO.put("159938", "29.27");//医药卫生ETF
//        YILIAO.put("159837", "16.75");//生物科技ETF
//        YILIAO.put("515120", "15.19");//创新药ETF
//        YILIAO.put("159828", "14.97");//医疗ETF
//        YILIAO.put("159859", "12.95");//生物医药ETF
//        YILIAO.put("159929", "10.15");//医药ETF
    }
    public static Map<String, String> YILIAO_MORE = new HashMap<>();//医疗
    static {
        YILIAO_MORE.put("159883", "医疗器械ETF     ");//1    159883  医疗器械ETF     2.64%     18.02         2022-07-22    2022-10-24
        YILIAO_MORE.put("512170", "医疗ETF         ");//2    512170  医疗ETF         -9.25%    170.43        2022-07-22    2022-10-24
        YILIAO_MORE.put("159992", "创新药ETF       ");//3    159992  创新药ETF       -12.13%   43.71         2022-07-22    2022-10-24
        YILIAO_MORE.put("513060", "恒生医疗ETF     ");//4    513060  恒生医疗ETF     -17.74%   53.44         2022-07-22    2022-10-24
    }

    //消费
    public static Map<String, String> XIAOFEI = new HashMap<>();
    static {
        XIAOFEI.put("159996", "家电ETF       ");//27.23   	0.65
//        XIAOFEI.put("515170", "食品饮料ETF   ");//39.01   	-0.26
//        XIAOFEI.put("159928", "消费ETF       ");//107.11  	-0.37
        XIAOFEI.put("512690", "酒ETF         ");//92.62   	-0.47
        XIAOFEI.put("512980", "传媒ETF       ");//47.02   	-0.67
        XIAOFEI.put("159766", "旅游ETF       ");//19.72   	-1.86
        XIAOFEI.put("516530", "物流快递ETF");//物流快递ETF	516530	0.94

//        XIAOFEI.put("515650", "17.31");//消费50ETF
//        XIAOFEI.put("510150", "11.36");//消费ETF

//        XIAOFEI.put("159736", "71.57");//饮食ETF
//        XIAOFEI.put("515710", "11.25");//食品ETF

//        XIAOFEI.put("560880", "11.53");//家电ETF基金
    }
    public static Map<String, String> XIAOFEI_MORE = new HashMap<>();//消费
    static {
        XIAOFEI_MORE.put("516530", "物流快递ETF     ");//1    516530  物流快递ETF     -0.11%    0.95          2022-07-22    2022-10-24
        XIAOFEI_MORE.put("159766", "旅游ETF         ");//2    159766  旅游ETF         -6.03%    19.43         2022-07-22    2022-10-24
        XIAOFEI_MORE.put("159928", "消费ETF         ");//3    159928  消费ETF         -12.33%   94.45         2022-07-22    2022-10-24
        XIAOFEI_MORE.put("159996", "家电ETF         ");//4    159996  家电ETF         -13.12%   20.16         2022-07-22    2022-10-24
        XIAOFEI_MORE.put("512690", "酒ETF           ");//5    512690  酒ETF           -13.65%   98.31         2022-07-22    2022-10-24
        XIAOFEI_MORE.put("159736", "饮食ETF         ");//6    159736  饮食ETF         -13.92%   67.55         2022-07-22    2022-10-24
        XIAOFEI_MORE.put("512980", "传媒ETF         ");//7    512980  传媒ETF         -14.98%   44.36         2022-07-22    2022-10-24
    }

    /**
     * etf-市值-行业板块
     */
    public static Map<String, String> ETF_BK = new HashMap<>();

    static {
        ETF_BK.putAll(KEJI);
        ETF_BK.putAll(YILIAO);
        ETF_BK.putAll(JINRONG);
        ETF_BK.putAll(XIAOFEI);
        ETF_BK.putAll(ZIYUAN);
    }

    /**
     * ETF_All 全部：指数、板块
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(ETF_ZS);
        ETF_All.putAll(ETF_BK);
    }

    public static void main(String[] args) {
        BizEtfStat.showEtfMv(DateUtil.getToday(DateUtil.YYYY_MM_DD));//显示etf市值
    }
}
