package utils;

import ttjj.service.KlineService;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：金融
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStJinRong {

    /**
     * guiJinShu_peiYuZuanShi ["培育钻石"]：4;
     */
    public static Map<String, String> guiJinShu_peiYuZuanShi = new HashMap<>();

    static {
        guiJinShu_peiYuZuanShi.put("600172", "黄河旋风");//398	非金属材料   4   	134.84	1.17	价格区间: 5日:96.15 	10日:62.89 	20日:69.11 	30日:72.17 	60日:69.94 	120日:42.96 	250日:67.74 		,当前价：9.35	,当前：2022-04-18 10:46:42
        guiJinShu_peiYuZuanShi.put("000519", "中兵红箭");//345	专用设备     1.29	284.92	0.95	价格区间: 5日:68.02 	10日:35.78 	20日:37.27 	30日:59.13 	60日:58.68 	120日:26.87 	250日:53.77 		,当前价：20.46	,当前：2022-04-18 10:46:44
    }

    /**
     * guiJinShu_huangJin ["黄金概念"]：36;
     */
    public static Map<String, String> guiJinShu_huangJin = new HashMap<>();

    static {
        guiJinShu_huangJin.put("000546", "金圆股份");//384	水泥建材     -2.33	121.33	2.43	价格区间: 5日:56.32 	10日:64.07 	20日:56.25 	30日:37.57 	60日:51.24 	120日:66.70 	250日:75.45 		,当前价：15.54	,当前：2022-04-08 11:52:48
        guiJinShu_huangJin.put("600596", "新安股份");//333	农药兽药     4.99	232.34	2.3 	价格区间: 5日:99.23 	10日:76.95 	20日:85.16 	30日:85.09 	60日:90.13 	120日:54.56 	250日:47.13 		,当前价：28.39	,当前：2022-04-08 11:52:49
        guiJinShu_huangJin.put("000688", "国城矿业");//317	有色金属     0.13	177.42	1.14	价格区间: 5日:17.57 	10日:13.83 	20日:39.30 	30日:28.26 	60日:46.44 	120日:59.98 	250日:63.61 		,当前价：15.6	,当前：2022-04-08 11:52:51
        guiJinShu_huangJin.put("000009", "中国宝安");//290	综合行业     -2.14	271.59	1.29	价格区间: 5日:12.67 	10日:10.61 	20日:9.36  	30日:4.51  	60日:4.08  	120日:1.61  	250日:9.17  		,当前价：10.53	,当前：2022-04-08 11:52:52
        guiJinShu_huangJin.put("601020", "ST华钰  ");//289	有色金属     -0.5	100.38	0.92	价格区间: 5日:81.20 	10日:86.94 	20日:89.93 	30日:89.93 	60日:94.07 	120日:94.07 	250日:96.46 		,当前价：17.94	,当前：2022-04-08 11:52:53
        guiJinShu_huangJin.put("000630", "铜陵有色");//272	有色金属     -0.52	403.17	1.25	价格区间: 5日:88.89 	10日:80.00 	20日:88.41 	30日:51.69 	60日:51.69 	120日:45.77 	250日:40.38 		,当前价：3.83	,当前：2022-04-08 11:52:54
        guiJinShu_huangJin.put("603979", "金诚信  ");//264	采掘行业     4.15	128.30	2.58	价格区间: 5日:88.57 	10日:71.70 	20日:79.70 	30日:48.83 	60日:47.01 	120日:52.86 	250日:50.49 		,当前价：21.6	,当前：2022-04-08 11:52:55
        guiJinShu_huangJin.put("600988", "赤峰黄金");//264	贵金属       9.95	347.42	3.74	价格区间: 5日:95.15 	10日:95.15 	20日:97.34 	30日:97.41 	60日:97.97 	120日:97.97 	250日:97.97 		,当前价：20.88	,当前：2022-04-08 11:52:56
        guiJinShu_huangJin.put("600490", "鹏欣资源");//263	有色金属     1.19	94.27	1.29	价格区间: 5日:51.61 	10日:20.51 	20日:10.06 	30日:7.58  	60日:7.58  	120日:6.72  	250日:11.07 		,当前价：4.26	,当前：2022-04-08 11:52:57
        guiJinShu_huangJin.put("002155", "湖南黄金");//255	贵金属       4.96	134.87	3.49	价格区间: 5日:85.06 	10日:66.67 	20日:57.39 	30日:40.62 	60日:45.33 	120日:45.33 	250日:37.22 		,当前价：11.22	,当前：2022-04-08 11:52:57
        guiJinShu_huangJin.put("600089", "特变电工");//251	电网设备     -1.9	744.76	1.64	价格区间: 5日:17.91 	10日:20.86 	20日:13.62 	30日:42.14 	60日:48.17 	120日:18.06 	250日:47.00 		,当前价：19.65	,当前：2022-04-08 11:52:58
        guiJinShu_huangJin.put("600711", "盛屯矿业");//245	能源金属     -1.8	231.66	1.49	价格区间: 5日:26.19 	10日:14.10 	20日:10.38 	30日:5.99  	60日:5.99  	120日:5.30  	250日:22.33 		,当前价：8.2	,当前：2022-04-08 11:52:59
    }

    /**
     * quanShangGaiNian 概念：["券商概念"];股票个数：51;
     */
    public static Map<String, String> quanShangGaiNian = new HashMap<>();

    static {
        quanShangGaiNian.put("002945", "华林证券");//219	证券         0.45	420.12	1.58	价格区间: 5日:70.65 	10日:49.24 	20日:53.40 	30日:31.98 	60日:43.73 	120日:59.69 	250日:59.69 		,当前价：15.56	,当前：2022-04-25 23:47:53
        quanShangGaiNian.put("601696", "中银证券");//194	证券         2.96	396.70	1.53	价格区间: 5日:68.69 	10日:43.87 	20日:57.25 	30日:68.54 	60日:69.53 	120日:69.53 	250日:34.40 		,当前价：14.28	,当前：2022-04-25 23:47:55
        quanShangGaiNian.put("002670", "国盛金控");//181	证券         -0.83	185.19	1.64	价格区间: 5日:53.77 	10日:31.49 	20日:45.37 	30日:56.79 	60日:57.68 	120日:57.68 	250日:35.65 		,当前价：9.57	,当前：2022-04-25 23:47:55
        quanShangGaiNian.put("601236", "红塔证券");//165	证券         -0.76	491.96	1.42	价格区间: 5日:31.62 	10日:35.91 	20日:53.41 	30日:59.30 	60日:58.93 	120日:45.74 	250日:32.14 		,当前价：10.43	,当前：2022-04-25 23:47:57
        quanShangGaiNian.put("600155", "华创阳安");//157	证券         -6.97	148.56	1.06	价格区间: 5日:4.00  	10日:3.75  	20日:3.75  	30日:8.02  	60日:8.02  	120日:7.98  	250日:3.65  		,当前价：8.54	,当前：2022-04-25 23:47:58
        quanShangGaiNian.put("601990", "南京证券");//148	证券         -1.11	328.45	1.2 	价格区间: 5日:26.73 	10日:56.98 	20日:56.98 	30日:56.98 	60日:55.56 	120日:42.34 	250日:26.12 		,当前价：8.91	,当前：2022-04-25 23:47:58
        quanShangGaiNian.put("000712", "锦龙股份");//146	证券         -5.92	119.71	1.08	价格区间: 5日:1.23  	10日:0.70  	20日:0.70  	30日:0.70  	60日:10.53 	120日:10.53 	250日:8.91  		,当前价：13.36	,当前：2022-04-25 23:47:59
        quanShangGaiNian.put("600909", "华安证券");//139	证券         10.04	241.93	12.12	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:80.25 	120日:65.66 	250日:38.46 		,当前价：5.15	,当前：2022-04-25 23:48:00
        quanShangGaiNian.put("000776", "广发证券");//137	证券         -5.32	1192.70	1.21	价格区间: 5日:6.13  	10日:3.72  	20日:3.57  	30日:3.57  	60日:1.34  	120日:0.86  	250日:12.61 		,当前价：15.65	,当前：2022-04-25 23:48:01
        quanShangGaiNian.put("601456", "国联证券");//137	证券         -5.38	264.20	0.94	价格区间: 5日:3.65  	10日:1.48  	20日:1.09  	30日:0.99  	60日:0.67  	120日:0.67  	250日:0.67  		,当前价：9.33	,当前：2022-04-25 23:48:02
        quanShangGaiNian.put("000728", "国元证券");//136	证券         -3.62	301.97	1.28	价格区间: 5日:0.00  	10日:0.00  	20日:22.95 	30日:32.37 	60日:33.33 	120日:33.33 	250日:22.17 		,当前价：6.92	,当前：2022-04-25 23:48:02
    }

    /**
     * jianZhuJieNeng ["建筑节能"]：6;
     */
    public static Map<String, String> fangDiChan_jianZhuJieNeng = new HashMap<>();

    static {
        fangDiChan_jianZhuJieNeng.put("002761", "浙江建投");//437	工程建设     10.02	365.82	3.17	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:63.87 	60日:77.47 	净利环增:148.67;净利同增:7.98;营收环增:-16.35;营收同增:-5.48;
        fangDiChan_jianZhuJieNeng.put("000517", "荣安地产");//250	房地产开发   10.1	100.61	1.43	价格区间: 5日:100.00	10日:94.34 	20日:38.17 	30日:38.99 	60日:45.81 	净利环增:42.91;净利同增:206.21;营收环增:-42.08;营收同增:13.11;
        fangDiChan_jianZhuJieNeng.put("002810", "山东赫达");//204	化学制品     2.85	154.64	0.48	价格区间: 5日:97.48 	10日:97.48 	20日:86.23 	30日:86.09 	60日:49.66 	净利环增:82.16;净利同增:20.66;营收环增:0.61;营收同增:19.05;
    }

    /**
     * fangDiChan_zuShouTongQuan ["租售同权"]：14;
     */
    public static Map<String, String> fangDiChan_zuShouTongQuan = new HashMap<>();

    static {
        fangDiChan_zuShouTongQuan.put("002244", "滨江集团");//253	房地产开发   -2.67	249.54	2.07	价格区间: 5日:82.21 	10日:85.71 	20日:85.71 	30日:86.26 	60日:89.72 	净利环增:-86.62;净利同增:-42.69;营收环增:-54.34;营收同增:-16.79;
        fangDiChan_zuShouTongQuan.put("600325", "华发股份");//222	房地产开发   2.23	165.14	3.57	价格区间: 5日:80.43 	10日:80.43 	20日:70.48 	30日:73.84 	60日:78.47 	净利环增:-37.71;净利同增:28.35;营收环增:-64.17;营收同增:26.97;
        fangDiChan_zuShouTongQuan.put("000011", "深物业A");//216	房地产开发   0.5 	71.70	1.9 	价格区间: 5日:96.19 	10日:74.81 	20日:35.69 	30日:35.69 	60日:42.41 	净利环增:-4.30;净利同增:2.64;营收环增:-4.17;营收同增:29.99;
        fangDiChan_zuShouTongQuan.put("000671", "阳光城  ");//215	房地产开发   -0.39	106.41	2.02	价格区间: 5日:66.67 	10日:39.29 	20日:10.58 	30日:10.58 	60日:22.82 	净利环增:84.83;净利同增:-408.32;营收环增:55.55;营收同增:-75.32;
        fangDiChan_zuShouTongQuan.put("000056", "皇庭国际");//213	房地产服务   -9.91	56.61	1.11	价格区间: 5日:0.00  	10日:0.00  	20日:0.00  	30日:0.00  	60日:0.00  	净利环增:89.61;净利同增:-4695.83;营收环增:-10.33;营收同增:-5.34;
        fangDiChan_zuShouTongQuan.put("600048", "保利发展");//208	房地产开发   -2.04	2124.73	1.62	价格区间: 5日:60.58 	10日:57.01 	20日:36.21 	30日:53.56 	60日:64.54 	净利环增:-81.67;净利同增:1.18;营收环增:-77.11;营收同增:33.74;
        fangDiChan_zuShouTongQuan.put("002285", "世联行  ");//205	房地产服务   0.31	65.68	1.79	价格区间: 5日:79.69 	10日:56.67 	20日:22.57 	30日:22.57 	60日:22.57 	净利环增:98.04;净利同增:-239.37;营收环增:-41.51;营收同增:-24.77;
        fangDiChan_zuShouTongQuan.put("600604", "市北高新");//202	房地产服务   8.55	99.85	3.14	价格区间: 5日:97.92 	10日:71.64 	20日:41.03 	30日:41.03 	60日:41.03 	净利环增:-66.84;净利同增:223.61;营收环增:-22.98;营收同增:282.71;
        fangDiChan_zuShouTongQuan.put("000090", "天健集团");//192	工程建设     6.91	133.04	8.34	价格区间: 5日:86.93 	10日:86.93 	20日:86.93 	30日:86.93 	60日:89.25 	净利环增:70.91;净利同增:-1.64;营收环增:-66.64;营收同增:-6.65;
        fangDiChan_zuShouTongQuan.put("001979", "招商蛇口");//186	房地产开发   -5.49	1173.43	3.08	价格区间: 5日:29.69 	10日:26.67 	20日:19.72 	30日:38.04 	60日:50.09 	净利环增:-88.96;净利同增:-33.72;营收环增:-76.17;营收同增:48.36;
        fangDiChan_zuShouTongQuan.put("000002", "万科Ａ  ");//178	房地产开发   0.62	2266.95	1.84	价格区间: 5日:84.69 	10日:59.40 	20日:42.34 	30日:56.96 	60日:67.74 	净利环增:-75.51;净利同增:10.58;营收环增:-65.44;营收同增:0.65;
    }

    /**
     * fangDiChan_haiMianChengShi 海绵城市
     */
    public static Map<String, String> fangDiChan_haiMianChengShi = new HashMap<>();

    static {
        fangDiChan_haiMianChengShi.put("600502", "安徽建工");//279	工程建设     5.27	99.66	3.78	价格区间: 5日:88.50 	10日:69.93 	20日:53.55 	30日:61.42 	60日:61.42 	120日:69.18 	250日:70.75 		,当前价：5.79	,当前：2022-04-27 10:44:08
        fangDiChan_haiMianChengShi.put("002062", "宏润建设");//230	工程建设     -0.37	59.42	4.55	价格区间: 5日:69.91 	10日:69.91 	20日:66.39 	30日:66.39 	60日:35.43 	120日:52.00 	250日:52.00 		,当前价：5.39	,当前：2022-04-27 10:44:09
        fangDiChan_haiMianChengShi.put("600512", "腾达建设");//217	工程建设     2.84	57.88	3.2 	价格区间: 5日:62.50 	10日:24.10 	20日:14.49 	30日:14.49 	60日:30.59 	120日:37.57 	250日:45.87 		,当前价：3.62	,当前：2022-04-27 10:44:12
        fangDiChan_haiMianChengShi.put("002271", "东方雨虹");//197	装修建材     3.34	1131.56	2.67	价格区间: 5日:81.36 	10日:56.04 	20日:64.68 	30日:71.50 	60日:47.04 	120日:50.78 	250日:30.70 		,当前价：44.91	,当前：2022-04-27 10:44:15
    }

    /**
     * reits ["REITs概念"]：16;
     */
    public static Map<String, String> fangDiChan_reits = new HashMap<>();

    static {
        fangDiChan_reits.put("002314", "南山控股");//292	房地产开发   -1.28	125.10	2.03	价格区间: 5日:81.44 	10日:82.08 	20日:26.93 	30日:33.14 	60日:37.07 	净利环增:-120.98;净利同增:-51.76;营收环增:-82.57;营收同增:22.93;
        fangDiChan_reits.put("002059", "云南旅游");//234	旅游酒店     -0.33	61.76	1.99	价格区间: 5日:76.27 	10日:19.48 	20日:11.51 	30日:11.51 	60日:11.51 	净利环增:97.04;净利同增:-330.19;营收环增:-51.95;营收同增:-13.03;
        fangDiChan_reits.put("600622", "光大嘉宝");//231	房地产开发   10.05	68.99	2.25	价格区间: 5日:100.00	10日:41.33 	20日:38.91 	30日:53.21 	60日:56.93 	净利环增:-81.25;净利同增:3.47;营收环增:-60.32;营收同增:22.91;
        fangDiChan_reits.put("600466", "蓝光发展");//218	房地产开发   6.98	55.84	2.72	价格区间: 5日:100.00	10日:55.81 	20日:16.90 	30日:16.90 	60日:16.90 	净利环增:95.94;净利同增:-151.63;营收环增:34.65;营收同增:3.34;
        fangDiChan_reits.put("600048", "保利发展");//208	房地产开发   -2.04	2124.73	1.62	价格区间: 5日:61.54 	10日:57.92 	20日:36.78 	30日:53.97 	60日:64.86 	净利环增:-81.67;净利同增:1.18;营收环增:-77.11;营收同增:33.74;
        fangDiChan_reits.put("002285", "世联行  ");//205	房地产服务   0.31	65.68	1.79	价格区间: 5日:78.13 	10日:55.56 	20日:22.12 	30日:22.12 	60日:22.12 	净利环增:98.04;净利同增:-239.37;营收环增:-41.51;营收同增:-24.77;
    }

    /**
     * jianCai_diXiaGuanWang ["地下管网"]：9;
     */
    public static Map<String, String> fangDiChan_diXiaGuanWang = new HashMap<>();

    static {
        fangDiChan_diXiaGuanWang.put("003037", "三和管桩");//312	水泥建材     10.04	75.12	3.28	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	净利环增:-64.20;净利同增:-83.83;营收环增:-33.12;营收同增:-27.84;
        fangDiChan_diXiaGuanWang.put("002062", "宏润建设");//276	工程建设     10.02	71.44	0.31	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:87.00 	净利环增:-22.13;净利同增:-2.92;营收环增:-33.70;营收同增:-18.92;
        fangDiChan_diXiaGuanWang.put("000778", "新兴铸管");//183	钢铁行业     -0.41	191.56	1.04	价格区间: 5日:88.41 	10日:73.49 	20日:48.41 	30日:48.41 	60日:42.36 	净利环增:516.73;净利同增:31.40;营收环增:15.47;营收同增:-2.02;
    }

    /**
     * fangDiChan_zhuangPeiJianZhu 装配建筑
     */
    public static Map<String, String> fangDiChan_zhuangPeiJianZhu = new HashMap<>();

    static {
        fangDiChan_zhuangPeiJianZhu.put("002761", "浙江建投");//419	工程建设     1.26	295.64	4.65	价格区间: 5日:30.89 	10日:18.30 	20日:31.58 	30日:41.73 	60日:59.47 	120日:59.87 	250日:60.00 		,当前价：27.34	,当前：2022-04-11 11:36:30
        fangDiChan_zhuangPeiJianZhu.put("600510", "黑牡丹  ");//344	房地产开发   -5.31	111.93	6.46	价格区间: 5日:15.32 	10日:8.06  	20日:2.58  	30日:2.58  	60日:38.45 	120日:38.45 	250日:42.93 		,当前价：10.69	,当前：2022-04-11 11:36:31
        fangDiChan_zhuangPeiJianZhu.put("000498", "山东路桥");//327	工程建设     6.36	153.82	20.85	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：9.86	,当前：2022-04-11 11:36:32
        fangDiChan_zhuangPeiJianZhu.put("601155", "新城控股");//314	房地产开发   -4.75	689.71	3.46	价格区间: 5日:14.97 	10日:48.72 	20日:69.99 	30日:69.99 	60日:63.15 	120日:53.04 	250日:37.86 		,当前价：30.47	,当前：2022-04-11 11:36:33
        fangDiChan_zhuangPeiJianZhu.put("002135", "东南网架");//298	工程建设     0.09	137.19	3.17	价格区间: 5日:34.52 	10日:25.20 	20日:58.15 	30日:58.70 	60日:65.30 	120日:73.17 	250日:73.14 		,当前价：11.77	,当前：2022-04-11 11:36:34
    }

    /**
     * fangDiChan_gongChengJiXie ["工程机械概念"]：20;
     */
    public static Map<String, String> fangDiChan_gongChengJiXie = new HashMap<>();

    static {
        fangDiChan_gongChengJiXie.put("605305", "中际联合");//313	工程机械     0.04	62.61	null	价格区间: 5日:13.96 	10日:8.94  	20日:5.25  	30日:2.84  	60日:1.82  	120日:1.07  	250日:20.19 		,当前价：56.92	,当前：2022-04-08 11:10:04
        fangDiChan_gongChengJiXie.put("600375", "汉马科技");//236	工程机械     -0.79	57.32	null	价格区间: 5日:8.55  	10日:5.95  	20日:18.18 	30日:18.18 	60日:14.87 	120日:15.58 	250日:30.41 		,当前价：8.76	,当前：2022-04-08 11:10:05
    }

    /**
     * fangDiChan_minBao 民爆概念
     */
    public static Map<String, String> fangDiChan_minBao = new HashMap<>();

    static {
        fangDiChan_minBao.put("002497", "雅化集团");//213	化学制品     0.19	306.70	1.1 	价格区间: 5日:94.76 	10日:50.44 	20日:42.30 	30日:42.30 	60日:27.17 	净利环增:235.88;净利同增:1210.02;营收环增:48.14;营收同增:210.22;
    }

    /**
     * fangDiChan 房地产:租售同权,建筑节能,海绵城市
     */
    public static Map<String, String> fangDiChan = new HashMap<>();

    static {
        fangDiChan.putAll(fangDiChan_zuShouTongQuan);//租售同权
        fangDiChan.putAll(fangDiChan_haiMianChengShi);//海绵城市
        fangDiChan.putAll(fangDiChan_reits);
        fangDiChan.putAll(fangDiChan_jianZhuJieNeng);//建筑节能
        fangDiChan.putAll(fangDiChan_diXiaGuanWang);//地下管网
        fangDiChan.putAll(fangDiChan_zhuangPeiJianZhu);//装配建筑
        fangDiChan.putAll(fangDiChan_gongChengJiXie);//工程机械概念
        fangDiChan.putAll(fangDiChan_minBao);//民爆概念
    }

    /**
     * guiJinShu 贵金属
     */
    public static Map<String, String> guiJinShu = new HashMap<>();

    static {
        guiJinShu.putAll(guiJinShu_peiYuZuanShi);
    }

    /**
     * yinHang ["银行 "]：42;
     */
    public static Map<String, String> yinHang = new HashMap<>();

    static {
        yinHang.put("001227", "兰州银行");//221	银行         1.97	353.70	0.8 	价格区间: 5日:57.35 	10日:72.12 	20日:76.98 	30日:79.29 	60日:59.57 	120日:59.57 	250日:59.57 		,当前价：6.21	,当前：2022-04-11 00:28:22
        yinHang.put("601838", "成都银行");//209	银行         -0.38	564.59	0.8 	价格区间: 5日:69.68 	10日:72.86 	20日:82.52 	30日:82.52 	60日:85.23 	120日:88.91 	250日:91.01 		,当前价：15.63	,当前：2022-04-11 00:28:23
        yinHang.put("601665", "齐鲁银行");//206	银行         9.95	308.75	2.2 	价格区间: 5日:89.50 	10日:90.59 	20日:91.00 	30日:91.00 	60日:91.00 	120日:91.00 	250日:25.84 		,当前价：6.74	,当前：2022-04-11 00:28:24
        yinHang.put("601528", "瑞丰银行");//200	银行         -0.1	155.46	0.86	价格区间: 5日:66.23 	10日:71.74 	20日:74.00 	30日:74.00 	60日:45.40 	120日:39.78 	250日:17.92 		,当前价：10.3	,当前：2022-04-11 00:28:26
        yinHang.put("600926", "杭州银行");//187	银行         1.21	890.13	0.64	价格区间: 5日:80.35 	10日:83.08 	20日:87.27 	30日:87.27 	60日:81.18 	120日:70.62 	250日:62.62 		,当前价：15.01	,当前：2022-04-11 00:28:27
        yinHang.put("601166", "兴业银行");//184	银行         1.85	4568.24	0.64	价格区间: 5日:89.37 	10日:92.28 	20日:93.55 	30日:80.15 	60日:72.17 	120日:76.97 	250日:75.08 		,当前价：21.99	,当前：2022-04-11 00:28:27
        yinHang.put("601128", "常熟银行");//183	银行         1.36	224.20	0.8 	价格区间: 5日:79.17 	10日:82.76 	20日:88.10 	30日:88.10 	60日:88.10 	120日:89.64 	250日:92.59 		,当前价：8.18	,当前：2022-04-11 00:28:28
        yinHang.put("600919", "江苏银行");//173	银行         0.82	1087.05	0.8 	价格区间: 5日:75.95 	10日:81.55 	20日:88.13 	30日:88.13 	60日:88.13 	120日:89.78 	250日:85.85 		,当前价：7.36	,当前：2022-04-11 00:28:29
        yinHang.put("002142", "宁波银行");//171	银行         2.37	2619.64	1.4 	价格区间: 5日:98.97 	10日:99.35 	20日:99.63 	30日:99.63 	60日:79.70 	120日:79.70 	250日:82.63 		,当前价：39.67	,当前：2022-04-11 00:28:30
        yinHang.put("000001", "平安银行");//170	银行         0.74	3182.57	0.66	价格区间: 5日:83.75 	10日:87.38 	20日:91.75 	30日:92.44 	60日:73.27 	120日:43.15 	250日:26.63 		,当前价：16.4	,当前：2022-04-11 00:28:30
        yinHang.put("600036", "招商银行");//153	银行         0.68	11898.720.74	价格区间: 5日:71.20 	10日:84.20 	20日:93.57 	30日:70.18 	60日:57.89 	120日:46.92 	250日:43.27 		,当前价：47.18	,当前：2022-04-11 00:28:33

    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(fangDiChan);//房地产
        all.putAll(quanShangGaiNian);//券商概念
        all.putAll(yinHang);//银行
        all.putAll(guiJinShu); //贵金属
    }

    public static void main(String[] args) {
        String spDate = null;
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
//        String date = "2022-04-08";
//        spDate = "2022-04-08";//特定日期：下一交易日
        KlineService.checkMaDemo(all, date, spDate);// all   huaGong   huaGong_linHuaGong    yinHang
    }
}
