package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：医疗
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStYiLiao {

    /**
     * yiMei_maoFaYiLiao ["毛发医疗"]：8;
     */
    public static Map<String, String> yiMei_maoFaYiLiao = new HashMap<>();

    static {
        yiMei_maoFaYiLiao.put("000615", "奥园美谷");//304	美容护理	2.01	67.49	21.46	价格区间: 5日:74.68 	10日:74.68 	20日:83.40 	30日:84.26 	60日:42.58 	120日:17.92 	250日:8.57  		,当前价：8.64	,当前：2022-03-31 10:10:30
        yiMei_maoFaYiLiao.put("000516", "ST国医  ");//283	医疗服务	1.82	190.95	3.19	价格区间: 5日:87.21 	10日:93.04 	20日:78.26 	30日:73.17 	60日:37.11 	120日:29.03 	250日:11.94 		,当前价：8.39	,当前：2022-03-31 10:10:32
        yiMei_maoFaYiLiao.put("600557", "康缘药业");//280	中药    	3.6 	81.39	3.8 	价格区间: 5日:83.75 	10日:82.29 	20日:86.86 	30日:92.91 	60日:89.23 	120日:90.98 	250日:90.98 		,当前价：14.12	,当前：2022-03-31 10:10:33
        yiMei_maoFaYiLiao.put("002612", "朗姿股份");//278	纺织服装	-0.16	109.73	3.91	价格区间: 5日:77.23 	10日:77.23 	20日:44.59 	30日:44.59 	60日:31.94 	120日:18.05 	250日:7.47  		,当前价：24.8	,当前：2022-03-31 10:10:34
    }

    /**
     * zhongYao_zhongYaoGaiNian ["中药概念"]：82;
     */
    public static Map<String, String> zhongYao_zhongYaoGaiNian = new HashMap<>();

    static {
        zhongYao_zhongYaoGaiNian.put("002349", "精华制药");//535	中药    	0.18	176.68	1.6 	价格区间: 5日:25.12 	10日:53.97 	20日:63.44 	30日:63.44 	60日:68.84 	120日:73.78 	250日:74.75 		,当前价：21.7	,当前：2022-03-30 11:22:03
        zhongYao_zhongYaoGaiNian.put("002326", "永太科技");//472	化学制品	10   	334.59	2.75	价格区间: 5日:48.36 	10日:63.69 	20日:72.28 	30日:72.28 	60日:44.92 	120日:21.68 	250日:40.77 		,当前价：38.17	,当前：2022-03-30 11:22:05
        zhongYao_zhongYaoGaiNian.put("002317", "众生药业");//402	中药    	1.88	132.11	1.15	价格区间: 5日:27.21 	10日:52.93 	20日:65.86 	30日:68.50 	60日:69.25 	120日:73.67 	250日:74.08 		,当前价：16.22	,当前：2022-03-30 11:22:06
        zhongYao_zhongYaoGaiNian.put("600771", "广誉远  ");//377	中药    	-2.96	177.12	2.34	价格区间: 5日:68.95 	10日:78.34 	20日:82.37 	30日:82.37 	60日:46.58 	120日:47.48 	250日:53.87 		,当前价：36.0	,当前：2022-03-30 11:22:07
        zhongYao_zhongYaoGaiNian.put("600976", "健民集团");//371	中药    	-0.6	88.65	1.43	价格区间: 5日:47.34 	10日:47.11 	20日:54.78 	30日:51.72 	60日:22.95 	120日:39.77 	250日:54.85 		,当前价：57.79	,当前：2022-03-30 11:22:09
        zhongYao_zhongYaoGaiNian.put("002435", "长江健康");//365	化学制药	-2.93	81.95	2.12	价格区间: 5日:25.51 	10日:11.06 	20日:36.38 	30日:42.75 	60日:44.73 	120日:44.73 	250日:44.73 		,当前价：6.63	,当前：2022-03-30 11:22:10
        zhongYao_zhongYaoGaiNian.put("002750", "龙津药业");//364	中药    	4.75	64.48	1.45	价格区间: 5日:38.89 	10日:58.46 	20日:63.50 	30日:63.50 	60日:42.79 	120日:57.70 	250日:57.70 		,当前价：16.1	,当前：2022-03-30 11:22:11
        zhongYao_zhongYaoGaiNian.put("600587", "新华医疗");//362	医疗器械	1.04	103.86	1.76	价格区间: 5日:42.02 	10日:27.62 	20日:42.79 	30日:42.79 	60日:33.19 	120日:43.03 	250日:52.20 		,当前价：25.21	,当前：2022-03-30 11:22:12
        zhongYao_zhongYaoGaiNian.put("600196", "复星医药");//352	化学制药	3.41	1431.89	2.24	价格区间: 5日:88.40 	10日:82.22 	20日:88.61 	30日:88.61 	60日:88.61 	120日:88.61 	250日:36.48 		,当前价：55.87	,当前：2022-03-30 11:22:13
        zhongYao_zhongYaoGaiNian.put("002907", "华森制药");//347	中药    	-2.81	63.99	2.68	价格区间: 5日:16.84 	10日:48.25 	20日:58.97 	30日:58.97 	60日:44.83 	120日:48.88 	250日:48.88 		,当前价：15.93	,当前：2022-03-30 11:22:14
        zhongYao_zhongYaoGaiNian.put("600129", "太极集团");//342	中药    	-2.54	117.62	5.88	价格区间: 5日:89.58 	10日:90.70 	20日:93.92 	30日:93.92 	60日:48.29 	120日:59.06 	250日:62.30 		,当前价：21.12	,当前：2022-03-30 11:22:15
        zhongYao_zhongYaoGaiNian.put("605199", "葫芦娃  ");//334	中药    	-3.94	88.86	2.22	价格区间: 5日:28.25 	10日:28.25 	20日:62.33 	30日:62.33 	60日:42.50 	120日:42.50 	250日:21.07 		,当前价：22.21	,当前：2022-03-30 11:22:16
        zhongYao_zhongYaoGaiNian.put("002603", "以岭药业");//334	中药    	-1.22	498.54	2.36	价格区间: 5日:62.29 	10日:60.99 	20日:83.48 	30日:83.48 	60日:87.98 	120日:89.91 	250日:89.91 		,当前价：29.84	,当前：2022-03-30 11:22:17
        zhongYao_zhongYaoGaiNian.put("002411", "延安必康");//331	医药商业	0.97	143.12	1.36	价格区间: 5日:28.85 	10日:22.39 	20日:45.55 	30日:39.73 	60日:28.52 	120日:18.81 	250日:37.36 		,当前价：9.34	,当前：2022-03-30 11:22:18
//        ["独家药品"]：25;
//        tiWaiZhenDuan.put("600976", "健民集团");//399	中药    	4.98	99.31	14.76	价格区间: 5日:99.84 	10日:99.87 	20日:99.87 	30日:61.23 	60日:41.17 	120日:54.01 	250日:65.79 		,当前价：64.74	,当前：2022-03-23 10:53:31
//        tiWaiZhenDuan.put("600771", "广誉远  ");//352	中药    	7.03	164.13	2.55	价格区间: 5日:100.00	10日:100.00	20日:77.81 	30日:77.81 	60日:30.61 	120日:36.18 	250日:48.81 		,当前价：33.36	,当前：2022-03-23 10:53:33
//        tiWaiZhenDuan.put("002603", "以岭药业");//339	中药    	2.22	491.35	2.75	价格区间: 5日:43.97 	10日:72.54 	20日:76.28 	30日:77.43 	60日:83.79 	120日:85.50 	250日:86.37 		,当前价：29.41	,当前：2022-03-23 10:53:34
    }

    /**
     * zhongYao_duJiaYaoPin ["独家药品"]：25;
     */
    public static Map<String, String> zhongYao_duJiaYaoPin = new HashMap<>();

    static {
        zhongYao_duJiaYaoPin.put("002603", "以岭药业");//380	中药         2.42	593.60	11.24	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：35.53	,当前：2022-04-07 14:13:23
        zhongYao_duJiaYaoPin.put("600976", "健民集团");//358	中药         -3.32	83.88	2.17	价格区间: 5日:6.97  	10日:5.34  	20日:24.18 	30日:24.18 	60日:10.29 	120日:28.41 	250日:47.16 		,当前价：54.68	,当前：2022-04-07 14:13:25
        zhongYao_duJiaYaoPin.put("600771", "广誉远  ");//346	中药         0.59	168.66	2.49	价格区间: 5日:20.00 	10日:50.14 	20日:59.42 	30日:59.42 	60日:35.98 	120日:37.03 	250日:48.42 		,当前价：34.28	,当前：2022-04-07 14:13:26
        zhongYao_duJiaYaoPin.put("605199", "葫芦娃  ");//330	中药         -3.75	85.30	2.76	价格区间: 5日:54.90 	10日:33.40 	20日:44.17 	30日:44.17 	60日:30.74 	120日:30.74 	250日:15.24 		,当前价：21.32	,当前：2022-04-07 14:13:27
        zhongYao_duJiaYaoPin.put("603439", "贵州三力");//298	中药         -2.79	71.53	2.71	价格区间: 5日:16.72 	10日:44.30 	20日:61.34 	30日:61.34 	60日:64.72 	120日:67.81 	250日:52.37 		,当前价：17.41	,当前：2022-04-07 14:13:29
        zhongYao_duJiaYaoPin.put("000999", "华润三九");//292	中药         -0.38	413.10	2.77	价格区间: 5日:40.19 	10日:64.01 	20日:75.06 	30日:75.06 	60日:75.06 	120日:83.49 	250日:83.83 		,当前价：42.2	,当前：2022-04-07 14:13:30
        zhongYao_duJiaYaoPin.put("002424", "贵州百灵");//269	中药         -8.09	110.64	3.47	价格区间: 5日:6.19  	10日:31.60 	20日:42.29 	30日:42.29 	60日:42.29 	120日:42.61 	250日:42.61 		,当前价：7.84	,当前：2022-04-07 14:13:31
        zhongYao_duJiaYaoPin.put("600085", "同仁堂  ");//263	中药         -3.46	608.25	1.57	价格区间: 5日:24.22 	10日:53.92 	20日:66.73 	30日:66.73 	60日:38.64 	120日:55.09 	250日:62.72 		,当前价：44.35	,当前：2022-04-07 14:13:32
    }

    /**
     * chuangXinYao_cro ["CRO "]：4;
     */
    public static Map<String, String> chuangXinYao_cro = new HashMap<>();

    static {
        chuangXinYao_cro.put("603456", "九洲药业");//329	化学制药	1.05	407.80	0.82	价格区间: 5日:69.46 	10日:71.64 	20日:47.86 	30日:58.76 	60日:54.55 	120日:45.25 	250日:54.61 		,当前价：48.98	,当前：2022-03-31 10:05:51
        chuangXinYao_cro.put("002821", "凯莱英  ");//319	医疗服务	1.16	1001.64	1.98	价格区间: 5日:85.75 	10日:92.88 	20日:94.45 	30日:94.45 	60日:60.08 	120日:43.61 	250日:43.79 		,当前价：378.92	,当前：2022-03-31 10:05:53
        chuangXinYao_cro.put("603259", "药明康德");//298	医疗服务	-0.79	3326.70	0.92	价格区间: 5日:37.27 	10日:56.88 	20日:75.42 	30日:75.42 	60日:76.71 	120日:40.60 	250日:33.57 		,当前价：112.55	,当前：2022-03-31 10:05:55
        chuangXinYao_cro.put("603127", "昭衍新药");//291	医疗服务	0.78	445.30	5.51	价格区间: 5日:71.88 	10日:79.92 	20日:83.30 	30日:85.95 	60日:90.72 	120日:39.53 	250日:31.84 		,当前价：116.8	,当前：2022-03-31 10:05:56
    }
    /**
     * chuangXinYao_qingGaoSu ["青蒿素"]：8;
     */
    public static Map<String, String> chuangXinYao_qingGaoSu = new HashMap<>();

    static {
        chuangXinYao_qingGaoSu.put("600196", "复星医药");//321	化学制药     0   	1232.50	1.32	价格区间: 5日:1.48  	10日:1.44  	20日:32.97 	30日:48.92 	60日:48.92 	120日:48.92 	250日:19.54 		,当前价：48.09	,当前：2022-04-12 11:42:24
        chuangXinYao_qingGaoSu.put("002821", "凯莱英  ");//295	医疗服务     2.86	884.62	1.42	价格区间: 5日:19.52 	10日:13.37 	20日:26.66 	30日:39.31 	60日:54.61 	120日:26.02 	250日:26.02 		,当前价：334.65	,当前：2022-04-12 11:42:25
        chuangXinYao_qingGaoSu.put("600062", "华润双鹤");//229	化学制药     10.01	185.80	5.06	价格区间: 5日:100.00	10日:98.03 	20日:98.94 	30日:98.94 	60日:98.94 	120日:98.94 	250日:98.99 		,当前价：17.81	,当前：2022-04-12 11:42:27
        chuangXinYao_qingGaoSu.put("600422", "昆药集团");//224	中药         2.74	85.23	3.02	价格区间: 5日:48.08 	10日:34.09 	20日:46.30 	30日:46.30 	60日:51.19 	120日:64.08 	250日:65.03 		,当前价：11.24	,当前：2022-04-12 11:42:28
        chuangXinYao_qingGaoSu.put("600267", "海正药业");//218	化学制药     -1.76	146.87	1.01	价格区间: 5日:1.50  	10日:0.85  	20日:0.58  	30日:0.58  	60日:0.52  	120日:12.56 	250日:12.56 		,当前价：12.28	,当前：2022-04-12 11:42:29
    }

    /**
     * chuangXinYao_cart ["CAR-T细胞疗法"]：7;
     */
    public static Map<String, String> chuangXinYao_cart = new HashMap<>();

    static {
        chuangXinYao_cart.put("600196", "复星医药");//334	化学制药     -6.36	1321.43	2.27	价格区间: 5日:20.92 	10日:35.91 	20日:69.27 	30日:69.27 	60日:69.22 	120日:69.22 	250日:27.65 		,当前价：51.56	,当前：2022-04-07 14:18:12
        chuangXinYao_cart.put("002411", "延安必康");//325	医药商业     -1.87	136.37	2.91	价格区间: 5日:9.52  	10日:4.84  	20日:22.51 	30日:19.63 	60日:28.44 	120日:14.48 	250日:34.18 		,当前价：8.9	,当前：2022-04-07 14:18:14
        chuangXinYao_cart.put("002605", "姚记科技");//315	家用轻工     1.14	86.35	2.2 	价格区间: 5日:76.26 	10日:76.26 	20日:82.47 	30日:80.85 	60日:25.36 	120日:28.92 	250日:29.51 		,当前价：21.33	,当前：2022-04-07 14:18:15
        chuangXinYao_cart.put("000566", "海南海药");//301	化学制药     -10.03	70.97	13.66	价格区间: 5日:51.59 	10日:53.44 	20日:69.65 	30日:69.65 	60日:69.65 	120日:72.52 	250日:44.48 		,当前价：5.47	,当前：2022-04-07 14:18:16
        chuangXinYao_cart.put("603259", "药明康德");//283	医疗服务     -1.19	3156.81	1.36	价格区间: 5日:12.79 	10日:21.17 	20日:58.34 	30日:58.34 	60日:64.91 	120日:36.86 	250日:27.66 		,当前价：106.8	,当前：2022-04-07 14:18:17
    }

    /**
     * zhiYao_diSaiMiSong ["地塞米松"]：6;
     */
    public static Map<String, String> zhiYao_diSaiMiSong = new HashMap<>();

    static {
        zhiYao_diSaiMiSong.put("600199", "金种子酒");//376	酿酒行业	-0.39	152.61	5.84	价格区间: 5日:15.82 	10日:7.14  	20日:7.14  	30日:29.33 	60日:51.30 	120日:51.30 	250日:52.92 		,当前价：23.2	,当前：2022-03-31 10:30:23
        zhiYao_diSaiMiSong.put("002907", "华森制药");//342	中药    	1.88	67.49	4.38	价格区间: 5日:27.27 	10日:49.06 	20日:64.12 	30日:64.12 	60日:48.75 	120日:52.51 	250日:52.51 		,当前价：16.8	,当前：2022-03-31 10:30:25
        zhiYao_diSaiMiSong.put("600420", "国药现代");//216	化学制药	2.27	115.43	1.71	价格区间: 5日:61.54 	10日:52.78 	20日:62.68 	30日:62.68 	60日:62.86 	120日:62.86 	250日:62.86 		,当前价：11.24	,当前：2022-03-31 10:30:26
    }
    /**
     * zhiYao_aZiHaiMo ["阿兹海默"]：9;
     */
    public static Map<String, String> zhiYao_aZiHaiMo = new HashMap<>();

    static {
        zhiYao_aZiHaiMo.put("002082", "万邦德  ");//240	化学制药	0.71	70.29	2.08	价格区间: 5日:59.17 	10日:76.56 	20日:78.19 	30日:67.62 	60日:24.17 	120日:24.17 	250日:24.17 		,当前价：11.37	,当前：2022-03-31 09:52:34
        zhiYao_aZiHaiMo.put("000756", "新华制药");//238	化学制药	1.15	61.29	3.75	价格区间: 5日:32.26 	10日:46.15 	20日:60.15 	30日:60.15 	60日:39.31 	120日:45.66 	250日:45.66 		,当前价：9.69	,当前：2022-03-31 09:52:36
        zhiYao_aZiHaiMo.put("002020", "京新药业");//218	化学制药	1.52	90.62	2.77	价格区间: 5日:28.14 	10日:55.73 	20日:60.39 	30日:60.39 	60日:60.39 	120日:62.27 	250日:63.61 		,当前价：10.01	,当前：2022-03-31 09:52:37
        zhiYao_aZiHaiMo.put("600227", "圣济堂  ");//210	化学制药	-1.61	62.14	3.05	价格区间: 5日:54.35 	10日:67.19 	20日:73.42 	30日:73.42 	60日:74.12 	120日:74.12 	250日:55.93 		,当前价：3.67	,当前：2022-03-31 09:52:38
    }

    /**
     * ganSuGaiNian ["肝素概念"]：9;
     */
    public static Map<String, String> zhiYao_ganSuGaiNian = new HashMap<>();

    static {
        zhiYao_ganSuGaiNian.put("600196", "复星医药");//329	化学制药	2.22	1323.99	1.75	价格区间: 5日:34.80 	10日:63.07 	20日:66.70 	30日:66.70 	60日:66.70 	120日:65.43 	250日:27.88 		,当前价：51.66	,当前：2022-03-24 10:56:16
        zhiYao_ganSuGaiNian.put("002550", "千红制药");//329	化学制药	-1.01	75.64	1.27	价格区间: 5日:28.95 	10日:17.89 	20日:56.84 	30日:56.84 	60日:38.82 	120日:43.11 	250日:47.58 		,当前价：5.91	,当前：2022-03-24 10:56:18
    }

    /**
     * chaoJiZhenJun ["超级真菌"]：11;
     */
    public static Map<String, String> chaoJiZhenJun = new HashMap<>();

    static {
        chaoJiZhenJun.put("002435", "长江健康");//372	化学制药	-1.55	86.52	0.95	价格区间: 5日:26.71 	10日:12.62 	20日:48.77 	30日:52.38 	60日:53.37 	120日:53.37 	250日:53.37 		,当前价：7.0	,当前：2022-03-24 11:02:11
        chaoJiZhenJun.put("002581", "未名医药");//320	生物制品	-0.51	116.64	0.96	价格区间: 5日:57.50 	10日:47.54 	20日:60.98 	30日:60.98 	60日:33.24 	120日:37.04 	250日:55.90 		,当前价：17.68	,当前：2022-03-24 11:02:12
        chaoJiZhenJun.put("600521", "华海药业");//295	化学制药	-0.67	332.66	0.65	价格区间: 5日:9.95  	10日:7.18  	20日:24.10 	30日:38.01 	60日:38.01 	120日:51.91 	250日:56.74 		,当前价：22.3	,当前：2022-03-24 11:02:14
    }

    /**
     * ["新冠药物"]：9;
     */
    public static Map<String, String> xinGuan_xinGuanYaoWu = new HashMap<>();

    static {
        xinGuan_xinGuanYaoWu.put("002349", "精华制药");//468	中药         -4.29	141.59	4.57	价格区间: 5日:2.56  	10日:1.12  	20日:27.24 	30日:32.43 	60日:38.02 	120日:51.54 	250日:53.32 		,当前价：17.39	,当前：2022-04-11 11:34:50
        xinGuan_xinGuanYaoWu.put("002603", "以岭药业");//399	中药         4.17	680.31	7.06	价格区间: 5日:97.72 	10日:98.17 	20日:98.59 	30日:98.75 	60日:98.84 	120日:99.05 	250日:99.05 		,当前价：40.72	,当前：2022-04-11 11:34:51
        xinGuan_xinGuanYaoWu.put("600196", "复星医药");//321	化学制药     -4.02	1254.28	3.11	价格区间: 5日:5.59  	10日:5.45  	20日:48.80 	30日:53.84 	60日:53.84 	120日:53.84 	250日:21.50 		,当前价：48.94	,当前：2022-04-11 11:34:53
        xinGuan_xinGuanYaoWu.put("002584", "西陇科学");//272	电子化学品   -5.66	51.73	2.79	价格区间: 5日:4.40  	10日:2.99  	20日:2.56  	30日:2.56  	60日:11.62 	120日:39.88 	250日:42.09 		,当前价：8.84	,当前：2022-04-11 11:34:54
        xinGuan_xinGuanYaoWu.put("600668", "尖峰集团");//265	水泥建材     -5.43	61.76	2.39	价格区间: 5日:12.60 	10日:6.33  	20日:4.15  	30日:15.43 	60日:20.95 	120日:48.48 	250日:50.29 		,当前价：17.95	,当前：2022-04-11 11:34:55
    }

    /**
     * mapYiLiaoXinGuanJianCe 概念：["新冠检测"];股票个数：15;
     */
    public static Map<String, String> xinGuan_xinGuanJianCe = new HashMap<>();

    static {
        xinGuan_xinGuanJianCe.put("002432", "九安医疗");//575	医疗器械	10   	284.19	1.66	价格区间: 5日:100.00	10日:69.31 	20日:51.38 	30日:51.38 	60日:58.16 	120日:64.49 	250日:64.49 		,当前价：59.38	,当前：2022-03-11 13:51:13
        xinGuan_xinGuanJianCe.put("002932", "明德生物");//377	医疗器械	10   	99.88	5.46	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:46.32 	120日:55.00 	250日:65.00 		,当前价：95.23	,当前：2022-03-11 13:51:15
        xinGuan_xinGuanJianCe.put("002584", "西陇科学");//297	电子化学品	6.8 	64.37	2.48	价格区间: 5日:87.82 	10日:87.82 	20日:90.49 	30日:90.49 	60日:57.95 	120日:66.05 	250日:68.17 		,当前价：11.0	,当前：2022-03-11 13:51:16
        xinGuan_xinGuanJianCe.put("603392", "万泰生物");//296	医疗器械	1.96	1532.17	1.7 	价格区间: 5日:82.19 	10日:73.06 	20日:91.33 	30日:91.33 	60日:92.18 	120日:88.09 	250日:69.31 		,当前价：252.4	,当前：2022-03-11 13:51:17
    }

    /**
     * tiWaiZhenDuan ["体外诊断"]：19;
     */
    public static Map<String, String> xinGuan_tiWaiZhenDuan = new HashMap<>();

    static {
        xinGuan_tiWaiZhenDuan.put("002432", "九安医疗");//576	医疗器械	5.89	326.89	5.16	价格区间: 5日:80.00 	10日:83.15 	20日:89.66 	30日:82.99 	60日:58.49 	120日:75.23 	250日:75.23 		,当前价：68.3	,当前：2022-03-28 11:33:02
        xinGuan_tiWaiZhenDuan.put("002932", "明德生物");//388	医疗器械	10   	102.68	19.78	价格区间: 5日:100.00	10日:72.94 	20日:76.75 	30日:79.70 	60日:51.18 	120日:59.18 	250日:67.54 		,当前价：97.9	,当前：2022-03-28 11:33:04
        xinGuan_tiWaiZhenDuan.put("605369", "拱东医疗");//330	医疗器械	0.45	152.80	1.99	价格区间: 5日:56.20 	10日:73.66 	20日:52.74 	30日:46.36 	60日:43.99 	120日:70.91 	250日:81.98 		,当前价：135.67	,当前：2022-03-28 11:33:06
        xinGuan_tiWaiZhenDuan.put("603392", "万泰生物");//300	医疗器械	0.19	1648.11	2.34	价格区间: 5日:54.93 	10日:65.24 	20日:65.24 	30日:76.26 	60日:80.53 	120日:80.53 	250日:79.55 		,当前价：271.5	,当前：2022-03-28 11:33:07
    }

    /**
     * changShouYao ["长寿药"]：7;
     */
    public static Map<String, String> zhongYao_changShouYao = new HashMap<>();

    static {
        zhongYao_changShouYao.put("002317", "众生药业");//380	中药         1.08	121.60	3.14	价格区间: 5日:29.76 	10日:19.43 	20日:40.78 	30日:49.43 	60日:54.14 	120日:60.73 	250日:61.34 		,当前价：14.93	,当前：2022-04-11 11:43:19
        zhongYao_changShouYao.put("000639", "西王食品");//205	食品饮料     0.96	56.78	6.01	价格区间: 5日:30.00 	10日:18.92 	20日:52.73 	30日:52.73 	60日:52.73 	120日:52.73 	250日:49.79 		,当前价：5.26	,当前：2022-04-11 11:43:21
        zhongYao_changShouYao.put("600062", "华润双鹤");//204	化学制药     9.99	168.90	5.43	价格区间: 5日:59.74 	10日:57.96 	20日:74.36 	30日:74.36 	60日:74.36 	120日:74.51 	250日:75.61 		,当前价：16.19	,当前：2022-04-11 11:43:22
        zhongYao_changShouYao.put("002626", "金达威  ");//194	食品饮料     -2.4	173.29	2.22	价格区间: 5日:8.14  	10日:7.08  	20日:26.68 	30日:26.68 	60日:26.68 	120日:26.44 	250日:8.43  		,当前价：28.11	,当前：2022-04-11 11:43:23
    }

    /**
     * xinGuan 医疗-新冠-汇总:概念：["新冠药物","新冠检测","体外诊断"];股票个数：29;
     */
    public static Map<String, String> xinGuan = new HashMap<>();

    static {
        xinGuan.putAll(xinGuan_xinGuanYaoWu);//新冠药物
        xinGuan.putAll(xinGuan_xinGuanJianCe);//新冠检测
        xinGuan.putAll(xinGuan_tiWaiZhenDuan);//体外诊断
    }

    /**
     * chuangXinYao 创新药：CRO,青蒿素,CAR-T细胞疗法
     */
    public static Map<String, String> chuangXinYao = new HashMap<>();

    static {
        chuangXinYao.putAll(chuangXinYao_qingGaoSu);//青蒿素
        chuangXinYao.putAll(chuangXinYao_cro);//CRO
        chuangXinYao.putAll(chuangXinYao_cart);//CAR-T细胞疗法
    }

    /**
     * zhongYao 中药：中药概念,长寿药,独家药品
     */
    public static Map<String, String> zhongYao = new HashMap<>();

    static {
        zhongYao.putAll(zhongYao_zhongYaoGaiNian);//中药概念
        zhongYao.putAll(zhongYao_changShouYao);//长寿药
        zhongYao.putAll(zhongYao_duJiaYaoPin);//独家药品
    }

    /**
     * zhongYao_yiMiaoLengLian ["疫苗冷链"]：14;
     */
    public static Map<String, String> zhongYao_yiMiaoLengLian = new HashMap<>();

    static {
        zhongYao_yiMiaoLengLian.put("002639", "雪人股份");//369	通用设备     5.76	99.36	2.49	价格区间: 5日:80.00 	10日:81.28 	20日:63.36 	30日:63.36 	60日:40.18 	120日:50.52 	250日:54.75 		,当前价：12.86	,当前：2022-04-12 13:36:02
        zhongYao_yiMiaoLengLian.put("000519", "中兵红箭");//351	专用设备     -1.86	286.73	1.04	价格区间: 5日:32.27 	10日:32.14 	20日:57.42 	30日:59.73 	60日:59.28 	120日:27.14 	250日:53.94 		,当前价：20.59	,当前：2022-04-12 13:36:03
        zhongYao_yiMiaoLengLian.put("000811", "冰轮环境");//287	通用设备     -4   	77.05	1.92	价格区间: 5日:45.93 	10日:40.31 	20日:25.40 	30日:25.08 	60日:13.44 	120日:12.50 	250日:38.19 		,当前价：10.33	,当前：2022-04-12 13:36:04
        zhongYao_yiMiaoLengLian.put("002589", "瑞康医药");//274	医药商业     0.45	67.56	1.77	价格区间: 5日:3.93  	10日:16.35 	20日:26.17 	30日:29.49 	60日:30.16 	120日:34.91 	250日:34.91 		,当前价：4.49	,当前：2022-04-12 13:36:06
        zhongYao_yiMiaoLengLian.put("000963", "华东医药");//227	化学制药     3.14	546.47	1.84	价格区间: 5日:48.99 	10日:48.99 	20日:35.14 	30日:20.55 	60日:14.38 	120日:13.77 	250日:14.84 		,当前价：31.23	,当前：2022-04-12 13:36:07
    }

    /**
     * zhiYao 制药：
     */
    public static Map<String, String> zhiYao = new HashMap<>();

    static {
        zhiYao.putAll(zhiYao_ganSuGaiNian);//肝素概念
        zhiYao.putAll(zhiYao_aZiHaiMo);//阿兹海默
        zhiYao.putAll(zhiYao_diSaiMiSong);//地塞米松
        zhiYao.putAll(zhongYao_yiMiaoLengLian);//疫苗冷链
    }

    /**
     * yiMei 医疗美容:毛发医疗
     */
    public static Map<String, String> yiMei = new HashMap<>();

    static {
        yiMei.putAll(yiMei_maoFaYiLiao);//毛发医疗
    }

    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(xinGuan);//医疗-新冠
        all.putAll(chuangXinYao);//医疗-创新药
        all.putAll(zhongYao);//医疗-中药
        all.putAll(zhiYao);//制药
        all.putAll(yiMei);//医疗美容:毛发医疗

        all.putAll(chaoJiZhenJun);//超级真菌

    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStYiLiao.all, date);
//        StockStatDemo.checkMaDemo(ContMapStYiLiao.xinGuan, date);
//        StockStatDemo.checkMaDemo(ContMapStYiLiao.zhiYao, date);
//        StockStatDemo.checkMaDemo(ContMapStYiLiao.chuangXinYao, date);
    }
}
