package utils;

import ttjj.service.KlineService;
import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：指数
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStZhiShu {
    /**
     * shangzheng_50 上证50_
     */
    public static Map<String, String> shangZheng_50 = new HashMap<>();

    static {
        shangZheng_50.put("600048", "保利发展");//195	房地产开发   -2.31	2079.24	1.72	价格区间: 5日:27.17 	10日:16.08 	20日:22.55 	30日:58.31 	60日:58.31 	120日:66.75 	250日:75.94 		,当前价：17.37	,当前：2022-04-25 11:46:59
        shangZheng_50.put("601088", "中国神华");//195	煤炭行业     -2.53	5749.95	1.68	价格区间: 5日:36.82 	10日:22.29 	20日:39.10 	30日:60.62 	60日:63.74 	120日:73.63 	250日:76.66 		,当前价：28.94	,当前：2022-04-25 11:47:01
        shangZheng_50.put("601888", "中国中免");//191	旅游酒店     1.86	3519.92	2.59	价格区间: 5日:64.47 	10日:75.15 	20日:78.19 	30日:69.67 	60日:32.37 	120日:21.49 	250日:13.02 		,当前价：180.28	,当前：2022-04-25 11:47:02
        shangZheng_50.put("603259", "药明康德");//188	医疗服务     0.78	3026.46	1.53	价格区间: 5日:39.56 	10日:31.06 	20日:21.82 	30日:32.94 	60日:49.10 	120日:27.96 	250日:20.66 		,当前价：102.39	,当前：2022-04-25 11:47:05
        shangZheng_50.put("600196", "复星医药");//184	化学制药     1.94	1063.60	2.52	价格区间: 5日:10.05 	10日:6.77  	20日:3.42  	30日:9.98  	60日:18.83 	120日:18.83 	250日:7.52  		,当前价：41.5	,当前：2022-04-25 11:47:06
        shangZheng_50.put("601899", "紫金矿业");//172	贵金属       -3.62	2875.16	1.72	价格区间: 5日:9.70  	10日:7.27  	20日:7.27  	30日:43.18 	60日:43.18 	120日:43.49 	250日:44.11 		,当前价：10.92	,当前：2022-04-25 11:47:07
        shangZheng_50.put("600809", "山西汾酒");//169	酿酒行业     -0.89	3157.05	1.32	价格区间: 5日:67.76 	10日:64.89 	20日:67.88 	30日:55.03 	60日:47.21 	120日:29.39 	250日:22.91 		,当前价：258.75	,当前：2022-04-25 11:47:08
        shangZheng_50.put("603986", "兆易创新");//168	半导体       -2.54	845.68	1.6 	价格区间: 5日:15.23 	10日:22.87 	20日:11.38 	30日:9.35  	60日:9.35  	120日:6.61  	250日:10.42 		,当前价：126.7	,当前：2022-04-25 11:47:09
        shangZheng_50.put("601668", "中国建筑");//165	工程建设     -0.85	2449.35	1.6 	价格区间: 5日:23.08 	10日:17.31 	20日:60.19 	30日:72.61 	60日:72.61 	120日:75.00 	250日:76.88 		,当前价：5.84	,当前：2022-04-25 11:47:09
        shangZheng_50.put("601857", "中国石油");//164	石油行业     -2.08	9462.18	1.48	价格区间: 5日:16.67 	10日:14.29 	20日:14.29 	30日:35.71 	60日:24.59 	120日:36.11 	250日:48.65 		,当前价：5.17	,当前：2022-04-25 11:47:10
        shangZheng_50.put("600547", "山东黄金");//160	贵金属       -3.76	870.08	2.08	价格区间: 5日:1.05  	10日:0.66  	20日:0.66  	30日:21.43 	60日:21.43 	120日:21.43 	250日:35.48 		,当前价：19.45	,当前：2022-04-25 11:47:11
    }

    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(shangZheng_50);
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStYiLiao.all, date);
    }
}
