package utils;

import java.util.HashMap;
import java.util.Map;
import java.util.Set;

/**
 * ContentStockConception简介
 * 常量：股票分类，概念
 * @author Administrator
 * @date 2022-02-25 11:34
 */
public class ContentStockConception {
    /**
     * 概念：["体外诊断"];股票个数：22;
     * 002432	九安医疗	555	医疗器械	3.28	313.20	5.27	价格区间: 5日:23.00 	10日:61.83 	20日:65.91 	30日:40.88 	60日:68.49 	120日:71.98 	250日:71.98 		,当前价：65.44	,当前：2022-02-25 11:18:33
     * 605369	拱东医疗	325	医疗器械	2.83	159.87	2.43	价格区间: 5日:86.51 	10日:61.44 	20日:65.76 	30日:66.10 	60日:82.68 	120日:85.75 	250日:91.55 		,当前价：141.95	,当前：2022-02-25 11:18:34
     * 002932	明德生物	300	医疗器械	3.47	78.09	3.8 	价格区间: 5日:51.10 	10日:47.29 	20日:30.36 	30日:7.90  	60日:8.93  	120日:23.67 	250日:40.62 		,当前价：74.46	,当前：2022-02-25 11:18:36
     * 603392	万泰生物	300	医疗器械	1.27	1541.82	4.18	价格区间: 5日:94.59 	10日:98.25 	20日:98.25 	30日:98.42 	60日:97.42 	120日:91.77 	250日:71.47 		,当前价：253.99	,当前：2022-02-25 11:18:37
     */
    public static Map<String, String> mapTiWaiZhenDuan = new HashMap<>();
    static {
        mapTiWaiZhenDuan.put("002432", "九安医疗");//002432	九安医疗	555	医疗器械	3.28	313.20	5.27	价格区间: 5日:21.05 	10日:60.87 	20日:65.05 	30日:40.40 	60日:68.23 	120日:71.75 	250日:71.75 		,当前价：65.44	,当前：2022-02-25 11:40:14
        mapTiWaiZhenDuan.put("605369", "拱东医疗");//605369	拱东医疗	325	医疗器械	2.83	159.87	2.43	价格区间: 5日:85.77 	10日:60.95 	20日:65.32 	30日:65.75 	60日:82.50 	120日:85.60 	250日:91.47 		,当前价：141.95	,当前：2022-02-25 11:40:15
        mapTiWaiZhenDuan.put("002932", "明德生物");//002932	明德生物	300	医疗器械	3.47	78.09	3.8 	价格区间: 5日:45.12 	10日:41.76 	20日:26.81 	30日:6.98  	60日:8.02  	120日:22.90 	250日:40.03 		,当前价：74.46	,当前：2022-02-25 11:40:17
        mapTiWaiZhenDuan.put("603392", "万泰生物");//603392	万泰生物	300	医疗器械	1.27	1541.82	4.18	价格区间: 5日:88.85 	10日:96.39 	20日:96.39 	30日:96.75 	60日:95.76 	120日:90.64 	250日:70.80 		,当前价：253.99	,当前：2022-02-25 11:40:18

    }
}
