package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：科技
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStKeJi {

    /**
     * xinNengYuan_dianChi ["固态电池"]：11;
     */
    public static Map<String, String> xinNengYuan_guTaiDianChi = new HashMap<>();

    static {
        xinNengYuan_guTaiDianChi.put("601127", "小康股份");//388	汽车整车     -3.6	542.75	2.92	价格区间: 5日:11.46 	10日:5.84  	20日:8.64  	30日:26.95 	60日:12.29 	120日:5.93  	250日:28.77 		,当前价：39.91	,当前：2022-04-15 13:31:26
        xinNengYuan_guTaiDianChi.put("002466", "天齐锂业");//342	能源金属     -3.76	1056.27	2.66	价格区间: 5日:50.74 	10日:22.49 	20日:18.33 	30日:13.36 	60日:11.17 	120日:6.69  	250日:36.09 		,当前价：71.51	,当前：2022-04-15 13:31:27
        xinNengYuan_guTaiDianChi.put("600884", "杉杉股份");//296	电子元件     -6.12	499.73	2.84	价格区间: 5日:19.72 	10日:9.66  	20日:9.50  	30日:9.50  	60日:8.19  	120日:2.70  	250日:35.14 		,当前价：23.32	,当前：2022-04-15 13:31:28
        xinNengYuan_guTaiDianChi.put("002709", "天赐材料");//290	化学制品     -4.22	777.26	5.12	价格区间: 5日:16.45 	10日:7.71  	20日:4.98  	30日:4.98  	60日:4.98  	120日:1.57  	250日:27.56 		,当前价：80.75	,当前：2022-04-15 13:31:30
        xinNengYuan_guTaiDianChi.put("000009", "中国宝安");//285	综合行业     -2.99	251.47	2.48	价格区间: 5日:32.05 	10日:11.68 	20日:9.36  	30日:5.81  	60日:4.72  	120日:2.01  	250日:3.60  		,当前价：9.75	,当前：2022-04-15 13:31:31
        xinNengYuan_guTaiDianChi.put("002594", "比亚迪  ");//274	汽车整车     -2.83	6825.76	2.89	价格区间: 5日:46.48 	10日:50.75 	20日:50.31 	30日:65.60 	60日:45.81 	120日:22.01 	250日:49.81 		,当前价：234.47	,当前：2022-04-15 13:31:32
        xinNengYuan_guTaiDianChi.put("002244", "滨江集团");//267	房地产开发   0.27	233.36	2.22	价格区间: 5日:76.52 	10日:72.13 	20日:79.76 	30日:85.36 	60日:86.43 	120日:91.21 	250日:91.42 		,当前价：7.5	,当前：2022-04-15 13:31:33
        xinNengYuan_guTaiDianChi.put("002460", "赣锋锂业");//265	能源金属     -3.23	1630.24	1.92	价格区间: 5日:32.96 	10日:16.54 	20日:14.86 	30日:9.10  	60日:7.86  	120日:4.77  	250日:20.74 		,当前价：113.41	,当前：2022-04-15 13:31:34
    }

    /**
     * xinNengYuan_daoPianDianChi ["刀片电池"]：4;
     */
    public static Map<String, String> xinNengYuan_daoPianDianChi = new HashMap<>();

    static {
        xinNengYuan_daoPianDianChi.put("002466", "天齐锂业");//337	能源金属     -1.23	1063.95	1.45	价格区间: 5日:58.12 	10日:28.89 	20日:23.04 	30日:15.47 	60日:12.94 	120日:7.75  	250日:36.62 		,当前价：72.03	,当前：2022-04-18 10:54:58
        xinNengYuan_daoPianDianChi.put("002824", "和胜股份");//315	有色金属     1.36	52.19	3.6 	价格区间: 5日:34.32 	10日:18.97 	20日:13.14 	30日:10.78 	60日:6.92  	120日:6.29  	250日:33.78 		,当前价：28.25	,当前：2022-04-18 10:54:59
        xinNengYuan_daoPianDianChi.put("603032", "*ST德新 ");//308	铁路公路     1.97	96.24	5.29	价格区间: 5日:85.71 	10日:54.30 	20日:32.37 	30日:32.37 	60日:26.09 	120日:38.83 	250日:57.62 		,当前价：57.51	,当前：2022-04-18 10:55:01
        xinNengYuan_daoPianDianChi.put("002594", "比亚迪  ");//264	汽车整车     -1.35	6783.25	1.01	价格区间: 5日:55.37 	10日:58.79 	20日:55.87 	30日:69.45 	60日:48.50 	120日:23.30 	250日:50.64 		,当前价：233.01	,当前：2022-04-18 10:55:02
    }



    /**
     * dianLi_chouShuiXuNeng ["抽水蓄能"]：19;
     */
    public static Map<String, String> dianLi_chouShuiXuNeng = new HashMap<>();

    static {
        dianLi_chouShuiXuNeng.put("002060", "粤水电  ");//344	工程建设     -3.59	83.92	1.52	价格区间: 5日:66.34 	10日:19.59 	20日:42.47 	30日:45.11 	60日:51.15 	120日:51.75 	250日:60.88 		,当前价：6.98	,当前：2022-04-18 14:39:37
        dianLi_chouShuiXuNeng.put("600032", "浙江新能");//326	电力行业     -1.6	256.26	0.88	价格区间: 5日:66.67 	10日:19.41 	20日:11.70 	30日:21.32 	60日:21.32 	120日:13.84 	250日:52.68 		,当前价：12.32	,当前：2022-04-18 14:39:38
        dianLi_chouShuiXuNeng.put("000400", "许继电气");//322	电网设备     6.19	173.03	0.98	价格区间: 5日:84.85 	10日:42.55 	20日:30.63 	30日:24.91 	60日:10.98 	120日:8.01  	250日:22.70 		,当前价：17.16	,当前：2022-04-18 14:39:39
        dianLi_chouShuiXuNeng.put("601669", "中国电建");//298	工程建设     -2.84	1150.49	0.44	价格区间: 5日:5.26  	10日:33.33 	20日:47.50 	30日:50.59 	60日:27.22 	120日:39.79 	250日:60.99 		,当前价：7.52	,当前：2022-04-18 14:39:40
        dianLi_chouShuiXuNeng.put("000875", "吉电股份");//292	电力行业     -1.74	189.18	1.24	价格区间: 5日:73.61 	10日:23.56 	20日:15.77 	30日:15.77 	60日:15.77 	120日:18.45 	250日:41.12 		,当前价：6.78	,当前：2022-04-18 14:39:41
    }

    /**
     * shuZiHuoBi 概念：["数字货币"];股票个数：24;
     */
    public static Map<String, String> shuZi_shuZiHuoBi = new HashMap<>();

    static {
        shuZi_shuZiHuoBi.put("603123", "翠微股份");//454	商业百货     -1.48	138.10	0.99	价格区间: 5日:12.45 	10日:23.83 	20日:30.48 	30日:30.48 	60日:33.40 	120日:46.17 	250日:46.17 		,当前价：17.29	,当前：2022-04-12 10:50:27
        shuZi_shuZiHuoBi.put("003040", "楚天龙  ");//432	通信设备     -1.58	108.97	2.06	价格区间: 5日:50.44 	10日:74.61 	20日:74.61 	30日:74.61 	60日:39.94 	120日:39.94 	250日:35.21 		,当前价：23.63	,当前：2022-04-12 10:50:29
        shuZi_shuZiHuoBi.put("002537", "海联金汇");//428	汽车零部件   -1.04	122.33	1.11	价格区间: 5日:15.96 	10日:10.24 	20日:33.71 	30日:42.66 	60日:54.08 	120日:64.18 	250日:64.66 		,当前价：10.42	,当前：2022-04-12 10:50:30
        shuZi_shuZiHuoBi.put("002268", "卫士通  ");//337	软件开发     0.91	355.44	1.4 	价格区间: 5日:4.89  	10日:6.62  	20日:16.03 	30日:23.50 	60日:28.89 	120日:15.81 	250日:51.67 		,当前价：42.0	,当前：2022-04-12 10:50:31
        shuZi_shuZiHuoBi.put("000948", "南天信息");//302	软件开发     2.14	64.05	3.23	价格区间: 5日:75.00 	10日:80.85 	20日:80.85 	30日:80.85 	60日:50.67 	120日:56.73 	250日:68.08 		,当前价：16.24	,当前：2022-04-12 10:50:32
        shuZi_shuZiHuoBi.put("002987", "京北方  ");//296	软件开发     -0.56	71.73	0.82	价格区间: 5日:10.07 	10日:10.07 	20日:10.07 	30日:10.07 	60日:5.63  	120日:28.80 	250日:33.68 		,当前价：31.89	,当前：2022-04-12 10:50:33
        shuZi_shuZiHuoBi.put("002197", "证通电子");//289	计算机设备   -3.1	67.27	1.71	价格区间: 5日:14.35 	10日:22.81 	20日:19.42 	30日:14.53 	60日:30.38 	120日:41.38 	250日:41.43 		,当前价：10.95	,当前：2022-04-12 10:50:34
        shuZi_shuZiHuoBi.put("000676", "智度股份");//284	文化传媒     0.49	79.27	1.5 	价格区间: 5日:5.17  	10日:5.17  	20日:5.17  	30日:3.87  	60日:1.94  	120日:13.88 	250日:25.67 		,当前价：6.21	,当前：2022-04-12 10:50:35
        shuZi_shuZiHuoBi.put("002104", "恒宝股份");//276	通信设备     -1.16	77.36	0.8 	价格区间: 5日:8.94  	10日:7.84  	20日:7.84  	30日:25.40 	60日:39.49 	120日:44.75 	250日:47.06 		,当前价：11.1	,当前：2022-04-12 10:50:36
        shuZi_shuZiHuoBi.put("002049", "紫光国微");//260	半导体       3.95	1096.96	3.56	价格区间: 5日:17.38 	10日:14.92 	20日:12.46 	30日:10.32 	60日:8.38  	120日:8.35  	250日:53.05 		,当前价：180.76	,当前：2022-04-12 10:50:37
        shuZi_shuZiHuoBi.put("002123", "梦网科技");//244	通信服务     -6.02	96.50	4.57	价格区间: 5日:65.60 	10日:65.60 	20日:52.90 	30日:37.44 	60日:24.08 	120日:14.13 	250日:11.36 		,当前价：12.03	,当前：2022-04-12 10:50:38
        shuZi_shuZiHuoBi.put("002649", "博彦科技");//235	互联网服务   0.69	69.05	0.98	价格区间: 5日:9.45  	10日:9.45  	20日:9.45  	30日:8.09  	60日:5.11  	120日:15.95 	250日:40.87 		,当前价：11.67	,当前：2022-04-12 10:50:39
    }

    /**
     * shuZi_shuJuAnQuan
     */
    public static Map<String, String> shuZi_shuJuAnQuan = new HashMap<>();

    static {
        shuZi_shuJuAnQuan.put("002268", "卫士通  ");//343	软件开发     5.95	354.34	2.54	价格区间: 5日:73.90 	10日:37.66 	20日:33.08 	30日:33.08 	60日:32.14 	120日:17.59 	250日:52.69 		,当前价：41.87	,当前：2022-04-18 14:14:51
        shuZi_shuJuAnQuan.put("002104", "恒宝股份");//258	通信设备     -0.62	67.25	1.3 	价格区间: 5日:12.39 	10日:5.44  	20日:5.44  	30日:5.44  	60日:26.06 	120日:33.60 	250日:36.38 		,当前价：9.65	,当前：2022-04-18 14:14:52
        shuZi_shuJuAnQuan.put("603636", "南威软件");//254	互联网服务   6.27	73.14	1.81	价格区间: 5日:71.53 	10日:29.34 	20日:10.96 	30日:24.93 	60日:29.37 	120日:35.42 	250日:35.42 		,当前价：12.38	,当前：2022-04-18 14:14:53
    }

    /**
     * shuZi_dianZiShenFenZheng ["电子身份证"]：6;
     */
    public static Map<String, String> shuZi_dianZiShenFenZheng = new HashMap<>();

    static {
        shuZi_dianZiShenFenZheng.put("603636", "南威软件");//254	互联网服务   6.27	73.14	1.81	价格区间: 5日:70.83 	10日:29.06 	20日:10.96 	30日:24.93 	60日:29.37 	120日:35.42 	250日:35.42 		,当前价：12.38	,当前：2022-04-18 14:13:13
        shuZi_dianZiShenFenZheng.put("002232", "启明信息");//254	互联网服务   -4.72	55.19	4.7 	价格区间: 5日:15.30 	10日:12.22 	20日:12.19 	30日:10.95 	60日:6.65  	120日:17.41 	250日:17.41 		,当前价：13.51	,当前：2022-04-18 14:13:15
        shuZi_dianZiShenFenZheng.put("000997", "新大陆  ");//192	互联网服务   0.78	146.66	1.71	价格区间: 5日:38.57 	10日:17.14 	20日:12.36 	30日:10.13 	60日:9.71  	120日:9.71  	250日:17.57 		,当前价：14.21	,当前：2022-04-18 14:13:16
        shuZi_dianZiShenFenZheng.put("002152", "广电运通");//165	计算机设备   -1.87	234.43	1.29	价格区间: 5日:14.85 	10日:9.04  	20日:9.04  	30日:6.20  	60日:3.49  	120日:3.49  	250日:3.30  		,当前价：9.44	,当前：2022-04-18 14:13:17
    }

    /**
     * shuZi_huaWeiShengTeng ["华为昇腾"]：4;
     */
    public static Map<String, String> shuZi_huaWeiShengTeng = new HashMap<>();

    static {
        shuZi_huaWeiShengTeng.put("000158", "常山北明");//247	综合行业     0.16	98.00	1.23	价格区间: 5日:9.64  	10日:6.84  	20日:6.84  	30日:6.40  	60日:4.59  	120日:4.59  	250日:15.18 		,当前价：6.13	,当前：2022-04-12 11:16:50
        shuZi_huaWeiShengTeng.put("002261", "拓维信息");//245	教育         1.14	77.50	1.41	价格区间: 5日:12.05 	10日:6.90  	20日:6.90  	30日:5.08  	60日:2.90  	120日:2.47  	250日:2.09  		,当前价：6.21	,当前：2022-04-12 11:16:52
        shuZi_huaWeiShengTeng.put("002152", "广电运通");//181	计算机设备   1.89	254.55	0.86	价格区间: 5日:25.51 	10日:28.43 	20日:25.22 	30日:12.55 	60日:7.92  	120日:11.35 	250日:12.38 		,当前价：10.25	,当前：2022-04-12 11:16:53
    }

    /**
     * yanHuTiLi ["盐湖提锂"]：19;
     */
    public static Map<String, String> yanHuTiLi = new HashMap<>();

    static {
        yanHuTiLi.put("000762", "西藏矿业");//377	采掘行业     0.57	193.28	2.02	价格区间: 5日:57.20 	10日:39.84 	20日:29.90 	30日:17.98 	60日:13.19 	120日:9.75  	250日:32.70 		,当前价：37.11	,当前：2022-04-13 11:21:50
        yanHuTiLi.put("600338", "西藏珠峰");//371	有色金属     -0.21	219.04	2.13	价格区间: 5日:43.18 	10日:26.13 	20日:17.97 	30日:11.94 	60日:10.16 	120日:7.79  	250日:35.28 		,当前价：23.96	,当前：2022-04-13 11:21:51
        yanHuTiLi.put("000546", "金圆股份");//368	水泥建材     -7.34	101.50	2.96	价格区间: 5日:28.23 	10日:28.23 	20日:28.23 	30日:17.41 	60日:22.67 	120日:47.19 	250日:61.06 		,当前价：13.0	,当前：2022-04-13 11:21:53
        yanHuTiLi.put("002466", "天齐锂业");//347	能源金属     1.82	1083.45	3.11	价格区间: 5日:49.31 	10日:40.83 	20日:33.28 	30日:21.91 	60日:20.29 	120日:12.15 	250日:38.85 		,当前价：73.35	,当前：2022-04-13 11:21:54
        yanHuTiLi.put("600499", "科达制造");//344	专用设备     -0.63	299.31	1.68	价格区间: 5日:24.92 	10日:17.55 	20日:14.49 	30日:10.85 	60日:10.31 	120日:7.33  	250日:41.89 		,当前价：15.85	,当前：2022-04-13 11:21:55
        yanHuTiLi.put("002240", "盛新锂能");//340	能源金属     0.22	389.15	1.77	价格区间: 5日:35.92 	10日:22.15 	20日:17.31 	30日:17.31 	60日:21.08 	120日:13.72 	250日:46.77 		,当前价：44.97	,当前：2022-04-13 11:21:56
        yanHuTiLi.put("600773", "西藏城投");//338	房地产开发   -0.95	136.64	2.09	价格区间: 5日:22.69 	10日:14.57 	20日:10.65 	30日:7.33  	60日:4.58  	120日:4.11  	250日:27.61 		,当前价：16.67	,当前：2022-04-13 11:21:57
        yanHuTiLi.put("000408", "藏格矿业");//331	化肥行业     -0.55	456.90	1.67	价格区间: 5日:30.64 	10日:25.70 	20日:18.68 	30日:10.77 	60日:10.77 	120日:27.27 	250日:62.45 		,当前价：28.91	,当前：2022-04-13 11:21:58
        yanHuTiLi.put("002256", "兆新股份");//328	电网设备     3.26	53.65	4.93	价格区间: 5日:33.87 	10日:26.58 	20日:22.92 	30日:15.38 	60日:9.02  	120日:7.80  	250日:27.06 		,当前价：2.85	,当前：2022-04-13 11:21:59
        yanHuTiLi.put("603799", "华友钴业");//322	能源金属     0.67	1022.43	3.79	价格区间: 5日:24.79 	10日:19.16 	20日:14.97 	30日:8.93  	60日:8.51  	120日:6.12  	250日:22.31 		,当前价：83.71	,当前：2022-04-13 11:22:00
    }

    /**
     * shuZi_dongShuXiSuan ["东数西算"]：21;
     */
    public static Map<String, String> shuZi_dongShuXiSuan = new HashMap<>();

    static {
        shuZi_dongShuXiSuan.put("600996", "贵广网络");//417	文化传媒     6.29	102.54	1.46	价格区间: 5日:66.87 	10日:73.13 	20日:76.82 	30日:77.96 	60日:63.34 	120日:72.25 	250日:72.39 		,当前价：9.63	,当前：2022-04-18 14:17:38
        shuZi_dongShuXiSuan.put("002837", "英维克  ");//356	专用设备     2.02	96.18	0.67	价格区间: 5日:40.53 	10日:22.09 	20日:13.73 	30日:13.73 	60日:12.75 	120日:8.35  	250日:34.61 		,当前价：28.77	,当前：2022-04-18 14:17:39
        shuZi_dongShuXiSuan.put("002354", "天娱数科");//348	游戏         0.42	78.63	0.73	价格区间: 5日:16.46 	10日:10.83 	20日:15.67 	30日:20.42 	60日:25.00 	120日:45.31 	250日:45.31 		,当前价：4.73	,当前：2022-04-18 14:17:41
        shuZi_dongShuXiSuan.put("600510", "黑牡丹  ");//344	房地产开发   -2.68	106.49	1.74	价格区间: 5日:28.97 	10日:16.23 	20日:6.89  	30日:4.19  	60日:32.12 	120日:32.12 	250日:37.07 		,当前价：10.17	,当前：2022-04-18 14:17:42
        shuZi_dongShuXiSuan.put("002335", "科华数据");//300	电源设备     1.6 	102.56	1.1 	价格区间: 5日:53.90 	10日:19.04 	20日:9.58  	30日:7.53  	60日:5.64  	120日:3.07  	250日:21.35 		,当前价：22.22	,当前：2022-04-18 14:17:43
        shuZi_dongShuXiSuan.put("000815", "美利云  ");//297	造纸印刷     -3.98	85.59	7.1 	价格区间: 5日:45.95 	10日:21.45 	20日:9.07  	30日:7.17  	60日:41.34 	120日:44.21 	250日:46.25 		,当前价：12.31	,当前：2022-04-18 14:17:44
    }

    /**
     * shuZi_guoZiYun ["国资云概念"]：9;
     */
    public static Map<String, String> shuZi_guoZiYun = new HashMap<>();

    static {
        shuZi_guoZiYun.put("000815", "美利云  ");//286	造纸印刷	-1.54	93.65	2.2 	价格区间: 5日:22.18 	10日:10.24 	20日:6.98  	30日:40.31 	60日:51.20 	120日:53.58 	250日:55.28 		,当前价：13.47	,当前：2022-04-06 11:10:38
        shuZi_guoZiYun.put("600602", "云赛智联");//283	软件开发	-0.37	111.19	1.19	价格区间: 5日:26.47 	10日:7.00  	20日:22.15 	30日:26.91 	60日:45.31 	120日:53.95 	250日:56.70 		,当前价：8.13	,当前：2022-04-06 11:10:39
        shuZi_guoZiYun.put("603881", "数据港  ");//260	互联网服务	0.45	116.87	1.49	价格区间: 5日:59.16 	10日:18.86 	20日:12.57 	30日:10.20 	60日:18.51 	120日:34.54 	250日:43.05 		,当前价：35.53	,当前：2022-04-06 11:10:41
        shuZi_guoZiYun.put("000158", "常山北明");//256	综合行业	0.15	108.07	2.12	价格区间: 5日:35.29 	10日:56.00 	20日:61.40 	30日:39.55 	60日:37.76 	120日:37.76 	250日:22.89 		,当前价：6.76	,当前：2022-04-06 11:10:42
        shuZi_guoZiYun.put("002152", "广电运通");//181	计算机设备	3.25	267.96	5.92	价格区间: 5日:91.40 	10日:91.84 	20日:62.50 	30日:29.90 	60日:24.59 	120日:27.18 	250日:26.94 		,当前价：10.79	,当前：2022-04-06 11:10:46
    }

    /**
     * teGaoYa ["特高压"]：33;
     */
    public static Map<String, String> teGaoYa = new HashMap<>();

    static {
        teGaoYa.put("002459", "晶澳科技");//386	光伏设备	3.29	1382.31	3.8 	价格区间: 5日:47.44 	10日:30.52 	20日:24.13 	30日:58.95 	60日:58.33 	120日:66.02 	250日:79.65 		,当前价：86.39	,当前：2022-03-23 10:33:37
        teGaoYa.put("600522", "中天科技");//350	通信设备	2.89	632.08	4.33	价格区间: 5日:38.46 	10日:54.72 	20日:45.74 	30日:59.27 	60日:68.74 	120日:82.58 	250日:84.45 		,当前价：18.52	,当前：2022-03-23 10:33:39
        teGaoYa.put("601126", "四方股份");//347	电网设备	5.26	115.47	8.83	价格区间: 5日:65.69 	10日:61.97 	20日:30.53 	30日:30.53 	60日:11.82 	120日:10.03 	250日:38.58 		,当前价：14.2	,当前：2022-03-23 10:33:41
        teGaoYa.put("601677", "明泰铝业");//331	有色金属	2.97	284.36	0.66	价格区间: 5日:87.17 	10日:91.08 	20日:57.57 	30日:57.57 	60日:57.57 	120日:67.35 	250日:79.80 		,当前价：41.66	,当前：2022-03-23 10:33:43
        teGaoYa.put("000400", "许继电气");//317	电网设备	4.74	195.92	5.7 	价格区间: 5日:76.96 	10日:84.03 	20日:46.88 	30日:38.12 	60日:18.68 	120日:18.24 	250日:35.55 		,当前价：19.43	,当前：2022-03-23 10:33:46
        teGaoYa.put("002545", "东方铁塔");//285	钢铁行业	-0.09	142.57	3.99	价格区间: 5日:73.38 	10日:68.61 	20日:53.68 	30日:63.54 	60日:70.07 	120日:73.96 	250日:78.68 		,当前价：11.46	,当前：2022-03-23 10:33:48
        teGaoYa.put("601669", "中国电建");//275	工程建设	0.96	1126.01	2.5 	价格区间: 5日:71.11 	10日:45.75 	20日:42.68 	30日:22.15 	60日:22.15 	120日:34.26 	250日:58.44 		,当前价：7.36	,当前：2022-03-23 10:33:49
    }





    /**
     * shuZi_esim ["eSIM"]：5;
     */
    public static Map<String, String> shuZi_esim = new HashMap<>();

    static {
        shuZi_esim.put("002104", "恒宝股份");//276	通信设备     -1.87	76.80	0.8 	价格区间: 5日:5.96  	10日:5.32  	20日:5.32  	30日:23.36 	60日:38.71 	120日:44.03 	250日:46.38 		,当前价：11.02	,当前：2022-04-12 11:12:07
        shuZi_esim.put("002881", "美格智能");//276	消费电子     -1.47	55.72	1.58	价格区间: 5日:3.36  	10日:2.05  	20日:1.61  	30日:1.04  	60日:0.93  	120日:0.98  	250日:33.94 		,当前价：30.17	,当前：2022-04-12 11:12:08
        shuZi_esim.put("002049", "紫光国微");//254	半导体       2.97	1086.64	3.56	价格区间: 5日:16.11 	10日:13.83 	20日:11.55 	30日:9.56  	60日:7.76  	120日:7.74  	250日:52.79 		,当前价：179.06	,当前：2022-04-12 11:12:09
    }

    /**
     * shuZi_shuZiJingJi ["数字经济"]：19;
     */
    public static Map<String, String> shuZi_shuZiJingJi = new HashMap<>();

    static {
        shuZi_shuZiJingJi.put("603466", "风语筑  ");//347	文化传媒     -1.71	87.30	1.5 	价格区间: 5日:0.69  	10日:0.69  	20日:17.65 	30日:17.65 	60日:5.99  	120日:26.71 	250日:33.91 		,当前价：20.69	,当前：2022-04-12 11:20:58
        shuZi_shuZiJingJi.put("002354", "天娱数科");//343	游戏         0.8 	83.61	2.55	价格区间: 5日:13.70 	10日:11.11 	20日:43.66 	30日:42.96 	60日:37.33 	120日:52.46 	250日:52.46 		,当前价：5.03	,当前：2022-04-12 11:20:59
        shuZi_shuZiJingJi.put("002268", "卫士通  ");//337	软件开发     -0.67	349.86	1.4 	价格区间: 5日:4.07  	10日:5.88  	20日:15.48 	30日:23.00 	60日:28.56 	120日:15.63 	250日:51.56 		,当前价：41.34	,当前：2022-04-12 11:21:01
        shuZi_shuZiJingJi.put("002987", "京北方  ");//296	软件开发     0.44	72.45	0.82	价格区间: 5日:7.50  	10日:7.50  	20日:7.50  	30日:7.50  	60日:4.19  	120日:27.72 	250日:32.67 		,当前价：32.21	,当前：2022-04-12 11:21:02
        shuZi_shuZiJingJi.put("603636", "南威软件");//275	互联网服务   -1.5	69.77	1.13	价格区间: 5日:1.72  	10日:1.04  	20日:0.44  	30日:19.46 	60日:25.04 	120日:30.71 	250日:30.71 		,当前价：11.81	,当前：2022-04-12 11:21:03
    }

    /**
     * shuZi_etc ["ETC"]：13;
     */
    public static Map<String, String> shuZi_etc = new HashMap<>();

    static {
        shuZi_etc.put("003040", "楚天龙  ");//419	通信设备     3.05	121.65	6.5 	价格区间: 5日:60.37 	10日:63.18 	20日:78.92 	30日:78.92 	60日:48.20 	120日:48.20 	250日:28.42 		,当前价：26.38	,当前：2022-04-18 14:30:15
        shuZi_etc.put("002941", "新疆交建");//330	工程建设     -2.85	107.92	2.55	价格区间: 5日:11.14 	10日:38.99 	20日:41.84 	30日:47.15 	60日:58.32 	120日:61.59 	250日:64.23 		,当前价：16.73	,当前：2022-04-18 14:30:17
        shuZi_etc.put("002484", "江海股份");//326	电子元件     6.8 	155.21	0.48	价格区间: 5日:95.59 	10日:48.15 	20日:29.12 	30日:28.89 	60日:24.23 	120日:20.05 	250日:38.96 		,当前价：18.69	,当前：2022-04-18 14:30:19
        shuZi_etc.put("000948", "南天信息");//271	软件开发     -0.64	55.25	1.52	价格区间: 5日:14.37 	10日:13.59 	20日:15.43 	30日:15.43 	60日:14.01 	120日:24.58 	250日:41.12 		,当前价：14.01	,当前：2022-04-18 14:30:20
        shuZi_etc.put("002104", "恒宝股份");//258	通信设备     -0.62	67.25	1.3 	价格区间: 5日:11.93 	10日:5.24  	20日:5.24  	30日:5.24  	60日:25.98 	120日:33.52 	250日:36.31 		,当前价：9.65	,当前：2022-04-18 14:30:20
        shuZi_etc.put("002049", "紫光国微");//254	半导体       4.03	1097.87	0.21	价格区间: 5日:78.89 	10日:35.41 	20日:30.65 	30日:26.45 	60日:21.55 	120日:21.48 	250日:54.60 		,当前价：180.91	,当前：2022-04-18 14:30:22
        shuZi_etc.put("000997", "新大陆  ");//192	互联网服务   0.78	146.66	1.71	价格区间: 5日:37.14 	10日:16.51 	20日:11.90 	30日:9.76  	60日:9.35  	120日:9.35  	250日:17.24 		,当前价：14.21	,当前：2022-04-18 14:30:23
    }

    /**
     * shuZi_zhiHuiZhengWu ["智慧政务"]：12;
     */
    public static Map<String, String> shuZi_zhiHuiZhengWu = new HashMap<>();

    static {
        shuZi_zhiHuiZhengWu.put("003040", "楚天龙  ");//419	通信设备     3.05	121.65	6.5 	价格区间: 5日:59.81 	10日:62.84 	20日:78.73 	30日:78.73 	60日:48.08 	120日:48.08 	250日:28.27 		,当前价：26.38	,当前：2022-04-18 14:26:37
        shuZi_zhiHuiZhengWu.put("002268", "卫士通  ");//343	软件开发     5.95	354.34	2.54	价格区间: 5日:72.86 	10日:37.13 	20日:32.62 	30日:32.62 	60日:31.81 	120日:17.40 	250日:52.58 		,当前价：41.87	,当前：2022-04-18 14:26:39
        shuZi_zhiHuiZhengWu.put("000948", "南天信息");//271	软件开发     -0.64	55.25	1.52	价格区间: 5日:14.67 	10日:13.32 	20日:15.16 	30日:15.16 	60日:13.86 	120日:24.31 	250日:40.92 		,当前价：14.01	,当前：2022-04-18 14:26:40
        shuZi_zhiHuiZhengWu.put("600602", "云赛智联");//258	软件开发     0.14	94.92	1.3 	价格区间: 5日:8.51  	10日:4.82  	20日:2.14  	30日:2.14  	60日:16.25 	120日:29.48 	250日:33.70 		,当前价：6.94	,当前：2022-04-18 14:26:41
        shuZi_zhiHuiZhengWu.put("603636", "南威软件");//254	互联网服务   6.27	73.14	1.81	价格区间: 5日:71.53 	10日:29.34 	20日:10.96 	30日:24.93 	60日:29.37 	120日:35.42 	250日:35.42 		,当前价：12.38	,当前：2022-04-18 14:26:43
    }

    /**
     * shuZi_dianZiChePai ["电子车牌"]：3;
     */
    public static Map<String, String> shuZi_dianZiChePai = new HashMap<>();

    static {
        shuZi_dianZiChePai.put("603636", "南威软件");//254	互联网服务   6.27	73.14	1.81	价格区间: 5日:70.83 	10日:29.06 	20日:10.85 	30日:24.84 	60日:29.28 	120日:35.34 	250日:35.34 		,当前价：12.38	,当前：2022-04-18 14:29:06
    }

    /**
     * shuZiJingJi 数字经济：数字货币,电子身份证,数据安全,东数西算,国资云概念
     */
    public static Map<String, String> shuZi = new HashMap<>();

    static {
        shuZi.putAll(shuZi_dianZiShenFenZheng);//电子身份证
        shuZi.putAll(shuZi_shuJuAnQuan);//数据安全
        shuZi.putAll(shuZi_zhiHuiZhengWu);//智慧政务
        shuZi.putAll(shuZi_dianZiChePai);//电子车牌
        shuZi.putAll(shuZi_esim);//eSIM
        shuZi.putAll(shuZi_shuZiHuoBi);//数字货币
        shuZi.putAll(shuZi_huaWeiShengTeng);//华为昇腾
        shuZi.putAll(shuZi_shuZiJingJi);//数字经济
        shuZi.putAll(shuZi_dongShuXiSuan);//东数西算
        shuZi.putAll(shuZi_guoZiYun);//国资云概念
        shuZi.putAll(shuZi_etc);//ETC
    }

    /**
     * ["绿色电力"]：67;
     */
    public static Map<String, String> dianLi_lvSeDianLi = new HashMap<>();

    static {
        dianLi_lvSeDianLi.put("002053", "云南能投");//401	化学原料	9.99	135.68	7.01	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：17.83	,当前：2022-03-18 10:41:56
        dianLi_lvSeDianLi.put("600821", "金开新能");//397	电力行业	1.01	122.60	1.14	价格区间: 5日:39.85 	10日:28.96 	20日:28.65 	30日:25.73 	60日:9.76  	120日:23.01 	250日:41.02 		,当前价：7.98	,当前：2022-03-18 10:41:57
        dianLi_lvSeDianLi.put("600021", "上海电力");//357	电力行业	2.8 	278.20	1.83	价格区间: 5日:54.27 	10日:33.58 	20日:33.58 	30日:22.14 	60日:12.66 	120日:25.18 	250日:38.75 		,当前价：10.63	,当前：2022-03-18 10:41:59
        dianLi_lvSeDianLi.put("002256", "兆新股份");//356	电网设备	1.43	66.64	1.78	价格区间: 5日:65.00 	10日:49.06 	20日:32.91 	30日:32.91 	60日:14.73 	120日:13.52 	250日:41.65 		,当前价：3.54	,当前：2022-03-18 10:42:00
    }

    /**
     * dianLi_xuNiDianChang ["虚拟电厂"]：3;
     */
    public static Map<String, String> dianLi_xuNiDianChang = new HashMap<>();

    static {
        dianLi_xuNiDianChang.put("601222", "林洋能源");//256	仪器仪表     1.77	154.10	0.73	价格区间: 5日:41.54 	10日:17.53 	20日:13.50 	30日:8.82  	60日:7.34  	120日:3.87  	250日:15.08 		,当前价：7.48	,当前：2022-04-18 10:59:47
        dianLi_xuNiDianChang.put("600131", "国网信通");//229	互联网服务   0.68	160.06	0.24	价格区间: 5日:41.57 	10日:16.02 	20日:9.51  	30日:6.75  	60日:3.60  	120日:3.14  	250日:13.42 		,当前价：13.39	,当前：2022-04-18 10:59:48
    }

    /**
     * dianLi_faDianJi ["发电机概念"]：6;
     */
    public static Map<String, String> dianLi_faDianJi = new HashMap<>();

    static {
        dianLi_faDianJi.put("603766", "隆鑫通用");//199	交运设备     5.35	88.92	0.9 	价格区间: 5日:91.84 	10日:91.84 	20日:91.84 	30日:61.73 	60日:33.33 	120日:20.41 	250日:39.63 		,当前价：4.33	,当前：2022-04-18 11:37:45
        dianLi_faDianJi.put("600841", "动力新科");//198	汽车零部件   1.65	150.92	2.47	价格区间: 5日:36.07 	10日:12.79 	20日:9.17  	30日:9.17  	60日:8.12  	120日:4.08  	250日:13.11 		,当前价：9.25	,当前：2022-04-18 11:37:47
        dianLi_faDianJi.put("600590", "泰豪科技");//183	电网设备     0.17	50.58	1.05	价格区间: 5日:22.64 	10日:11.65 	20日:11.65 	30日:9.79  	60日:5.62  	120日:4.18  	250日:13.94 		,当前价：5.93	,当前：2022-04-18 11:37:48
        dianLi_faDianJi.put("000816", "智慧农业");//178	通用设备     0.54	52.87	1.22	价格区间: 5日:20.59 	10日:10.29 	20日:17.57 	30日:32.22 	60日:22.60 	120日:36.52 	250日:49.55 		,当前价：3.69	,当前：2022-04-18 11:37:50
    }
    /**
     * dianLi 电力：抽水蓄能
     */
    public static Map<String, String> dianLi = new HashMap<>();

    static {
        dianLi.putAll(dianLi_faDianJi);//发电机概念
        dianLi.putAll(dianLi_xuNiDianChang);//虚拟电厂
        dianLi.putAll(dianLi_lvSeDianLi);//绿色电力
        dianLi.putAll(dianLi_chouShuiXuNeng);//抽水蓄能
    }

    /**
     * yuanYuZhou["元宇宙概念"]：31;
     */
    public static Map<String, String> chuanMei_yuanYuZhou = new HashMap<>();

    static {
        chuanMei_yuanYuZhou.put("000665", "湖北广电");//395	文化传媒	10.05	88.86	25.36	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:86.42 	60日:42.63 	120日:56.87 	250日:56.87 		,当前价：8.76	,当前：2022-03-28 13:15:47
        chuanMei_yuanYuZhou.put("002354", "天娱数科");//375	游戏    	4.98	87.60	29.28	价格区间: 5日:71.72 	10日:73.83 	20日:59.85 	30日:65.13 	60日:33.67 	120日:56.47 	250日:57.79 		,当前价：5.27	,当前：2022-03-28 13:15:49
        chuanMei_yuanYuZhou.put("000810", "创维数字");//370	家电行业	-2.01	155.24	4.02	价格区间: 5日:51.85 	10日:77.06 	20日:77.65 	30日:82.43 	60日:81.31 	120日:86.55 	250日:86.55 		,当前价：14.6	,当前：2022-03-28 13:15:50
        chuanMei_yuanYuZhou.put("603466", "风语筑  ");//365	文化传媒	3.6 	97.26	8.43	价格区间: 5日:67.21 	10日:78.87 	20日:72.78 	30日:70.34 	60日:24.28 	120日:41.90 	250日:46.76 		,当前价：23.05	,当前：2022-03-28 13:15:51
        chuanMei_yuanYuZhou.put("002036", "联创电子");//318	光学光电子	-3.63	163.57	6.41	价格区间: 5日:5.08  	10日:35.88 	20日:20.17 	30日:18.18 	60日:8.97  	120日:8.26  	250日:35.44 		,当前价：15.39	,当前：2022-03-28 13:15:52
    }
    /**
     * guangDian ["广电"]：13;
     */
    public static Map<String, String> chuanMei_guangDian = new HashMap<>();

    static {
        chuanMei_guangDian.put("600996", "贵广网络");//417	文化传媒     6.29	102.54	1.46	价格区间: 5日:69.33 	10日:75.12 	20日:78.54 	30日:79.59 	60日:64.07 	120日:72.80 	250日:72.94 		,当前价：9.63	,当前：2022-04-18 14:06:07
        chuanMei_guangDian.put("000665", "湖北广电");//342	文化传媒     0.88	90.44	1.53	价格区间: 5日:32.68 	10日:14.49 	20日:38.54 	30日:41.00 	60日:29.12 	120日:49.24 	250日:49.24 		,当前价：7.99	,当前：2022-04-18 14:06:09
        chuanMei_guangDian.put("000810", "创维数字");//339	家电行业     10.04	137.48	1.02	价格区间: 5日:81.99 	10日:42.40 	20日:42.20 	30日:42.20 	60日:42.59 	120日:68.72 	250日:68.72 		,当前价：12.93	,当前：2022-04-18 14:06:10
        chuanMei_guangDian.put("600936", "广西广电");//282	文化传媒     10   	71.69	3.63	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:92.14 	120日:94.15 	250日:94.15 		,当前价：4.29	,当前：2022-04-18 14:06:11
        chuanMei_guangDian.put("601929", "吉视传媒");//272	文化传媒     -0.44	73.95	0.91	价格区间: 5日:47.06 	10日:23.53 	20日:23.53 	30日:31.58 	60日:7.27  	120日:23.12 	250日:26.09 		,当前价：2.24	,当前：2022-04-18 14:06:12
    }

    /**
     * chuanMei_jiaoYu  职业教育
     */
    public static Map<String, String> chuanMei_jiaoYu = new HashMap<>();

    static {
        chuanMei_jiaoYu.put("000607", "华媒控股");//294	文化传媒	6.75	64.42	14.89	价格区间: 5日:92.17 	10日:92.17 	20日:94.38 	30日:81.62 	60日:61.37 	120日:72.56 	250日:74.03 		,当前价：6.33	,当前：2022-04-06 11:34:58
        chuanMei_jiaoYu.put("600556", "天下秀  ");//289	文化传媒	0.1 	172.64	4.36	价格区间: 5日:70.71 	10日:66.39 	20日:82.33 	30日:82.33 	60日:32.59 	120日:24.87 	250日:24.87 		,当前价：9.55	,当前：2022-04-06 11:34:59
        chuanMei_jiaoYu.put("003032", "传智教育");//276	教育    	10.03	65.80	4.44	价格区间: 5日:87.68 	10日:88.60 	20日:88.82 	30日:43.90 	60日:35.43 	120日:20.33 	250日:9.76  		,当前价：16.35	,当前：2022-04-06 11:35:01
        chuanMei_jiaoYu.put("000812", "陕西金叶");//242	包装材料	0.74	52.19	1.27	价格区间: 5日:33.87 	10日:44.53 	20日:63.21 	30日:63.21 	60日:26.46 	120日:39.29 	250日:40.19 		,当前价：6.79	,当前：2022-04-06 11:35:03
        chuanMei_jiaoYu.put("002607", "中公教育");//222	教育    	5.93	374.36	14.82	价格区间: 5日:74.12 	10日:77.08 	20日:43.53 	30日:35.58 	60日:26.06 	120日:9.20  	250日:3.07  		,当前价：6.07	,当前：2022-04-06 11:35:04
    }
    /**
     * huaWeiOLa ["华为欧拉"]：2;
     */
    public static Map<String, String> chuanMei_huaWeiOLa = new HashMap<>();

    static {
        chuanMei_huaWeiOLa.put("002261", "拓维信息");//251	软件开发	6.99	91.73	17.11	价格区间: 5日:71.43 	10日:72.97 	20日:43.20 	30日:31.21 	60日:19.71 	120日:16.17 	250日:25.63 		,当前价：7.35	,当前：2022-03-28 12:13:22
        chuanMei_huaWeiOLa.put("600536", "中国软件");//196	互联网服务	2.23	197.18	3.41	价格区间: 5日:49.82 	10日:68.42 	20日:25.87 	30日:25.87 	60日:16.61 	120日:13.96 	250日:9.61  		,当前价：39.87	,当前：2022-03-28 12:13:24
    }
    /**
     * hongMeng ["鸿蒙概念"]：12;
     */
    public static Map<String, String> chuanMei_hongMeng = new HashMap<>();

    static {
        chuanMei_hongMeng.put("000681", "视觉中国");//345	文化传媒	4.88	111.46	10.45	价格区间: 5日:77.17 	10日:86.00 	20日:82.01 	30日:55.93 	60日:18.71 	120日:25.54 	250日:31.11 		,当前价：15.91	,当前：2022-03-28 12:03:32
        chuanMei_hongMeng.put("002268", "卫士通  ");//329	软件开发	-4.4	362.13	3.81	价格区间: 5日:2.20  	10日:31.83 	20日:37.90 	30日:41.96 	60日:29.20 	120日:21.91 	250日:54.66 		,当前价：42.79	,当前：2022-03-28 12:03:34
        chuanMei_hongMeng.put("003032", "传智教育");//262	教育    	10.03	63.55	11.2	价格区间: 5日:100.00	10日:100.00	20日:44.12 	30日:34.80 	60日:22.86 	120日:16.11 	250日:7.73  		,当前价：15.79	,当前：2022-03-28 12:03:35
        chuanMei_hongMeng.put("000158", "常山北明");//261	综合行业	9.97	109.35	37.4	价格区间: 5日:100.00	10日:100.00	20日:63.11 	30日:43.50 	60日:41.33 	120日:34.62 	250日:23.72 		,当前价：6.84	,当前：2022-03-28 12:03:36
        chuanMei_hongMeng.put("002261", "拓维信息");//252	软件开发	6.99	91.73	17.11	价格区间: 5日:71.43 	10日:72.97 	20日:43.20 	30日:31.21 	60日:19.71 	120日:16.17 	250日:25.63 		,当前价：7.35	,当前：2022-03-28 12:03:37
        chuanMei_hongMeng.put("002624", "完美世界");//236	游戏    	1.09	251.03	3.74	价格区间: 5日:22.55 	10日:70.52 	20日:70.52 	30日:59.25 	60日:18.62 	120日:14.98 	250日:13.10 		,当前价：12.94	,当前：2022-03-28 12:03:38
        chuanMei_hongMeng.put("002123", "梦网科技");//214	通信服务	1.27	102.28	5.25	价格区间: 5日:50.56 	10日:55.97 	20日:24.51 	30日:20.72 	60日:11.85 	120日:7.24  	250日:5.68  		,当前价：12.75	,当前：2022-03-28 12:03:39
        chuanMei_hongMeng.put("000997", "新大陆  ");//200	互联网服务	0.24	169.26	3.1 	价格区间: 5日:17.44 	10日:13.23 	20日:26.57 	30日:26.57 	60日:24.93 	120日:39.00 	250日:54.02 		,当前价：16.4	,当前：2022-03-28 12:03:40
    }
    /**
     * netGaiNian ["NFT概念"]：13;
     */
    public static Map<String, String> chuanMei_nft = new HashMap<>();

    static {
        chuanMei_nft.put("000681", "视觉中国");//371	文化传媒     2.8 	131.01	3.27	价格区间: 5日:84.25 	10日:87.90 	20日:90.37 	30日:90.37 	60日:39.15 	120日:44.27 	250日:48.44 		,当前价：18.7	,当前：2022-04-07 13:50:38
        chuanMei_nft.put("603466", "风语筑  ");//359	文化传媒     -2.43	100.01	2.47	价格区间: 5日:71.64 	10日:75.70 	20日:85.20 	30日:85.20 	60日:28.91 	120日:44.58 	250日:50.02 		,当前价：23.7	,当前：2022-04-07 13:50:39
        chuanMei_nft.put("600986", "浙文互联");//319	文化传媒     -0.14	92.04	3.28	价格区间: 5日:67.72 	10日:71.33 	20日:81.28 	30日:81.28 	60日:38.53 	120日:50.69 	250日:53.06 		,当前价：6.96	,当前：2022-04-07 13:50:41
        chuanMei_nft.put("600880", "博瑞传播");//303	教育         0.83	79.70	20   	价格区间: 5日:69.59 	10日:69.59 	20日:75.91 	30日:75.91 	60日:46.43 	120日:62.15 	250日:62.96 		,当前价：7.29	,当前：2022-04-07 13:50:42
        chuanMei_nft.put("002803", "吉宏股份");//295	文化传媒     0.07	57.70	2.99	价格区间: 5日:34.32 	10日:62.24 	20日:70.32 	30日:70.32 	60日:19.66 	120日:19.66 	250日:12.05 		,当前价：14.89	,当前：2022-04-07 13:50:43
        chuanMei_nft.put("600556", "天下秀  ");//288	文化传媒     -2.54	166.67	2.51	价格区间: 5日:44.44 	10日:45.90 	20日:71.55 	30日:71.55 	60日:28.33 	120日:21.61 	250日:21.61 		,当前价：9.22	,当前：2022-04-07 13:50:44
    }

    /**
     * ["虚拟数字人"]：9;
     */
    public static Map<String, String> chuanMei_xunNiShuZiRen = new HashMap<>();

    static {
        chuanMei_xunNiShuZiRen.put("603466", "风语筑  ");//359	文化传媒     -2.43	100.01	2.47	价格区间: 5日:71.64 	10日:76.01 	20日:85.39 	30日:85.39 	60日:28.98 	120日:44.63 	250日:50.07 		,当前价：23.7	,当前：2022-04-07 13:55:13
        chuanMei_xunNiShuZiRen.put("002354", "天娱数科");//354	游戏         0   	91.26	2.23	价格区间: 5日:62.16 	10日:79.10 	20日:80.28 	30日:80.82 	60日:45.58 	120日:64.29 	250日:64.29 		,当前价：5.49	,当前：2022-04-07 13:55:14
        chuanMei_xunNiShuZiRen.put("600986", "浙文互联");//319	文化传媒     -0.14	92.04	3.28	价格区间: 5日:68.50 	10日:72.03 	20日:81.74 	30日:81.74 	60日:38.74 	120日:50.87 	250日:53.22 		,当前价：6.96	,当前：2022-04-07 13:55:16
        chuanMei_xunNiShuZiRen.put("002059", "云南旅游");//315	旅游酒店     -4.56	71.98	5.04	价格区间: 5日:64.42 	10日:70.16 	20日:77.58 	30日:77.58 	60日:48.67 	120日:66.25 	250日:67.63 		,当前价：7.11	,当前：2022-04-07 13:55:17
        chuanMei_xunNiShuZiRen.put("002230", "科大讯飞");//146	软件开发     0.22	1062.22	1.9 	价格区间: 5日:14.03 	10日:9.06  	20日:29.87 	30日:22.87 	60日:19.69 	120日:12.39 	250日:8.04  		,当前价：45.7	,当前：2022-04-07 13:55:22
    }





    /**
     * chuanMei:NFT概念,虚拟数字人,鸿蒙概念,华为欧拉,广电,职业教育
     */
    public static Map<String, String> chuanMei = new HashMap<>();

    static {
        chuanMei.putAll(chuanMei_nft);//NFT概念
        chuanMei.putAll(chuanMei_xunNiShuZiRen);//虚拟数字人
        chuanMei.putAll(chuanMei_hongMeng);//鸿蒙概念
        chuanMei.putAll(chuanMei_huaWeiOLa);//华为欧拉
        chuanMei.putAll(chuanMei_guangDian);//广电
        chuanMei.putAll(chuanMei_yuanYuZhou);//元宇宙概念
        chuanMei.putAll(chuanMei_jiaoYu);//职业教育

    }

    /**
     * youXi_yunYouXi ["云游戏"]：11;
     */
    public static Map<String, String> youXi_yunYouXi = new HashMap<>();

    static {
        youXi_yunYouXi.put("600804", "鹏博士  ");//274	通信服务     1.17	100.28	1.47	价格区间: 5日:7.37  	10日:7.37  	20日:2.98  	30日:2.98  	60日:32.74 	120日:32.74 	250日:45.19 		,当前价：6.05	,当前：2022-04-12 10:17:57
        youXi_yunYouXi.put("002425", "凯撒文化");//266	游戏         0.94	72.13	4.69	价格区间: 5日:40.00 	10日:51.61 	20日:72.22 	30日:72.22 	60日:36.79 	120日:27.08 	250日:23.45 		,当前价：7.54	,当前：2022-04-12 10:17:59
        youXi_yunYouXi.put("002555", "三七互娱");//264	游戏         -2.41	521.64	12.82	价格区间: 5日:17.80 	10日:25.24 	20日:60.10 	30日:60.10 	60日:38.99 	120日:38.99 	250日:49.04 		,当前价：23.52	,当前：2022-04-12 10:18:00
        youXi_yunYouXi.put("002174", "游族网络");//248	游戏         10.05	104.32	2.88	价格区间: 5日:72.15 	10日:72.15 	20日:71.20 	30日:60.99 	60日:26.56 	120日:19.32 	250日:13.85 		,当前价：11.39	,当前：2022-04-12 10:18:01
        youXi_yunYouXi.put("002517", "恺英网络");//238	游戏         10.11	110.21	9.66	价格区间: 5日:75.00 	10日:75.00 	20日:84.47 	30日:84.47 	60日:50.58 	120日:42.93 	250日:54.12 		,当前价：5.12	,当前：2022-04-12 10:18:02
        youXi_yunYouXi.put("600640", "新国脉  ");//236	文化传媒     0.78	81.96	1.58	价格区间: 5日:5.76  	10日:5.76  	20日:25.14 	30日:25.14 	60日:8.06  	120日:7.88  	250日:7.88  		,当前价：10.3	,当前：2022-04-12 10:18:02
        youXi_yunYouXi.put("002699", "美盛文化");//228	文化传媒     -0.31	57.76	2.47	价格区间: 5日:22.78 	10日:38.69 	20日:55.64 	30日:57.49 	60日:50.77 	120日:44.92 	250日:44.92 		,当前价：6.35	,当前：2022-04-12 10:18:03
        youXi_yunYouXi.put("002624", "完美世界");//227	游戏         0.08	240.17	7.34	价格区间: 5日:13.40 	10日:13.40 	20日:42.86 	30日:42.86 	60日:15.65 	120日:9.98  	250日:8.73  		,当前价：12.38	,当前：2022-04-12 10:18:05
    }
    /**
     * youXi_dianZiJingJi ["电子竞技"]：19;
     */
    public static Map<String, String> youXi_dianZiJingJi = new HashMap<>();

    static {
        youXi_dianZiJingJi.put("002280", "联络互动");//364	软件开发     1.31	84.04	1.39	价格区间: 5日:8.11  	10日:25.60 	20日:42.13 	30日:42.13 	60日:42.13 	120日:33.46 	250日:15.38 		,当前价：3.86	,当前：2022-04-12 10:35:42
        youXi_dianZiJingJi.put("002354", "天娱数科");//349	游戏         1.4 	84.11	2.55	价格区间: 5日:10.96 	10日:8.89  	20日:42.25 	30日:42.25 	60日:36.87 	120日:52.23 	250日:52.23 		,当前价：5.06	,当前：2022-04-12 10:35:44
        youXi_dianZiJingJi.put("600880", "博瑞传播");//307	教育         1.92	75.55	3.06	价格区间: 5日:17.74 	10日:53.00 	20日:61.51 	30日:62.77 	60日:38.39 	120日:56.47 	250日:57.41 		,当前价：6.91	,当前：2022-04-12 10:35:45
    }

    /**
     * youXi_shouYou    ["手游概念"]：26;
     */
    public static Map<String, String> youXi_shouYou = new HashMap<>();

    static {
        youXi_shouYou.put("000829", "天音控股");//390	贸易行业     -2.21	122.50	1.62	价格区间: 5日:9.51  	10日:9.51  	20日:16.29 	30日:11.09 	60日:9.31  	120日:3.22  	250日:28.67 		,当前价：11.95	,当前：2022-04-12 10:40:57
        youXi_shouYou.put("002354", "天娱数科");//349	游戏         1.4 	84.11	2.55	价格区间: 5日:10.96 	10日:8.89  	20日:42.25 	30日:42.25 	60日:36.87 	120日:52.23 	250日:52.23 		,当前价：5.06	,当前：2022-04-12 10:40:59
        youXi_shouYou.put("600880", "博瑞传播");//307	教育         1.92	75.55	3.06	价格区间: 5日:18.55 	10日:53.46 	20日:61.89 	30日:63.14 	60日:38.62 	120日:56.62 	250日:57.56 		,当前价：6.91	,当前：2022-04-12 10:41:00
        youXi_shouYou.put("002425", "凯撒文化");//266	游戏         0.94	72.13	4.69	价格区间: 5日:50.67 	10日:60.22 	20日:77.16 	30日:77.16 	60日:39.31 	120日:28.94 	250日:25.05 		,当前价：7.54	,当前：2022-04-12 10:41:01
        youXi_shouYou.put("002555", "三七互娱");//264	游戏         -2.41	521.64	12.82	价格区间: 5日:29.58 	10日:35.95 	20日:65.82 	30日:65.82 	60日:42.79 	120日:42.79 	250日:52.20 		,当前价：23.52	,当前：2022-04-12 10:41:02
        youXi_shouYou.put("603258", "电魂网络");//256	游戏         0.86	66.47	5.26	价格区间: 5日:16.62 	10日:40.65 	20日:61.98 	30日:61.98 	60日:39.47 	120日:40.98 	250日:47.77 		,当前价：26.96	,当前：2022-04-12 10:41:03
        youXi_shouYou.put("600770", "综艺股份");//253	综合行业     1.36	87.23	1.47	价格区间: 5日:7.89  	10日:6.67  	20日:28.21 	30日:29.41 	60日:29.41 	120日:38.15 	250日:42.53 		,当前价：6.71	,当前：2022-04-12 10:41:04
        youXi_shouYou.put("600633", "浙数文化");//249	游戏         2.92	98.22	2.42	价格区间: 5日:17.83 	10日:17.83 	20日:15.23 	30日:11.11 	60日:4.28  	120日:13.74 	250日:18.12 		,当前价：7.76	,当前：2022-04-12 10:41:05
        youXi_shouYou.put("002174", "游族网络");//248	游戏         10.05	104.32	2.88	价格区间: 5日:72.15 	10日:72.15 	20日:71.20 	30日:60.99 	60日:26.56 	120日:19.32 	250日:13.85 		,当前价：11.39	,当前：2022-04-12 10:41:06

    }

    /**
     * youXi_wangLuoYouXi ["网络游戏"]：36;
     */
    public static Map<String, String> youXi_wangLuoYouXi = new HashMap<>();

    static {
        youXi_wangLuoYouXi.put("002354", "天娱数科");//349	游戏         1.4 	84.11	2.55	价格区间: 5日:12.33 	10日:10.00 	20日:42.96 	30日:42.96 	60日:37.79 	120日:52.68 	250日:52.68 		,当前价：5.06	,当前：2022-04-12 10:45:11
        youXi_wangLuoYouXi.put("603466", "风语筑  ");//347	文化传媒     -0.48	88.40	1.5 	价格区间: 5日:8.24  	10日:8.24  	20日:23.91 	30日:23.91 	60日:8.11  	120日:28.36 	250日:35.40 		,当前价：20.95	,当前：2022-04-12 10:45:13
        youXi_wangLuoYouXi.put("002605", "姚记科技");//321	家用轻工     0.53	85.06	4.33	价格区间: 5日:58.29 	10日:65.37 	20日:73.18 	30日:73.18 	60日:26.06 	120日:29.58 	250日:30.17 		,当前价：21.01	,当前：2022-04-12 10:45:14
        youXi_wangLuoYouXi.put("600880", "博瑞传播");//307	教育         1.92	75.55	3.06	价格区间: 5日:17.74 	10日:53.00 	20日:61.51 	30日:62.77 	60日:38.39 	120日:56.47 	250日:57.41 		,当前价：6.91	,当前：2022-04-12 10:45:15
        youXi_wangLuoYouXi.put("600556", "天下秀  ");//288	文化传媒     1.83	150.59	1.67	价格区间: 5日:11.70 	10日:10.93 	20日:29.74 	30日:29.74 	60日:15.20 	120日:8.98  	250日:8.98  		,当前价：8.33	,当前：2022-04-12 10:45:16
        youXi_wangLuoYouXi.put("000676", "智度股份");//284	文化传媒     0.49	79.27	1.5 	价格区间: 5日:7.76  	10日:7.76  	20日:7.76  	30日:5.81  	60日:2.90  	120日:14.73 	250日:26.41 		,当前价：6.21	,当前：2022-04-12 10:45:18
        youXi_wangLuoYouXi.put("002425", "凯撒文化");//266	游戏         0.94	72.13	4.69	价格区间: 5日:49.33 	10日:59.14 	20日:76.54 	30日:76.54 	60日:38.99 	120日:28.70 	250日:24.85 		,当前价：7.54	,当前：2022-04-12 10:45:19
        youXi_wangLuoYouXi.put("002555", "三七互娱");//264	游戏         -2.41	521.64	12.82	价格区间: 5日:28.27 	10日:34.76 	20日:65.18 	30日:65.18 	60日:42.29 	120日:42.29 	250日:51.79 		,当前价：23.52	,当前：2022-04-12 10:45:19
        youXi_wangLuoYouXi.put("603258", "电魂网络");//256	游戏         0.86	66.47	5.26	价格区间: 5日:21.15 	10日:43.87 	20日:64.05 	30日:64.05 	60日:40.79 	120日:42.26 	250日:48.90 		,当前价：26.96	,当前：2022-04-12 10:45:21
        youXi_wangLuoYouXi.put("600770", "综艺股份");//253	综合行业     1.36	87.23	1.47	价格区间: 5日:7.24  	10日:6.11  	20日:27.78 	30日:28.99 	60日:28.99 	120日:37.87 	250日:42.28 		,当前价：6.71	,当前：2022-04-12 10:45:22
        youXi_wangLuoYouXi.put("600633", "浙数文化");//249	游戏         2.92	98.22	2.42	价格区间: 5日:20.16 	10日:20.16 	20日:17.22 	30日:12.56 	60日:4.83  	120日:14.24 	250日:18.60 		,当前价：7.76	,当前：2022-04-12 10:45:23
        youXi_wangLuoYouXi.put("002174", "游族网络");//248	游戏         10.05	104.32	2.88	价格区间: 5日:72.15 	10日:72.15 	20日:71.20 	30日:60.99 	60日:26.56 	120日:19.32 	250日:13.85 		,当前价：11.39	,当前：2022-04-12 10:45:23

    }

    /**
     * youXi 游戏
     */
    public static Map<String, String> youXi = new HashMap<>();

    static {
        youXi.putAll(youXi_yunYouXi);//云游戏
        youXi.putAll(youXi_dianZiJingJi);//电子竞技
        youXi.putAll(youXi_shouYou);//手游概念
        youXi.putAll(youXi_wangLuoYouXi);//网络游戏
    }

    /**
     * xinNengYuan 新能源
     */
    public static Map<String, String> xinNengYuan = new HashMap<>();

    static {
        xinNengYuan.putAll(xinNengYuan_guTaiDianChi);//固态电池
        xinNengYuan.putAll(xinNengYuan_daoPianDianChi);//刀片电池
    }

    /**
     * junGong_hangMu ["航母概念"]：32;
     */
    public static Map<String, String> junGong_hangMu = new HashMap<>();

    static {
        junGong_hangMu.put("002314", "南山控股");//348	房地产开发   -2.31	137.28	2.42	价格区间: 5日:12.27 	10日:33.45 	20日:45.33 	30日:48.53 	60日:48.53 	120日:55.12 	250日:55.12 		,当前价：5.07	,当前：2022-04-15 13:40:46
        junGong_hangMu.put("600765", "中航重机");//309	航天航空     -1.03	362.18	2.3 	价格区间: 5日:21.58 	10日:11.16 	20日:8.66  	30日:8.14  	60日:7.53  	120日:6.25  	250日:47.93 		,当前价：34.44	,当前：2022-04-15 13:40:48
        junGong_hangMu.put("600378", "昊华科技");//292	化学制品     -1.81	319.16	2.25	价格区间: 5日:8.24  	10日:8.24  	20日:6.35  	30日:14.83 	60日:17.27 	120日:29.49 	250日:51.92 		,当前价：34.72	,当前：2022-04-15 13:40:49
        junGong_hangMu.put("601890", "亚星锚链");//287	船舶制造     1.24	78.19	2.81	价格区间: 5日:84.38 	10日:84.38 	20日:84.38 	30日:54.82 	60日:31.58 	120日:43.75 	250日:56.18 		,当前价：8.15	,当前：2022-04-15 13:40:50
        junGong_hangMu.put("600456", "宝钛股份");//273	小金属       -1.62	232.49	1.63	价格区间: 5日:41.50 	10日:19.40 	20日:19.40 	30日:29.87 	60日:18.53 	120日:11.58 	250日:34.20 		,当前价：48.66	,当前：2022-04-15 13:40:51
        junGong_hangMu.put("601137", "博威合金");//258	有色金属     0.4 	99.39	1.77	价格区间: 5日:24.90 	10日:13.16 	20日:10.12 	30日:7.69  	60日:4.66  	120日:4.42  	250日:18.10 		,当前价：12.58	,当前：2022-04-15 13:40:53
        junGong_hangMu.put("002318", "久立特材");//256	钢铁行业     0.14	140.61	1.23	价格区间: 5日:52.05 	10日:38.38 	20日:31.79 	30日:16.38 	60日:9.25  	120日:31.54 	250日:47.20 		,当前价：14.39	,当前：2022-04-15 13:40:54
    }

    /**
     * junGong_haiGongZhuangBei ["海工装备"]：23;
     */
    public static Map<String, String> junGong_haiGongZhuangBei = new HashMap<>();

    static {
        junGong_haiGongZhuangBei.put("603606", "东方电缆");//347	电网设备     -0.59	303.14	2.06	价格区间: 5日:30.23 	10日:10.41 	20日:6.62  	30日:6.62  	60日:5.49  	120日:34.61 	250日:55.87 		,当前价：44.08	,当前：2022-04-15 13:50:24
        junGong_haiGongZhuangBei.put("600522", "中天科技");//329	通信设备     -1.4	503.41	3.29	价格区间: 5日:23.45 	10日:11.11 	20日:6.44  	30日:6.44  	60日:13.48 	120日:50.76 	250日:56.96 		,当前价：14.75	,当前：2022-04-15 13:50:25
        junGong_haiGongZhuangBei.put("601126", "四方股份");//318	电网设备     0.28	87.74	3.04	价格区间: 5日:21.43 	10日:9.71  	20日:7.79  	30日:4.72  	60日:3.53  	120日:1.82  	250日:21.50 		,当前价：10.79	,当前：2022-04-15 13:50:27
        junGong_haiGongZhuangBei.put("601890", "亚星锚链");//287	船舶制造     1.24	78.19	2.81	价格区间: 5日:82.81 	10日:82.81 	20日:82.81 	30日:53.81 	60日:30.99 	120日:43.27 	250日:55.81 		,当前价：8.15	,当前：2022-04-15 13:50:28
        junGong_haiGongZhuangBei.put("002353", "杰瑞股份");//270	专用设备     3.34	388.51	2.42	价格区间: 5日:93.83 	10日:53.92 	20日:32.15 	30日:27.90 	60日:27.90 	120日:25.62 	250日:45.44 		,当前价：40.56	,当前：2022-04-15 13:50:29
        junGong_haiGongZhuangBei.put("601800", "中国交建");//255	工程建设     -1.48	1613.34	1.93	价格区间: 5日:37.50 	10日:72.97 	20日:79.59 	30日:79.45 	60日:57.69 	120日:69.79 	250日:74.57 		,当前价：9.98	,当前：2022-04-15 13:50:30
    }


    /**
     * junGong 军工
     */
    public static Map<String, String> junGong = new HashMap<>();

    static {
        junGong.putAll(junGong_hangMu);//航母概念
        junGong.putAll(junGong_haiGongZhuangBei);//海工装备
    }

    /**
     * junGong_jiGuangLeiDa ["激光雷达"]：5;
     */
    public static Map<String, String> qiChe_jiGuangLeiDa = new HashMap<>();

    static {
        qiChe_jiGuangLeiDa.put("603297", "永新光学");//402	光学光电子   3.55	94.81	1.76	价格区间: 5日:67.53 	10日:35.52 	20日:23.65 	30日:22.86 	60日:18.68 	120日:38.21 	250日:48.02 		,当前价：85.82	,当前：2022-04-18 10:34:25
        qiChe_jiGuangLeiDa.put("603035", "常熟汽饰");//254	汽车零部件   10.02	53.84	56.62	价格区间: 5日:100.00	10日:100.00	20日:79.40 	30日:55.68 	60日:26.39 	120日:27.45 	250日:30.03 		,当前价：14.49	,当前：2022-04-18 10:34:26
        qiChe_jiGuangLeiDa.put("600699", "均胜电子");//229	汽车零部件   1.11	173.75	3.69	价格区间: 5日:85.33 	10日:31.37 	20日:18.03 	30日:11.74 	60日:6.40  	120日:5.15  	250日:3.55  		,当前价：12.7	,当前：2022-04-18 10:34:27
    }

    /**
     * qiChe_huaWeiQiChe ["华为汽车"]：19;
     */
    public static Map<String, String> qiChe_huaWeiQiChe = new HashMap<>();

    static {
        qiChe_huaWeiQiChe.put("601127", "小康股份");//396	汽车整车     7.8 	588.31	1.39	价格区间: 5日:84.15 	10日:52.70 	20日:54.11 	30日:63.31 	60日:28.86 	120日:13.92 	250日:33.15 		,当前价：43.26	,当前：2022-04-18 11:05:25
        qiChe_huaWeiQiChe.put("002906", "华阳集团");//314	汽车零部件   1.87	157.99	2.95	价格区间: 5日:89.68 	10日:42.95 	20日:29.79 	30日:25.85 	60日:12.19 	120日:11.47 	250日:22.18 		,当前价：33.28	,当前：2022-04-18 11:05:27
        qiChe_huaWeiQiChe.put("002036", "联创电子");//309	光学光电子   4.29	139.55	2.42	价格区间: 5日:80.00 	10日:35.14 	20日:20.81 	30日:20.12 	60日:8.29  	120日:7.51  	250日:21.58 		,当前价：13.13	,当前：2022-04-18 11:05:28
        qiChe_huaWeiQiChe.put("002920", "德赛西威");//292	汽车零部件   4.12	620.24	1.49	价格区间: 5日:87.41 	10日:55.45 	20日:49.61 	30日:46.81 	60日:27.88 	120日:25.82 	250日:44.09 		,当前价：111.7	,当前：2022-04-18 11:05:29
    }

    /**
     * qiChe_taiYaJianCe ["胎压监测"]：11;
     */
    public static Map<String, String> qiChe_taiYaJianCe = new HashMap<>();

    static {
        qiChe_taiYaJianCe.put("002906", "华阳集团");//308	汽车零部件   -1.59	152.63	2.95	价格区间: 5日:91.83 	10日:43.15 	20日:29.93 	30日:25.98 	60日:12.24 	120日:11.52 	250日:22.23 		,当前价：32.15	,当前：2022-04-18 10:52:11
        qiChe_taiYaJianCe.put("603197", "保隆科技");//303	汽车零部件   0.58	75.10	5.93	价格区间: 5日:94.46 	10日:55.80 	20日:40.94 	30日:38.95 	60日:12.52 	120日:18.66 	250日:26.43 		,当前价：36.14	,当前：2022-04-18 10:52:12
        qiChe_taiYaJianCe.put("002284", "亚太股份");//282	汽车零部件   1.86	52.60	2.68	价格区间: 5日:90.63 	10日:54.21 	20日:34.73 	30日:25.88 	60日:12.45 	120日:13.45 	250日:30.23 		,当前价：7.13	,当前：2022-04-18 10:52:13
        qiChe_taiYaJianCe.put("002232", "启明信息");//254	互联网服务   -5.29	54.87	4.7 	价格区间: 5日:15.30 	10日:12.22 	20日:12.19 	30日:10.95 	60日:6.65  	120日:17.41 	250日:17.41 		,当前价：13.43	,当前：2022-04-18 10:52:15
    }

    /**
     * qiChe_teSiLa ["特斯拉"]：71;
     */
    public static Map<String, String> qiChe_teSiLa = new HashMap<>();

    static {
        qiChe_teSiLa.put("002738", "中矿资源");//418	小金属       -0.5	264.81	2.59	价格区间: 5日:65.67 	10日:30.55 	20日:18.33 	30日:16.42 	60日:46.27 	120日:48.80 	250日:66.42 		,当前价：81.31	,当前：2022-04-18 11:18:55
        qiChe_teSiLa.put("002537", "海联金汇");//398	汽车零部件   -0.42	110.24	2.17	价格区间: 5日:19.14 	10日:9.04  	20日:7.24  	30日:22.31 	60日:34.16 	120日:51.47 	250日:52.11 		,当前价：9.39	,当前：2022-04-18 11:18:57
        qiChe_teSiLa.put("603348", "文灿股份");//354	汽车零部件   9.99	90.07	1.75	价格区间: 5日:100.00	10日:54.14 	20日:42.21 	30日:42.21 	60日:13.83 	120日:13.83 	250日:27.01 		,当前价：34.36	,当前：2022-04-18 11:18:58
        qiChe_teSiLa.put("600335", "国机汽车");//353	汽车服务     6.71	111.16	0.88	价格区间: 5日:79.17 	10日:37.18 	20日:16.95 	30日:28.84 	60日:28.84 	120日:36.13 	250日:43.87 		,当前价：7.63	,当前：2022-04-18 11:18:59
        qiChe_teSiLa.put("603920", "世运电路");//351	电子元件     2.64	80.85	5.62	价格区间: 5日:86.93 	10日:45.27 	20日:34.54 	30日:33.77 	60日:12.82 	120日:12.82 	250日:28.86 		,当前价：15.19	,当前：2022-04-18 11:19:01
        qiChe_teSiLa.put("002466", "天齐锂业");//337	能源金属     0.41	1081.68	1.45	价格区间: 5日:61.74 	10日:30.69 	20日:24.48 	30日:16.43 	60日:13.74 	120日:8.23  	250日:36.87 		,当前价：73.23	,当前：2022-04-18 11:19:02
        qiChe_teSiLa.put("603179", "新泉股份");//334	汽车零部件   5.63	109.64	7.33	价格区间: 5日:80.00 	10日:43.18 	20日:29.59 	30日:25.07 	60日:18.19 	120日:18.19 	250日:18.19 		,当前价：29.25	,当前：2022-04-18 11:19:04
        qiChe_teSiLa.put("002182", "云海金属");//329	小金属       -1.37	120.88	1.44	价格区间: 5日:30.13 	10日:29.24 	20日:16.59 	30日:12.06 	60日:8.49  	120日:26.12 	250日:43.38 		,当前价：18.7	,当前：2022-04-18 11:19:06
        qiChe_teSiLa.put("002472", "双环传动");//326	汽车零部件   3   	152.27	0.85	价格区间: 5日:94.52 	10日:60.57 	20日:35.45 	30日:30.77 	60日:18.45 	120日:13.57 	250日:43.23 		,当前价：19.58	,当前：2022-04-18 11:19:07
        qiChe_teSiLa.put("601689", "拓普集团");//325	汽车零部件   -0.08	552.13	4.09	价格区间: 5日:57.33 	10日:28.71 	20日:27.42 	30日:25.84 	60日:22.87 	120日:21.64 	250日:56.30 		,当前价：50.1	,当前：2022-04-18 11:19:08
        qiChe_teSiLa.put("002497", "雅化集团");//323	化学制品     -3.6	348.88	3.55	价格区间: 5日:70.74 	10日:70.74 	20日:70.74 	30日:47.98 	60日:51.18 	120日:51.18 	250日:50.39 		,当前价：30.27	,当前：2022-04-18 11:19:09
    }

    /**
     * qiChe_ciXuanFu ["磁悬浮概念"]：8;
     */
    public static Map<String, String> qiChe_ciXuanFu = new HashMap<>();

    static {
        qiChe_ciXuanFu.put("002028", "思源电气");//241	电网设备     3.46	240.38	0.53	价格区间: 5日:84.64 	10日:59.41 	20日:25.83 	30日:18.91 	60日:13.53 	120日:8.93  	250日:18.32 		,当前价：31.38	,当前：2022-04-18 11:29:46
        qiChe_ciXuanFu.put("002056", "横店东磁");//225	小金属       2.92	223.84	0.62	价格区间: 5日:80.00 	10日:80.00 	20日:80.00 	30日:37.98 	60日:28.51 	120日:12.75 	250日:20.51 		,当前价：13.76	,当前：2022-04-18 11:29:48
        qiChe_ciXuanFu.put("600458", "时代新材");//224	风电设备     0.33	72.57	0.75	价格区间: 5日:34.78 	10日:13.71 	20日:9.27  	30日:5.21  	60日:4.54  	120日:4.79  	250日:16.06 		,当前价：9.04	,当前：2022-04-18 11:29:49
        qiChe_ciXuanFu.put("600105", "永鼎股份");//209	通信设备     -0.56	50.09	1.1 	价格区间: 5日:15.63 	10日:8.93  	20日:7.58  	30日:5.56  	60日:2.91  	120日:1.62  	250日:12.43 		,当前价：3.55	,当前：2022-04-18 11:29:50
    }
    /**
     * qiChe 科技-汽车: 激光雷达,胎压监测
     */
    public static Map<String, String> qiChe = new HashMap<>();

    static {
        qiChe.putAll(qiChe_jiGuangLeiDa);//激光雷达
        qiChe.putAll(qiChe_taiYaJianCe);//胎压监测
        qiChe.putAll(qiChe_huaWeiQiChe);//华为汽车
    }

    /**
     * xinPian_guangKeJiao ["光刻胶"]：13;
     */
    public static Map<String, String> xinPian_guangKeJiao = new HashMap<>();

    static {
        xinPian_guangKeJiao.put("002584", "西陇科学");//291	电子化学品   1.28	55.36	null	价格区间: 5日:19.31 	10日:16.18 	20日:13.68 	30日:19.61 	60日:22.14 	120日:47.04 	250日:48.99 		,当前价：9.46	,当前：2022-04-08 10:54:40
        xinPian_guangKeJiao.put("603650", "彤程新材");//289	橡胶制品     1.14	202.14	null	价格区间: 5日:40.43 	10日:30.73 	20日:19.41 	30日:19.41 	60日:17.20 	120日:5.14  	250日:9.09  		,当前价：33.85	,当前：2022-04-08 10:54:42
        xinPian_guangKeJiao.put("603078", "江化微  ");//246	电子化学品   4.35	57.85	null	价格区间: 5日:63.86 	10日:40.53 	20日:32.63 	30日:40.12 	60日:50.65 	120日:57.74 	250日:57.49 		,当前价：29.52	,当前：2022-04-08 10:54:44
        xinPian_guangKeJiao.put("002409", "雅克科技");//224	半导体       0.04	227.59	null	价格区间: 5日:27.84 	10日:16.79 	20日:13.86 	30日:9.75  	60日:5.93  	120日:4.44  	250日:3.07  		,当前价：47.82	,当前：2022-04-08 10:54:45
        xinPian_guangKeJiao.put("605589", "圣泉集团");//218	化学制品     0.54	217.17	null	价格区间: 5日:32.09 	10日:12.93 	20日:7.69  	30日:7.69  	60日:4.92  	120日:3.68  	250日:3.27  		,当前价：28.03	,当前：2022-04-08 10:54:46
        xinPian_guangKeJiao.put("603306", "华懋科技");//215	汽车零部件   -0.2	90.97	null	价格区间: 5日:26.32 	10日:18.12 	20日:15.49 	30日:11.46 	60日:11.46 	120日:7.86  	250日:22.34 		,当前价：29.63	,当前：2022-04-08 10:54:47
    }

    /**
     * xinPian_zhongXin ["中芯概念"]：19;
     */
    public static Map<String, String> xinPian_zhongXin = new HashMap<>();

    static {
        xinPian_zhongXin.put("600141", "兴发集团");//379	化肥行业     2.14	418.56	1.35	价格区间: 5日:53.80 	10日:78.29 	20日:78.82 	30日:69.47 	60日:69.18 	120日:34.34 	250日:54.90 		,当前价：37.65	,当前：2022-04-18 10:39:44
        xinPian_zhongXin.put("002371", "北方华创");//326	半导体       2.33	1406.35	1.85	价格区间: 5日:97.93 	10日:79.17 	20日:43.07 	30日:35.02 	60日:35.02 	120日:15.58 	250日:40.67 		,当前价：267.46	,当前：2022-04-18 10:39:46
        xinPian_zhongXin.put("600378", "昊华科技");//290	化学制品     2.2 	320.35	2.31	价格区间: 5日:19.48 	10日:19.48 	20日:15.46 	30日:15.46 	60日:17.16 	120日:29.44 	250日:51.89 		,当前价：34.85	,当前：2022-04-18 10:39:47
        xinPian_zhongXin.put("603690", "至纯科技");//273	专用设备     1.67	108.80	0.96	价格区间: 5日:86.10 	10日:36.98 	20日:29.73 	30日:25.34 	60日:12.25 	120日:6.82  	250日:17.03 		,当前价：34.16	,当前：2022-04-18 10:39:48
        xinPian_zhongXin.put("600160", "巨化股份");//270	化学制品     -1.73	322.35	0.37	价格区间: 5日:38.64 	10日:18.58 	20日:14.72 	30日:11.53 	60日:21.37 	120日:17.64 	250日:30.45 		,当前价：11.94	,当前：2022-04-18 10:39:52
        xinPian_zhongXin.put("603078", "江化微  ");//263	电子化学品   5.92	61.03	3.12	价格区间: 5日:89.82 	10日:89.82 	20日:51.72 	30日:58.70 	60日:65.96 	120日:70.85 	250日:66.63 		,当前价：31.14	,当前：2022-04-18 10:39:53
    }

    /**
     * xinPian_qiCheXinPian 汽车芯片
     */
    public static Map<String, String> xinPian_qiCheXinPian = new HashMap<>();

    static {
        xinPian_qiCheXinPian.put("605111", "新洁能  ");//321	半导体       0.7 	185.67	2.23	价格区间: 5日:84.21 	10日:34.55 	20日:13.92 	30日:13.12 	60日:13.12 	120日:8.37  	250日:12.00 		,当前价：130.0	,当前：2022-04-18 10:20:50
        xinPian_qiCheXinPian.put("603986", "兆易创新");//281	半导体       1.64	898.21	1.89	价格区间: 5日:92.48 	10日:61.42 	20日:29.26 	30日:27.31 	60日:27.31 	120日:19.30 	250日:17.06 		,当前价：134.57	,当前：2022-04-18 10:20:51
        xinPian_qiCheXinPian.put("002180", "纳思达  ");//251	计算机设备   2.49	598.94	0.38	价格区间: 5日:73.40 	10日:67.77 	20日:53.36 	30日:40.37 	60日:27.33 	120日:38.85 	250日:61.07 		,当前价：42.45	,当前：2022-04-18 10:20:53
        xinPian_qiCheXinPian.put("002049", "紫光国微");//248	半导体       2.73	1084.15	0.21	价格区间: 5日:61.23 	10日:27.49 	20日:23.79 	30日:20.53 	60日:16.72 	120日:16.67 	250日:52.23 		,当前价：178.65	,当前：2022-04-18 10:20:54
        xinPian_qiCheXinPian.put("605358", "立昂微  ");//247	半导体       -1.1	362.48	3.77	价格区间: 5日:32.69 	10日:15.35 	20日:8.00  	30日:5.49  	60日:5.10  	120日:3.43  	250日:5.59  		,当前价：79.26	,当前：2022-04-18 10:20:55
    }

    /**
     * xinPian_PVDF ["PVDF概念"]：5;
     */
    public static Map<String, String> xinPian_pvdf = new HashMap<>();

    static {
        xinPian_pvdf.put("603659", "璞泰来  ");//332	电池         3.35	1001.65	1.76	价格区间: 5日:84.07 	10日:91.06 	20日:92.63 	30日:85.91 	60日:71.59 	120日:34.11 	250日:59.01 		,当前价：144.25	,当前：2022-04-08 12:07:31
        xinPian_pvdf.put("600378", "昊华科技");//296	化学制品     0.08	363.46	0.87	价格区间: 5日:73.77 	10日:45.01 	20日:68.16 	30日:68.16 	60日:69.07 	120日:55.19 	250日:68.73 		,当前价：39.54	,当前：2022-04-08 12:07:32
    }

    /**
     * xinPian_igbt ["IGBT概念"]：17;
     */
    public static Map<String, String> xinPian_igbt = new HashMap<>();

    static {
        xinPian_igbt.put("605111", "新洁能  ");//321	半导体       0.7 	185.67	2.23	价格区间: 5日:97.41 	10日:39.97 	20日:16.10 	30日:15.18 	60日:15.18 	120日:9.71  	250日:13.29 		,当前价：130.0	,当前：2022-04-18 10:31:02
        xinPian_igbt.put("603290", "斯达半导");//315	半导体       2.39	567.27	1.26	价格区间: 5日:86.36 	10日:28.22 	20日:25.10 	30日:23.83 	60日:35.02 	120日:22.36 	250日:46.71 		,当前价：332.5	,当前：2022-04-18 10:31:03
        xinPian_igbt.put("600460", "士兰微  ");//286	半导体       3.62	595.74	1.35	价格区间: 5日:97.34 	10日:34.56 	20日:16.19 	30日:14.68 	60日:14.68 	120日:10.71 	250日:33.87 		,当前价：42.07	,当前：2022-04-18 10:31:05
        xinPian_igbt.put("003031", "中瓷电子");//282	通信设备     -0.5	118.87	0.16	价格区间: 5日:36.91 	10日:14.87 	20日:9.14  	30日:8.83  	60日:14.16 	120日:39.86 	250日:53.21 		,当前价：79.6	,当前：2022-04-18 10:31:07
        xinPian_igbt.put("000733", "振华科技");//279	电子元件     -0.77	527.05	0.48	价格区间: 5日:32.83 	10日:29.48 	20日:27.13 	30日:26.71 	60日:16.87 	120日:16.87 	250日:67.39 		,当前价：101.72	,当前：2022-04-18 10:31:08
        xinPian_igbt.put("002594", "比亚迪  ");//264	汽车整车     -1.35	6783.25	1.01	价格区间: 5日:35.62 	10日:43.92 	20日:45.59 	30日:62.33 	60日:43.52 	120日:20.91 	250日:49.10 		,当前价：233.01	,当前：2022-04-18 10:31:10
        xinPian_igbt.put("600406", "国电南瑞");//253	电网设备     -0.6	1582.16	0.51	价格区间: 5日:32.61 	10日:17.34 	20日:14.38 	30日:7.93  	60日:4.77  	120日:3.19  	250日:23.30 		,当前价：28.36	,当前：2022-04-18 10:31:11
        xinPian_igbt.put("002049", "紫光国微");//248	半导体       2.73	1084.15	0.21	价格区间: 5日:64.73 	10日:29.06 	20日:25.15 	30日:21.70 	60日:17.68 	120日:17.62 	250日:52.70 		,当前价：178.65	,当前：2022-04-18 10:31:12
    }

    /**
     * xinPian 科技-芯片：汽车芯片,IGBT概念,中芯概念,第三代半导体,PVDF概念,光刻胶,半导体概念,
     */
    public static Map<String, String> xinPian = new HashMap<>();

    static {
        xinPian.putAll(xinPian_qiCheXinPian);//汽车芯片
        xinPian.putAll(xinPian_igbt);//IGBT概念
        xinPian.putAll(xinPian_zhongXin);//中芯概念
        xinPian.putAll(xinPian_guangKeJiao);//光刻胶
        xinPian.putAll(xinPian_pvdf);//PVDF概念
    }

    /**
     * gongYe_gongYeMuJi ["工业母机"]：12;
     */
    public static Map<String, String> gongYe_gongYeMuJi = new HashMap<>();

    static {
        gongYe_gongYeMuJi.put("603185", "上机数控");//325	光伏设备     3.95	379.37	0.58	价格区间: 5日:94.01 	10日:88.88 	20日:32.21 	30日:24.21 	60日:32.23 	120日:10.37 	250日:10.18 		,当前价：137.84	,当前：2022-04-18 11:32:56
        gongYe_gongYeMuJi.put("002026", "山东威达");//286	通用设备     0.44	50.46	1.03	价格区间: 5日:40.82 	10日:16.46 	20日:11.59 	30日:8.42  	60日:3.68  	120日:3.26  	250日:6.25  		,当前价：11.45	,当前：2022-04-18 11:32:57
        gongYe_gongYeMuJi.put("600862", "中航高科");//233	航天航空     3.27	281.81	0.1 	价格区间: 5日:67.14 	10日:28.06 	20日:19.03 	30日:14.26 	60日:6.79  	120日:4.91  	250日:4.43  		,当前价：20.23	,当前：2022-04-18 11:32:59
        gongYe_gongYeMuJi.put("002520", "日发精机");//229	通用设备     -1.01	50.57	0.79	价格区间: 5日:24.32 	10日:24.32 	20日:16.51 	30日:6.55  	60日:5.19  	120日:2.64  	250日:4.46  		,当前价：5.86	,当前：2022-04-18 11:33:00
        gongYe_gongYeMuJi.put("002270", "华明装备");//228	电网设备     2.28	60.41	0.22	价格区间: 5日:55.38 	10日:55.38 	20日:31.86 	30日:15.86 	60日:12.16 	120日:5.72  	250日:28.90 		,当前价：6.74	,当前：2022-04-18 11:33:01
        gongYe_gongYeMuJi.put("601882", "海天精工");//226	通用设备     0.28	95.16	1.87	价格区间: 5日:84.21 	10日:80.63 	20日:40.68 	30日:33.27 	60日:24.52 	120日:14.64 	250日:24.89 		,当前价：18.23	,当前：2022-04-18 11:33:02
        gongYe_gongYeMuJi.put("000837", "秦川机床");//215	通用设备     -2.67	72.13	1.06	价格区间: 5日:60.36 	10日:60.36 	20日:50.76 	30日:26.48 	60日:22.48 	120日:15.44 	250日:15.85 		,当前价：8.02	,当前：2022-04-18 11:33:04
    }

    /**
     * gongYe_gongYe40 ["工业4.0"]：32;
     */
    public static Map<String, String> gongYe_gongYe40 = new HashMap<>();

    static {
        gongYe_gongYe40.put("603396", "金辰股份");//341	光伏设备     0.21	65.74	2.61	价格区间: 5日:22.95 	10日:14.65 	20日:7.58  	30日:5.52  	60日:4.57  	120日:1.58  	250日:16.54 		,当前价：56.53	,当前：2022-04-13 10:48:28
        gongYe_gongYe40.put("002472", "双环传动");//313	汽车零部件   -1.47	140.92	1.31	价格区间: 5日:18.80 	10日:12.08 	20日:7.64  	30日:5.56  	60日:4.09  	120日:3.01  	250日:38.49 		,当前价：18.12	,当前：2022-04-13 10:48:29
        gongYe_gongYe40.put("002009", "天奇股份");//283	专用设备     -1.85	62.51	1.58	价格区间: 5日:11.50 	10日:6.57  	20日:4.95  	30日:4.64  	60日:9.37  	120日:5.91  	250日:43.98 		,当前价：16.48	,当前：2022-04-13 10:48:31
    }
    /**
     * gongYe 工业
     */
    public static Map<String, String> gongYe = new HashMap<>();

    static {
        gongYe.putAll(gongYe_gongYeMuJi);//工业母机
        gongYe.putAll(gongYe_gongYe40);//工业4.0
    }


    /**
     * zhiNeng_renNaoGongCheng ["人脑工程"]：1;
     */
    public static Map<String, String> zhiNeng_renNaoGongCheng = new HashMap<>();

    static {
        zhiNeng_renNaoGongCheng.put("002230", "科大讯飞");//143	软件开发     -0.34	966.22	0.45	价格区间: 5日:24.42 	10日:16.64 	20日:13.16 	30日:11.17 	60日:10.32 	120日:5.93  	250日:4.06  		,当前价：41.57	,当前：2022-04-14 11:05:24
    }
    /**
     * zhiNeng 智能
     */
    public static Map<String, String> zhiNeng = new HashMap<>();

    static {
        zhiNeng.putAll(zhiNeng_renNaoGongCheng);//人脑工程
    }

    /**
     * guangFu_hit ["HIT电池"]：13;
     */
    public static Map<String, String> guangFu_hit = new HashMap<>();

    static {
        guangFu_hit.put("600546", "山煤国际");//394	煤炭行业     -0.87	292.81	2.3 	价格区间: 5日:35.15 	10日:46.28 	20日:56.96 	30日:63.38 	60日:73.02 	120日:74.46 	250日:78.32 		,当前价：14.77	,当前：2022-04-18 11:14:27
        guangFu_hit.put("002459", "晶澳科技");//386	光伏设备     7.54	1314.63	0.94	价格区间: 5日:96.97 	10日:96.97 	20日:60.57 	30日:40.37 	60日:43.27 	120日:37.55 	250日:74.18 		,当前价：82.16	,当前：2022-04-18 11:14:28
        guangFu_hit.put("603396", "金辰股份");//338	光伏设备     2.93	65.47	0.68	价格区间: 5日:79.13 	10日:29.64 	20日:16.63 	30日:10.68 	60日:9.66  	120日:3.21  	250日:16.36 		,当前价：56.3	,当前：2022-04-18 11:14:30
        guangFu_hit.put("601615", "明阳智能");//283	风电设备     1.15	481.45	1.04	价格区间: 5日:34.77 	10日:48.30 	20日:36.62 	30日:22.29 	60日:22.29 	120日:10.55 	250日:40.08 		,当前价：22.88	,当前：2022-04-18 11:14:31
        guangFu_hit.put("002610", "爱康科技");//275	光伏设备     1.22	148.27	0.48	价格区间: 5日:45.45 	10日:20.41 	20日:13.33 	30日:7.69  	60日:7.30  	120日:3.40  	250日:29.35 		,当前价：3.31	,当前：2022-04-18 11:14:32
    }
    /**
     * guangFu 光伏
     */
    public static Map<String, String> guangFu = new HashMap<>();

    static {
        guangFu.putAll(guangFu_hit);//HIT电池
    }

    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(xinPian);//芯片
        all.putAll(shuZi);//数字经济：数字货币,电子身份证
        all.putAll(dianLi);//电力：抽水蓄能
        all.putAll(xinNengYuan);//新能源
        all.putAll(chuanMei);//传媒
        all.putAll(youXi);//游戏
        all.putAll(junGong);//军工
        all.putAll(gongYe);//工业
        all.putAll(zhiNeng);//智能
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(all, date);// all  shuZi
//        StockStatDemo.checkMaDemo(xinPian, date);//
    }
}
