package utils;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：医疗
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStYiLiao {

    /**
     * ganSuGaiNian ["肝素概念"]：9;
     */
    public static Map<String, String> ganSuGaiNian = new HashMap<>();

    static {
        ganSuGaiNian.put("600196", "复星医药");//329	化学制药	2.22	1323.99	1.75	价格区间: 5日:34.80 	10日:63.07 	20日:66.70 	30日:66.70 	60日:66.70 	120日:65.43 	250日:27.88 		,当前价：51.66	,当前：2022-03-24 10:56:16
        ganSuGaiNian.put("002550", "千红制药");//329	化学制药	-1.01	75.64	1.27	价格区间: 5日:28.95 	10日:17.89 	20日:56.84 	30日:56.84 	60日:38.82 	120日:43.11 	250日:47.58 		,当前价：5.91	,当前：2022-03-24 10:56:18
    }

    /**
     * chaoJiZhenJun ["超级真菌"]：11;
     */
    public static Map<String, String> chaoJiZhenJun = new HashMap<>();

    static {
        chaoJiZhenJun.put("002435", "长江健康");//372	化学制药	-1.55	86.52	0.95	价格区间: 5日:26.71 	10日:12.62 	20日:48.77 	30日:52.38 	60日:53.37 	120日:53.37 	250日:53.37 		,当前价：7.0	,当前：2022-03-24 11:02:11
        chaoJiZhenJun.put("002581", "未名医药");//320	生物制品	-0.51	116.64	0.96	价格区间: 5日:57.50 	10日:47.54 	20日:60.98 	30日:60.98 	60日:33.24 	120日:37.04 	250日:55.90 		,当前价：17.68	,当前：2022-03-24 11:02:12
        chaoJiZhenJun.put("600521", "华海药业");//295	化学制药	-0.67	332.66	0.65	价格区间: 5日:9.95  	10日:7.18  	20日:24.10 	30日:38.01 	60日:38.01 	120日:51.91 	250日:56.74 		,当前价：22.3	,当前：2022-03-24 11:02:14
    }

    /**
     * zhongYaoGaiNian ["中药概念"]：80;
     */
    public static Map<String, String> zhongYaoGaiNian = new HashMap<>();

    static {
        zhongYaoGaiNian.put("002349", "精华制药");//517	中药    	8.51	163.98	8.61	价格区间: 5日:96.05 	10日:96.97 	20日:96.97 	30日:97.15 	60日:86.22 	120日:86.76 	250日:87.42 		,当前价：20.14	,当前：2022-03-21 10:15:41
        zhongYaoGaiNian.put("002326", "永太科技");//413	化学制品	5.14	284.88	7.78	价格区间: 5日:100.00	10日:100.00	20日:59.75 	30日:59.75 	60日:25.31 	120日:14.07 	250日:35.04 		,当前价：32.5	,当前：2022-03-21 10:15:43
        zhongYaoGaiNian.put("002317", "众生药业");//395	中药    	10.03	133.08	12.97	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：16.34	,当前：2022-03-21 10:15:44
        zhongYaoGaiNian.put("002435", "长江健康");//384	化学制药	-5.12	89.24	3.51	价格区间: 5日:3.43  	10日:35.06 	20日:48.31 	30日:52.17 	60日:52.33 	120日:52.33 	250日:53.30 		,当前价：7.22	,当前：2022-03-21 10:15:45
        zhongYaoGaiNian.put("002411", "延安必康");//365	医药商业	0.3 	155.07	5.37	价格区间: 5日:94.58 	10日:95.19 	20日:81.28 	30日:81.28 	60日:44.35 	120日:24.73 	250日:44.05 		,当前价：10.12	,当前：2022-03-21 10:15:46
        zhongYaoGaiNian.put("600976", "健民集团");//355	中药    	2.57	85.60	4.15	价格区间: 5日:78.19 	10日:42.50 	20日:37.19 	30日:21.80 	60日:14.66 	120日:33.59 	250日:50.78 		,当前价：55.8	,当前：2022-03-21 10:15:48
        zhongYaoGaiNian.put("600587", "新华医疗");//354	医疗器械	0.75	111.23	5.36	价格区间: 5日:79.09 	10日:81.75 	20日:81.75 	30日:81.75 	60日:43.08 	120日:51.47 	250日:57.83 		,当前价：27.0	,当前：2022-03-21 10:15:49
        zhongYaoGaiNian.put("002603", "以岭药业");//346	中药    	3.11	526.94	3.73	价格区间: 5日:64.27 	10日:82.58 	20日:82.58 	30日:84.57 	60日:88.48 	120日:89.36 	250日:90.09 		,当前价：31.54	,当前：2022-03-21 10:15:50
        zhongYaoGaiNian.put("600381", "青海春天");//340	食品饮料	9.85	102.15	9.84	价格区间: 5日:71.19 	10日:76.22 	20日:80.77 	30日:82.00 	60日:83.51 	120日:84.36 	250日:85.25 		,当前价：17.4	,当前：2022-03-21 10:15:51
        zhongYaoGaiNian.put("600771", "广誉远  ");//339	中药    	1.18	159.85	2.53	价格区间: 5日:75.99 	10日:63.30 	20日:43.18 	30日:46.32 	60日:17.94 	120日:24.52 	250日:42.82 		,当前价：32.49	,当前：2022-03-21 10:15:52
//        ["独家药品"]：25;
//        mapGn.put("600976", "健民集团");//399	中药    	4.98	99.31	14.76	价格区间: 5日:99.84 	10日:99.87 	20日:99.87 	30日:61.23 	60日:41.17 	120日:54.01 	250日:65.79 		,当前价：64.74	,当前：2022-03-23 10:53:31
//        mapGn.put("600771", "广誉远  ");//352	中药    	7.03	164.13	2.55	价格区间: 5日:100.00	10日:100.00	20日:77.81 	30日:77.81 	60日:30.61 	120日:36.18 	250日:48.81 		,当前价：33.36	,当前：2022-03-23 10:53:33
//        mapGn.put("002603", "以岭药业");//339	中药    	2.22	491.35	2.75	价格区间: 5日:43.97 	10日:72.54 	20日:76.28 	30日:77.43 	60日:83.79 	120日:85.50 	250日:86.37 		,当前价：29.41	,当前：2022-03-23 10:53:34
    }

    /**
     * ["新冠药物"]：9;
     */
    public static Map<String, String> xinGuanYaoWu = new HashMap<>();

    static {
        xinGuanYaoWu.put("002349", "精华制药");//474	中药    	-4.27	131.49	6.69	价格区间: 5日:75.98 	10日:84.56 	20日:84.56 	30日:85.92 	60日:64.76 	120日:65.90 	250日:67.58 		,当前价：16.15	,当前：2022-03-18 10:52:29
        xinGuanYaoWu.put("002603", "以岭药业");//345	中药    	0.46	509.73	5.76	价格区间: 5日:74.54 	10日:87.59 	20日:87.59 	30日:89.21 	60日:91.90 	120日:92.42 	250日:92.93 		,当前价：30.51	,当前：2022-03-18 10:52:30
        xinGuanYaoWu.put("600196", "复星医药");//307	化学制药	2.68	1295.29	11.61	价格区间: 5日:81.78 	10日:87.66 	20日:87.66 	30日:87.66 	60日:86.91 	120日:54.47 	250日:27.07 		,当前价：50.54	,当前：2022-03-18 10:52:32
        xinGuanYaoWu.put("002584", "西陇科学");//297	电子化学品	-3.86	62.68	3.77	价格区间: 5日:45.56 	10日:67.44 	20日:72.24 	30日:73.37 	60日:57.03 	120日:65.43 	250日:67.59 		,当前价：10.71	,当前：2022-03-18 10:52:33
        xinGuanYaoWu.put("600668", "尖峰集团");//285	水泥建材	-2.53	71.64	3.88	价格区间: 5日:38.07 	10日:41.14 	20日:52.32 	30日:52.10 	60日:66.95 	120日:70.66 	250日:71.69 		,当前价：20.82	,当前：2022-03-18 10:52:34
    }

    /**
     * mapYiLiaoXinGuanJianCe 概念：["新冠检测"];股票个数：15;
     */
    public static Map<String, String> xinGuanJianCe = new HashMap<>();

    static {
        xinGuanJianCe.put("002432", "九安医疗");//575	医疗器械	10   	284.19	1.66	价格区间: 5日:100.00	10日:69.31 	20日:51.38 	30日:51.38 	60日:58.16 	120日:64.49 	250日:64.49 		,当前价：59.38	,当前：2022-03-11 13:51:13
        xinGuanJianCe.put("002932", "明德生物");//377	医疗器械	10   	99.88	5.46	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:46.32 	120日:55.00 	250日:65.00 		,当前价：95.23	,当前：2022-03-11 13:51:15
        xinGuanJianCe.put("002584", "西陇科学");//297	电子化学品	6.8 	64.37	2.48	价格区间: 5日:87.82 	10日:87.82 	20日:90.49 	30日:90.49 	60日:57.95 	120日:66.05 	250日:68.17 		,当前价：11.0	,当前：2022-03-11 13:51:16
        xinGuanJianCe.put("603392", "万泰生物");//296	医疗器械	1.96	1532.17	1.7 	价格区间: 5日:82.19 	10日:73.06 	20日:91.33 	30日:91.33 	60日:92.18 	120日:88.09 	250日:69.31 		,当前价：252.4	,当前：2022-03-11 13:51:17
    }

    /**
     * changShouYao ["长寿药"]：7;
     */
    public static Map<String, String> changShouYao = new HashMap<>();

    static {
        changShouYao.put("002317", "众生药业");//322	中药    	2.67	112.88	2.96	价格区间: 5日:55.23 	10日:80.56 	20日:83.22 	30日:84.35 	60日:68.53 	120日:75.13 	250日:76.27 		,当前价：13.86	,当前：2022-03-18 11:21:47
        changShouYao.put("002626", "金达威  ");//218	食品饮料	9.99	190.06	3.25	价格区间: 5日:100.00	10日:61.78 	20日:61.78 	30日:61.78 	60日:61.78 	120日:57.21 	250日:18.99 		,当前价：30.83	,当前：2022-03-18 11:21:50
//        changShouYao.put("600298", "安琪酵母");//177	食品饮料	-0.09	366.96	1.29	价格区间: 5日:58.31 	10日:58.45 	20日:19.09 	30日:16.19 	60日:12.68 	120日:12.68 	250日:18.03 		,当前价：44.06	,当前：2022-03-18 11:21:51
    }

    /**
     * mapYiLiaoXinGuanAll 医疗-新冠-汇总:概念：["新冠药物","新冠检测","体外诊断"];股票个数：29;
     */
    public static Map<String, String> mapYiLiaoXinGuanAll = new HashMap<>();

    static {
        mapYiLiaoXinGuanAll.putAll(xinGuanYaoWu);
        mapYiLiaoXinGuanAll.putAll(xinGuanJianCe);
    }

    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(changShouYao);
        all.putAll(zhongYaoGaiNian);
        all.putAll(xinGuanYaoWu);
        all.putAll(xinGuanJianCe);
        all.putAll(ganSuGaiNian);//肝素概念
        all.putAll(chaoJiZhenJun);//超级真菌
    }
}
