package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：消费
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStXiaoFei {

    /**
     * guiJinShu_peiYuZuanShi ["培育钻石"]：4;
     */
    public static Map<String, String> guiJinShu_peiYuZuanShi = new HashMap<>();

    static {
        guiJinShu_peiYuZuanShi.put("600172", "黄河旋风");//386	非金属材料	1.76	133.26	4.64	价格区间: 5日:97.95 	10日:97.95 	20日:98.20 	30日:64.57 	60日:73.21 	120日:44.97 	250日:68.90 		,当前价：9.24	,当前：2022-04-01 10:18:30
        guiJinShu_peiYuZuanShi.put("000519", "中兵红箭");//385	专用设备	3.91	325.58	8.19	价格区间: 5日:89.29 	10日:89.60 	20日:93.67 	30日:93.38 	60日:62.92 	120日:42.56 	250日:63.69 		,当前价：23.38	,当前：2022-04-01 10:18:31
    }

    /**
     * jiuShui_baiJiu ["白酒"]：37;
     */
    public static Map<String, String> jiuShui_baiJiu = new HashMap<>();

    static {
        jiuShui_baiJiu.put("600199", "金种子酒");//400	酿酒行业	3.38	167.21	3.43	价格区间: 5日:80.23 	10日:29.68 	20日:26.26 	30日:41.55 	60日:61.33 	120日:61.33 	250日:62.49 		,当前价：25.42	,当前：2022-04-01 11:18:27
        jiuShui_baiJiu.put("600381", "青海春天");//367	食品饮料	6.27	97.45	5.6 	价格区间: 5日:85.46 	10日:80.50 	20日:87.63 	30日:89.63 	60日:91.10 	120日:91.56 	250日:92.04 		,当前价：16.6	,当前：2022-04-01 11:18:29
        jiuShui_baiJiu.put("600771", "广誉远  ");//364	中药    	-0.97	170.28	2.42	价格区间: 5日:19.09 	10日:51.50 	20日:60.53 	30日:60.53 	60日:34.84 	120日:37.54 	250日:48.68 		,当前价：34.61	,当前：2022-04-01 11:18:30
        jiuShui_baiJiu.put("600702", "舍得酒业");//331	酿酒行业	4.2 	549.84	2.16	价格区间: 5日:93.67 	10日:47.63 	20日:32.75 	30日:28.33 	60日:17.77 	120日:12.49 	250日:50.38 		,当前价：165.58	,当前：2022-04-01 11:18:32
        jiuShui_baiJiu.put("600238", "海南椰岛");//318	酿酒行业	4.34	57.15	2.54	价格区间: 5日:57.45 	10日:29.83 	20日:35.77 	30日:26.12 	60日:13.46 	120日:8.27  	250日:17.31 		,当前价：12.75	,当前：2022-04-01 11:18:33
        jiuShui_baiJiu.put("600519", "贵州茅台");//189	酿酒行业	3.43	22335.20 1.91   价格区间: 5日:99.57 	10日:99.57 	20日:86.93 	30日:63.14 	60日:41.29 	120日:31.76 	250日:34.27 		,当前价：1778.0	,当前：2022-04-01 11:18:58
    }
    /**
     * shiPin_tiaoWeiPin ["调味品概念"]：19;
     */
    public static Map<String, String> shiPin_tiaoWeiPin = new HashMap<>();

    static {
        shiPin_tiaoWeiPin.put("002053", "云南能投");//374	化学原料	2.03	103.04	1.23	价格区间: 5日:18.60 	10日:5.13  	20日:35.20 	30日:35.37 	60日:39.54 	120日:42.72 	250日:47.63 		,当前价：13.54	,当前：2022-03-30 14:19:50
        shiPin_tiaoWeiPin.put("000505", "京粮控股");//332	农牧饲渔	4   	96.39	6.56	价格区间: 5日:86.45 	10日:88.53 	20日:89.44 	30日:89.44 	60日:90.03 	120日:90.07 	250日:90.07 		,当前价：13.26	,当前：2022-03-30 14:19:52
        shiPin_tiaoWeiPin.put("600328", "中盐化工");//299	化学原料	4.21	161.08	2.34	价格区间: 5日:94.71 	10日:95.65 	20日:75.16 	30日:73.55 	60日:73.55 	120日:33.63 	250日:39.60 		,当前价：16.82	,当前：2022-03-30 14:19:53
//        shiPin_tiaoWeiPin.put("002539", "云图控股");//284	化肥行业	-0.73	137.88	2.65	价格区间: 5日:78.81 	10日:82.42 	20日:69.09 	30日:65.29 	60日:61.29 	120日:31.96 	250日:35.96 		,当前价：13.65	,当前：2022-03-30 14:19:54
//        shiPin_tiaoWeiPin.put("002597", "金禾实业");//271	食品饮料	0.45	223.75	1.05	价格区间: 5日:55.03 	10日:59.75 	20日:81.89 	30日:73.46 	60日:35.56 	120日:33.73 	250日:45.23 		,当前价：39.89	,当前：2022-03-30 14:19:56
//        shiPin_tiaoWeiPin.put("600251", "冠农股份");//268	农牧饲渔	-5.79	78.85	2.44	价格区间: 5日:14.29 	10日:36.25 	20日:42.29 	30日:55.89 	60日:63.31 	120日:63.31 	250日:60.00 		,当前价：10.09	,当前：2022-03-30 14:19:57
//        shiPin_tiaoWeiPin.put("002568", "百润股份");//250	酿酒行业	7.38	276.61	2.41	价格区间: 5日:71.47 	10日:52.92 	20日:29.29 	30日:24.46 	60日:11.16 	120日:8.40  	250日:5.46  		,当前价：36.83	,当前：2022-03-30 14:19:57
    }
    /**
     * nongYe_linHuaGong ["磷化工"]：26;
     */
    public static Map<String, String> nongYe_linHuaGong = new HashMap<>();

    static {
        nongYe_linHuaGong.put("000422", "湖北宜化");//472	化学原料	3.4 	188.64	3.33	价格区间: 5日:85.40 	10日:87.79 	20日:91.06 	30日:84.93 	60日:85.93 	120日:27.81 	250日:57.07 		,当前价：21.01	,当前：2022-04-01 11:08:51
        nongYe_linHuaGong.put("600096", "云天化  ");//443	化肥行业	2.64	477.70	3.85	价格区间: 5日:63.01 	10日:69.02 	20日:73.97 	30日:79.63 	60日:87.03 	120日:64.91 	250日:63.67 		,当前价：26.02	,当前：2022-04-01 11:08:52
        nongYe_linHuaGong.put("600141", "兴发集团");//360	化肥行业	1.53	375.10	1.85	价格区间: 5日:35.18 	10日:33.60 	20日:18.54 	30日:14.35 	60日:35.82 	120日:17.78 	250日:46.24 		,当前价：33.74	,当前：2022-04-01 11:08:53
        nongYe_linHuaGong.put("002895", "川恒股份");//357	化肥行业	2.58	104.91	3.5 	价格区间: 5日:31.33 	10日:31.33 	20日:35.67 	30日:23.15 	60日:22.85 	120日:7.19  	250日:28.16 		,当前价：21.48	,当前：2022-04-01 11:08:55
        nongYe_linHuaGong.put("600596", "新安股份");//331	农药兽药	3.39	221.87	2   	价格区间: 5日:44.01 	10日:44.01 	20日:64.18 	30日:64.05 	60日:76.20 	120日:46.13 	250日:44.08 		,当前价：27.11	,当前：2022-04-01 11:08:56
    }

    /**
     * nongYe_shuiChanYangZhi ["水产养殖"]：6;
     */
    public static Map<String, String> nongYe_shuiChanYangZhi = new HashMap<>();

    static {
        nongYe_shuiChanYangZhi.put("001313", "粤海饲料");//280	农牧饲渔	-1.86	110.81	1.35	价格区间: 5日:14.32 	10日:27.13 	20日:35.62 	30日:60.74 	60日:66.52 	120日:66.52 	250日:66.52 		,当前价：15.83	,当前：2022-03-30 14:48:56
        nongYe_shuiChanYangZhi.put("002385", "大北农  ");//275	农牧饲渔	0   	360.71	2.9 	价格区间: 5日:80.87 	10日:84.51 	20日:75.62 	30日:75.62 	60日:38.58 	120日:36.71 	250日:46.09 		,当前价：8.71	,当前：2022-03-30 14:48:57
        nongYe_shuiChanYangZhi.put("600438", "通威股份");//264	光伏设备	2.02	2002.29	1.58	价格区间: 5日:94.81 	10日:66.48 	20日:67.89 	30日:79.17 	60日:82.62 	120日:39.52 	250日:46.48 		,当前价：44.48	,当前：2022-03-30 14:48:58
    }
    /**
     * 农业-转基因 ["转基因"]：8;
     */
    public static Map<String, String> nongYe_zhuanJiYin = new HashMap<>();
    static {
        nongYe_zhuanJiYin.put("600313", "农发种业");//325	农牧饲渔	6.43	89.61	21.97	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：8.28	,当前：2022-03-31 10:21:08
        nongYe_zhuanJiYin.put("600596", "新安股份");//321	农药兽药	-2.59	221.78	2.41	价格区间: 5日:6.69  	10日:39.69 	20日:54.60 	30日:54.49 	60日:69.87 	120日:42.30 	250日:42.70 		,当前价：27.1	,当前：2022-03-31 10:21:09
        nongYe_zhuanJiYin.put("002385", "大北农  ");//273	农牧饲渔	0.46	361.53	3.98	价格区间: 5日:93.04 	10日:94.33 	20日:82.59 	30日:82.59 	60日:42.13 	120日:40.10 	250日:48.97 		,当前价：8.73	,当前：2022-03-31 10:21:11
        nongYe_zhuanJiYin.put("002100", "天康生物");//271	农牧饲渔	-3.02	165.17	2.36	价格区间: 5日:31.78 	10日:58.69 	20日:70.67 	30日:70.67 	60日:72.06 	120日:82.91 	250日:85.92 		,当前价：12.2	,当前：2022-03-31 10:21:12
        nongYe_zhuanJiYin.put("002041", "登海种业");//268	农牧饲渔	-0.13	210.67	3.21	价格区间: 5日:71.43 	10日:83.94 	20日:86.71 	30日:86.71 	60日:69.54 	120日:55.08 	250日:68.87 		,当前价：23.94	,当前：2022-03-31 10:21:13
    }

    /**
     * nongYe_caoGanLin ["草甘膦"]：10;
     */
    public static Map<String, String> nongYe_caoGanLin = new HashMap<>();

    static {
        nongYe_caoGanLin.put("600141", "兴发集团");//354	化肥行业	0.87	372.65	1.85	价格区间: 5日:28.25 	10日:26.98 	20日:14.89 	30日:11.53 	60日:33.70 	120日:16.73 	250日:45.69 		,当前价：33.52	,当前：2022-04-01 09:55:34
        nongYe_caoGanLin.put("600389", "江山股份");//349	农药兽药	0.28	136.41	2.07	价格区间: 5日:90.60 	10日:93.79 	20日:96.44 	30日:86.19 	60日:73.81 	120日:77.48 	250日:58.35 		,当前价：45.93	,当前：2022-04-01 09:55:36
        nongYe_caoGanLin.put("600596", "新安股份");//325	农药兽药	1.18	217.12	2   	价格区间: 5日:28.74 	10日:28.74 	20日:54.41 	30日:54.30 	60日:69.75 	120日:42.22 	250日:42.67 		,当前价：26.53	,当前：2022-04-01 09:55:37
    }

    /**
     * nongYe_zhuRou ["猪肉概念"]：26;
     */
    public static Map<String, String> nongYe_zhuRou = new HashMap<>();

    static {
        nongYe_zhuRou.put("603363", "傲农生物");//412	农牧饲渔	2.86	167.54	3.16	价格区间: 5日:64.31 	10日:77.10 	20日:85.91 	30日:85.91 	60日:90.66 	120日:92.61 	250日:92.96 		,当前价：24.48	,当前：2022-04-01 11:02:10
        nongYe_zhuRou.put("603477", "巨星农牧");//404	农牧饲渔	4.05	135.13	2.07	价格区间: 5日:66.58 	10日:78.93 	20日:86.74 	30日:86.74 	60日:90.72 	120日:92.65 	250日:93.55 		,当前价：26.7	,当前：2022-04-01 11:02:11
        nongYe_zhuRou.put("002124", "天邦股份");//271	农牧饲渔	0.57	162.03	2.21	价格区间: 5日:83.05 	10日:87.74 	20日:90.56 	30日:90.56 	60日:90.59 	120日:90.62 	250日:53.16 		,当前价：8.81	,当前：2022-04-01 11:02:13
        nongYe_zhuRou.put("002385", "大北农  ");//270	农牧饲渔	0.92	363.60	4   	价格区间: 5日:90.91 	10日:93.18 	20日:90.96 	30日:85.07 	60日:43.40 	120日:41.30 	250日:50.00 		,当前价：8.78	,当前：2022-04-01 11:02:14
        nongYe_zhuRou.put("002100", "天康生物");//264	农牧饲渔	0.25	165.17	1.96	价格区间: 5日:49.28 	10日:53.95 	20日:76.67 	30日:76.67 	60日:77.46 	120日:86.21 	250日:88.64 		,当前价：12.2	,当前：2022-04-01 11:02:15
        nongYe_zhuRou.put("002505", "鹏都农牧");//252	贸易行业	0.29	216.72	1.26	价格区间: 5日:9.68  	10日:6.52  	20日:39.44 	30日:39.44 	60日:31.96 	120日:45.13 	250日:55.42 		,当前价：3.4	,当前：2022-04-01 11:02:17
        nongYe_zhuRou.put("000876", "新希望  ");//248	农牧饲渔	1.18	774.00	2.08	价格区间: 5日:87.86 	10日:93.00 	20日:95.77 	30日:95.77 	60日:75.64 	120日:77.21 	250日:66.47 		,当前价：17.18	,当前：2022-04-01 11:02:18
    }
    /**
     * nongYe_jiRou ["鸡肉概念"]：13;
     */
    public static Map<String, String> nongYe_jiRou = new HashMap<>();

    static {
        nongYe_jiRou.put("603477", "巨星农牧");//398	农牧饲渔	-2.24	130.07	6.59	价格区间: 5日:18.11 	10日:61.40 	20日:67.07 	30日:67.07 	60日:76.96 	120日:81.75 	250日:83.98 		,当前价：25.7	,当前：2022-03-31 10:40:30
        nongYe_jiRou.put("002100", "天康生物");//271	农牧饲渔	-1.99	166.93	2.36	价格区间: 5日:27.13 	10日:55.87 	20日:68.67 	30日:68.67 	60日:70.16 	120日:81.75 	250日:84.96 		,当前价：12.33	,当前：2022-03-31 10:40:32
        nongYe_jiRou.put("002746", "仙坛股份");//254	农牧饲渔	7.14	85.28	1.47	价格区间: 5日:73.15 	10日:73.15 	20日:84.57 	30日:66.67 	60日:43.48 	120日:60.08 	250日:60.90 		,当前价：9.91	,当前：2022-03-31 10:40:33
        nongYe_jiRou.put("000876", "新希望  ");//251	农牧饲渔	0.12	771.29	4.29	价格区间: 5日:64.29 	10日:82.58 	20日:87.56 	30日:87.56 	60日:69.16 	120日:71.14 	250日:60.50 		,当前价：17.12	,当前：2022-03-31 10:40:34
        nongYe_jiRou.put("002567", "唐人神  ");//248	农牧饲渔	-3.8	128.20	3.09	价格区间: 5日:35.66 	10日:66.40 	20日:73.40 	30日:73.40 	60日:80.24 	120日:84.62 	250日:85.42 		,当前价：10.63	,当前：2022-03-31 10:40:36
    }

    /**
     * ["在线旅游"]：8;
     */
    public static Map<String, String> lvYou_zaiXianLvYou = new HashMap<>();

    static {
        lvYou_zaiXianLvYou.put("000524", "岭南控股");//352	旅游酒店	10   	84.04	12.97	价格区间: 5日:100.00	10日:38.74 	20日:54.48 	30日:56.76 	60日:63.57 	120日:67.16 	250日:67.16 		,当前价：12.54	,当前：2022-04-01 10:00:19
        lvYou_zaiXianLvYou.put("000796", "凯撒旅业");//309	旅游酒店	2.28	82.71	6.1 	价格区间: 5日:86.36 	10日:44.44 	20日:64.02 	30日:67.13 	60日:68.48 	120日:72.09 	250日:73.08 		,当前价：10.3	,当前：2022-04-01 10:00:21
        lvYou_zaiXianLvYou.put("002707", "众信旅游");//265	旅游酒店	1.78	67.43	4.54	价格区间: 5日:88.31 	10日:72.34 	20日:87.25 	30日:87.25 	60日:63.92 	120日:72.13 	250日:75.48 		,当前价：7.44	,当前：2022-04-01 10:00:22
        lvYou_zaiXianLvYou.put("600258", "首旅酒店");//250	旅游酒店	1.22	260.16	4   	价格区间: 5日:75.00 	10日:42.11 	20日:42.42 	30日:36.61 	60日:32.45 	120日:33.21 	250日:48.04 		,当前价：23.2	,当前：2022-04-01 10:00:24
//        lvYou_zaiXianLvYou.put("600640", "新国脉  ");//247	文化传媒	-1.35	87.53	2.77	价格区间: 5日:92.31 	10日:93.42 	20日:96.48 	30日:62.84 	60日:21.71 	120日:21.20 	250日:21.20 		,当前价：11.0	,当前：2022-04-01 10:00:25
//        lvYou_zaiXianLvYou.put("002244", "滨江集团");//238	房地产开发	-0.87	211.58	2.31	价格区间: 5日:60.32 	10日:60.32 	20日:85.21 	30日:85.21 	60日:90.57 	120日:92.38 	250日:92.60 		,当前价：6.8	,当前：2022-04-01 10:00:26
        lvYou_zaiXianLvYou.put("000069", "华侨城Ａ");//224	房地产开发	-0.82	598.73	2.75	价格区间: 5日:84.92 	10日:86.81 	20日:90.26 	30日:90.26 	60日:61.75 	120日:61.75 	250日:37.77 		,当前价：7.3	,当前：2022-04-01 10:00:28
//        lvYou_zaiXianLvYou.put("600138", "中青旅  ");//184	旅游酒店	3.93	91.78	9.66	价格区间: 5日:97.67 	10日:97.67 	20日:98.52 	30日:98.52 	60日:81.53 	120日:85.24 	250日:85.50 		,当前价：12.68	,当前：2022-04-01 10:00:29
    }

    /**
     * lvYou_mianShui ["免税概念"]：22;
     */
    public static Map<String, String> lvYou_mianShui = new HashMap<>();

    static {
        lvYou_mianShui.put("600338", "西藏珠峰");//373	有色金属	-0.08	241.63	2.19	价格区间: 5日:32.39 	10日:17.32 	20日:13.40 	30日:7.76  	60日:6.49  	120日:5.55  	250日:40.92 		,当前价：26.43	,当前：2022-04-01 10:34:10
        lvYou_mianShui.put("000524", "岭南控股");//352	旅游酒店	10   	84.04	12.97	价格区间: 5日:100.00	10日:38.74 	20日:54.48 	30日:56.76 	60日:63.57 	120日:67.16 	250日:67.16 		,当前价：12.54	,当前：2022-04-01 10:34:12
        lvYou_mianShui.put("000796", "凯撒旅业");//315	旅游酒店	4.27	84.32	6.1 	价格区间: 5日:80.77 	10日:61.40 	20日:75.00 	30日:77.16 	60日:75.06 	120日:77.91 	250日:78.65 		,当前价：10.5	,当前：2022-04-01 10:34:13
        lvYou_mianShui.put("002707", "众信旅游");//271	旅游酒店	4.92	69.52	4.54	价格区间: 5日:86.36 	10日:80.85 	20日:91.18 	30日:91.18 	60日:66.46 	120日:74.08 	250日:77.20 		,当前价：7.67	,当前：2022-04-01 10:34:14
        lvYou_mianShui.put("000861", "海印股份");//235	综合行业	3.71	84.42	2.45	价格区间: 5日:59.26 	10日:55.26 	20日:83.65 	30日:83.65 	60日:86.82 	120日:90.66 	250日:91.41 		,当前价：3.63	,当前：2022-04-01 10:34:15
        lvYou_mianShui.put("601888", "中国中免");//229	旅游酒店	6.68	3423.67	2.52	价格区间: 5日:84.86 	10日:83.02 	20日:39.79 	30日:26.17 	60日:22.09 	120日:13.60 	250日:8.74  		,当前价：175.35	,当前：2022-04-01 10:34:16
        lvYou_mianShui.put("001979", "招商蛇口");//226	房地产开发	-0.92	1190.07	2.48	价格区间: 5日:53.85 	10日:74.47 	20日:82.91 	30日:82.91 	60日:82.91 	120日:90.24 	250日:90.74 		,当前价：15.02	,当前：2022-04-01 10:34:17
        lvYou_mianShui.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:93.10 	10日:63.82 	20日:55.02 	30日:45.82 	60日:38.39 	120日:47.75 	250日:54.33 		,当前价：50.49	,当前：2022-04-01 10:34:19
        lvYou_mianShui.put("600018", "上港集团");//193	航运港口	10.05	1401.38	25.96	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:91.58 	60日:81.31 	120日:84.80 	250日:82.30 		,当前价：6.02	,当前：2022-04-01 10:34:20
        lvYou_mianShui.put("002163", "海南发展");//190	玻璃玻纤	9.96	86.94	6.84	价格区间: 5日:100.00	10日:100.00	20日:73.89 	30日:56.23 	60日:43.72 	120日:30.47 	250日:12.80 		,当前价：10.82	,当前：2022-04-01 10:34:21
//        lvYou_mianShui.put("000564", "*ST大集 ");//181	商业百货	-1.02	185.89	8.38	价格区间: 5日:23.08 	10日:20.00 	20日:12.00 	30日:9.09  	60日:3.90  	120日:0.74  	250日:0.74  		,当前价：0.97	,当前：2022-04-01 10:34:22
//        lvYou_mianShui.put("600029", "南方航空");//177	航空机场	2.75	1077.92	2.04	价格区间: 5日:55.36 	10日:43.06 	20日:39.37 	30日:33.78 	60日:23.47 	120日:23.47 	250日:44.56 		,当前价：6.36	,当前：2022-04-01 10:34:23
//        lvYou_mianShui.put("600515", "*ST基础 ");//175	房地产开发	3.93	422.74	11.33	价格区间: 5日:86.11 	10日:86.11 	20日:47.89 	30日:44.74 	60日:26.15 	120日:4.10  	250日:3.31  		,当前价：3.7	,当前：2022-04-01 10:34:23
        lvYou_mianShui.put("600859", "王府井  ");//172	商业百货	9.99	258.29	3.1 	价格区间: 5日:100.00	10日:100.00	20日:53.99 	30日:34.48 	60日:30.34 	120日:21.30 	250日:18.99 		,当前价：22.8	,当前：2022-04-01 10:34:25
    }

    /**
     * lvYou_hangKongJiChang 航空机场
     */
    public static Map<String, String> lvYou_hangKongJiChang = new HashMap<>();

    static {
        lvYou_hangKongJiChang.put("600004", "白云机场");//230	航空机场	3.84	301.05	2.56	价格区间: 5日:90.43 	10日:65.82 	20日:71.43 	30日:51.24 	60日:42.75 	120日:50.89 	250日:67.11 		,当前价：12.72	,当前：2022-04-01 11:39:04
        lvYou_hangKongJiChang.put("601111", "中国国航");//224	航空机场	4.94	1388.57	2.28	价格区间: 5日:87.50 	10日:73.04 	20日:73.82 	30日:62.95 	60日:46.23 	120日:55.91 	250日:68.16 		,当前价：9.56	,当前：2022-04-01 11:39:05
        lvYou_hangKongJiChang.put("002928", "华夏航空");//223	航空机场	1.36	105.72	2.56	价格区间: 5日:43.75 	10日:37.23 	20日:32.84 	30日:18.23 	60日:14.93 	120日:14.93 	250日:17.28 		,当前价：10.43	,当前：2022-04-01 11:39:07
        lvYou_hangKongJiChang.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:91.75 	10日:66.73 	20日:56.71 	30日:47.23 	60日:39.57 	120日:48.75 	250日:54.94 		,当前价：50.49	,当前：2022-04-01 11:39:08
    }

    /**
     * yuZhiCaiGaiNian ["预制菜概念"]：16;
     */
    public static Map<String, String> yuZhiCaiGaiNian = new HashMap<>();

    static {
        yuZhiCaiGaiNian.put("000524", "岭南控股");//356	旅游酒店	9.98	95.30	47.18	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：14.22	,当前：2022-03-21 10:40:58
        yuZhiCaiGaiNian.put("605089", "味知香  ");//326	食品饮料	6.34	61.68	1.18	价格区间: 5日:85.38 	10日:72.40 	20日:56.38 	30日:44.72 	60日:16.25 	120日:16.25 	250日:20.80 		,当前价：61.68	,当前：2022-03-21 10:40:59
        yuZhiCaiGaiNian.put("600965", "福成股份");//240	农牧饲渔	5.05	56.24	2.4 	价格区间: 5日:90.91 	10日:90.91 	20日:90.91 	30日:90.91 	60日:24.69 	120日:25.43 	250日:37.11 		,当前价：6.87	,当前：2022-03-21 10:41:01
        yuZhiCaiGaiNian.put("000876", "新希望  ");//236	农牧饲渔	2.5 	701.46	1.98	价格区间: 5日:98.17 	10日:58.27 	20日:55.99 	30日:44.51 	60日:42.24 	120日:57.76 	250日:42.92 		,当前价：15.57	,当前：2022-03-21 10:41:02
        yuZhiCaiGaiNian.put("603345", "安井食品");//235	食品饮料	3.12	339.89	3.46	价格区间: 5日:86.65 	10日:86.65 	20日:44.35 	30日:34.64 	60日:15.72 	120日:13.03 	250日:8.52  		,当前价：115.88	,当前：2022-03-21 10:41:03
    }

    /**
     * nongYe 农业
     */
    public static Map<String, String> nongYe = new HashMap<>();

    static {
        nongYe.putAll(nongYe_zhuanJiYin);//农业-转基因
        nongYe.putAll(nongYe_caoGanLin);//农业-草甘膦
        nongYe.putAll(nongYe_shuiChanYangZhi);//农业-水产养殖
        nongYe.putAll(nongYe_linHuaGong);//农业-磷化工
        nongYe.putAll(nongYe_jiRou);//鸡肉概念
        nongYe.putAll(nongYe_zhuRou);//猪肉概念
    }

    /**
     * shiPin 食品
     */
    public static Map<String, String> shiPin = new HashMap<>();

    static {
        shiPin.putAll(shiPin_tiaoWeiPin);
        shiPin.putAll(yuZhiCaiGaiNian);
    }

    /**
     * jiuShui 酒水
     */
    public static Map<String, String> jiuShui = new HashMap<>();

    static {
        jiuShui.putAll(jiuShui_baiJiu);
    }

    /**
     * guiJinShu 贵金属
     */
    public static Map<String, String> guiJinShu = new HashMap<>();

    static {
        guiJinShu.putAll(guiJinShu_peiYuZuanShi);
    }

    /**
     * lvYou 旅游
     */
    public static Map<String, String> lvYou = new HashMap<>();

    static {
        lvYou.putAll(lvYou_zaiXianLvYou);//在线旅游
        lvYou.putAll(lvYou_mianShui);//免税概念
        lvYou.putAll(lvYou_hangKongJiChang);//航空机场
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(nongYe); //农业:转基因,草甘膦,水产养殖,磷化工
        all.putAll(shiPin); //食品
        all.putAll(jiuShui); //酒水
        all.putAll(guiJinShu); //贵金属
        all.putAll(lvYou); //旅游
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.lvYou, date);//all nongYe lvYou
        StockStatDemo.checkMaDemo(ContMapStXiaoFei.all, date);//all nongYe
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.shiPin, date);//
    }
}
