package utils;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：消费
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStXiaoFei {

    /**
     * ["在线旅游"]：8;
     */
    public static Map<String, String> zaiXianLvYou = new HashMap<>();

    static {
        zaiXianLvYou.put("000524", "岭南控股");//328	旅游酒店	10.04	86.66	77.48	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：12.93	,当前：2022-03-18 10:29:08
        zaiXianLvYou.put("000796", "凯撒旅业");//313	旅游酒店	2.63	84.48	13.48	价格区间: 5日:74.00 	10日:78.15 	20日:80.23 	30日:67.03 	60日:74.48 	120日:75.50 	250日:76.35 		,当前价：10.52	,当前：2022-03-18 10:29:10
        zaiXianLvYou.put("600258", "首旅酒店");//256	旅游酒店	0.86	277.77	2.2 	价格区间: 5日:95.47 	10日:64.52 	20日:56.98 	30日:50.51 	60日:50.51 	120日:50.51 	250日:59.71 		,当前价：24.77	,当前：2022-03-18 10:29:11
        zaiXianLvYou.put("002707", "众信旅游");//244	旅游酒店	0.7 	64.80	16.07	价格区间: 5日:81.61 	10日:80.46 	20日:80.46 	30日:47.95 	60日:58.70 	120日:64.07 	250日:67.31 		,当前价：7.15	,当前：2022-03-18 10:29:12
        zaiXianLvYou.put("000069", "华侨城Ａ");//188	房地产开发	-0.31	519.17	2.68	价格区间: 5日:65.05 	10日:45.27 	20日:39.18 	30日:27.35 	60日:23.51 	120日:23.51 	250日:14.38 		,当前价：6.33	,当前：2022-03-18 10:29:17
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(zaiXianLvYou);
    }
}
