package utils;

import ttjj.service.KlineService;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan-业务板块
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStBoard {
    /**
     * meiTanHangYe
     */
    public static Map<String, String> meiTanHangYe = new HashMap<>();

    static {
        meiTanHangYe.put("600546", "山煤国际");//298	煤炭行业     5.8 	278.54	1.16	价格区间: 5日:100.00	10日:69.65 	20日:52.21 	30日:53.21 	60日:63.18 	120日:68.67 	250日:73.14 		,当前价：14.05	,当前：2022-05-04 00:47:36
        meiTanHangYe.put("601666", "平煤股份");//295	煤炭行业     -3.22	333.85	1.21	价格区间: 5日:57.14 	10日:35.42 	20日:23.13 	30日:41.30 	60日:55.38 	120日:61.27 	250日:66.72 		,当前价：14.42	,当前：2022-05-04 00:47:38
        meiTanHangYe.put("000983", "山西焦煤");//291	煤炭行业     -1.13	574.75	1.18	价格区间: 5日:79.45 	10日:64.22 	20日:71.43 	30日:79.07 	60日:85.26 	120日:85.26 	250日:77.61 		,当前价：14.03	,当前：2022-05-04 00:47:41
        meiTanHangYe.put("601699", "潞安环能");//275	煤炭行业     -3.67	463.37	0.97	价格区间: 5日:60.96 	10日:36.70 	20日:29.23 	30日:29.23 	60日:48.07 	120日:53.46 	250日:67.35 		,当前价：15.49	,当前：2022-05-04 00:47:44
        meiTanHangYe.put("000937", "冀中能源");//265	煤炭行业     9.72	267.14	2.22	价格区间: 5日:98.75 	10日:85.41 	20日:63.45 	30日:63.45 	60日:73.62 	120日:73.70 	250日:58.86 		,当前价：7.56	,当前：2022-05-04 00:47:45
        meiTanHangYe.put("600508", "上海能源");//265	煤炭行业     -3.94	111.08	1.11	价格区间: 5日:61.78 	10日:52.83 	20日:74.12 	30日:75.97 	60日:77.12 	120日:77.12 	250日:77.36 		,当前价：15.37	,当前：2022-05-04 00:47:47
        meiTanHangYe.put("600123", "兰花科创");//250	煤炭行业     -0.37	154.34	1.09	价格区间: 5日:81.82 	10日:46.55 	20日:33.78 	30日:49.48 	60日:59.84 	120日:61.87 	250日:73.25 		,当前价：13.51	,当前：2022-05-04 00:47:48
        meiTanHangYe.put("600188", "兖矿能源");//246	煤炭行业     1.82	1718.68	0.89	价格区间: 5日:96.90 	10日:63.11 	20日:41.60 	30日:41.60 	60日:65.74 	120日:68.27 	250日:79.24 		,当前价：34.73	,当前：2022-05-04 00:47:49
        meiTanHangYe.put("600395", "盘江股份");//245	煤炭行业     5.24	176.88	1.18	价格区间: 5日:93.88 	10日:53.91 	20日:36.32 	30日:36.32 	60日:41.97 	120日:41.97 	250日:33.07 		,当前价：8.24	,当前：2022-05-04 00:47:51
        meiTanHangYe.put("601898", "中煤能源");//241	煤炭行业     -0.63	1246.31	1.41	价格区间: 5日:81.76 	10日:64.04 	20日:56.51 	30日:69.76 	60日:73.43 	120日:73.43 	250日:73.43 		,当前价：9.4	,当前：2022-05-04 00:47:52
        meiTanHangYe.put("601001", "晋控煤业");//241	煤炭行业     -2.82	207.37	1.43	价格区间: 5日:68.62 	10日:32.17 	20日:22.20 	30日:21.15 	60日:29.37 	120日:44.59 	250日:59.13 		,当前价：12.39	,当前：2022-05-04 00:47:54
    }

    /**
     * fangDiChanKaiFa ["房地产开发"]：67;
     */
    public static Map<String, String> fangDiChanKaiFa = new HashMap<>();

    static {
        fangDiChanKaiFa.put("000736", "中交地产");//405	房地产开发   10   	176.71	0.85	价格区间: 5日:100.00	10日:86.27 	20日:89.39 	30日:92.81 	60日:92.95 	120日:93.46 	250日:93.46 		,当前价：25.41	,当前：2022-05-03 17:48:24
        fangDiChanKaiFa.put("600657", "信达地产");//329	房地产开发   9.98	188.51	1.02	价格区间: 5日:100.00	10日:64.77 	20日:32.30 	30日:50.47 	60日:52.96 	120日:57.26 	250日:57.26 		,当前价：6.61	,当前：2022-05-03 17:48:25
        fangDiChanKaiFa.put("000620", "新华联  ");//311	房地产开发   3.23	54.62	0.98	价格区间: 5日:79.49 	10日:42.47 	20日:15.50 	30日:15.50 	60日:21.03 	120日:40.96 	250日:40.96 		,当前价：2.88	,当前：2022-05-03 17:48:26
        fangDiChanKaiFa.put("002314", "南山控股");//300	房地产开发   7.09	126.72	1.52	价格区间: 5日:87.50 	10日:68.42 	20日:28.17 	30日:34.28 	60日:38.13 	120日:46.05 	250日:46.05 		,当前价：4.68	,当前：2022-05-03 17:48:28
        fangDiChanKaiFa.put("600510", "黑牡丹  ");//262	房地产开发   2.45	91.93	1.11	价格区间: 5日:63.73 	10日:28.14 	20日:17.33 	30日:7.77  	60日:19.27 	120日:19.27 	250日:25.16 		,当前价：8.78	,当前：2022-05-03 17:48:29
        fangDiChanKaiFa.put("002244", "滨江集团");//260	房地产开发   3.91	256.38	1.51	价格区间: 5日:97.65 	10日:98.03 	20日:98.03 	30日:98.10 	60日:98.58 	120日:99.09 	250日:99.11 		,当前价：8.24	,当前：2022-05-03 17:48:30
        fangDiChanKaiFa.put("000656", "金科股份");//256	房地产开发   10.12	238.15	1.21	价格区间: 5日:87.84 	10日:41.94 	20日:39.63 	30日:39.63 	60日:47.34 	120日:44.06 	250日:28.08 		,当前价：4.46	,当前：2022-05-03 17:48:31
        fangDiChanKaiFa.put("000961", "中南建设");//255	房地产开发   10.03	151.15	1.3 	价格区间: 5日:74.76 	10日:49.68 	20日:42.78 	30日:42.78 	60日:43.72 	120日:41.24 	250日:21.39 		,当前价：3.95	,当前：2022-05-03 17:48:33
        fangDiChanKaiFa.put("600708", "光明地产");//242	房地产开发   4.55	61.51	1.21	价格区间: 5日:73.33 	10日:26.40 	20日:26.40 	30日:26.98 	60日:34.75 	120日:42.50 	250日:42.50 		,当前价：2.76	,当前：2022-05-03 17:48:34
        fangDiChanKaiFa.put("600675", "中华企业");//233	房地产开发   9.88	230.43	1.8 	价格区间: 5日:100.00	10日:43.75 	20日:37.50 	30日:45.03 	60日:50.00 	120日:51.61 	250日:51.83 		,当前价：3.78	,当前：2022-05-03 17:48:35
        fangDiChanKaiFa.put("601155", "新城控股");//227	房地产开发   7.23	627.47	1.59	价格区间: 5日:92.05 	10日:52.76 	20日:36.36 	30日:37.14 	60日:44.91 	120日:44.91 	250日:27.79 		,当前价：27.72	,当前：2022-05-03 17:48:36
        fangDiChanKaiFa.put("000517", "荣安地产");//227	房地产开发   -0.69	91.38	1.26	价格区间: 5日:63.64 	10日:33.33 	20日:16.03 	30日:21.25 	60日:29.61 	120日:34.72 	250日:34.72 		,当前价：2.87	,当前：2022-05-03 17:48:37
        fangDiChanKaiFa.put("600736", "苏州高新");//225	房地产开发   0.97	59.98	1.74	价格区间: 5日:83.08 	10日:43.20 	20日:22.59 	30日:14.48 	60日:20.05 	120日:23.68 	250日:25.81 		,当前价：5.21	,当前：2022-05-03 17:48:38
        fangDiChanKaiFa.put("000671", "阳光城  ");//223	房地产开发   2.38	106.82	1.41	价格区间: 5日:55.81 	10日:41.38 	20日:11.54 	30日:14.02 	60日:23.65 	120日:23.65 	250日:14.36 		,当前价：2.58	,当前：2022-05-03 17:48:39
        fangDiChanKaiFa.put("000011", "深物业A");//218	房地产开发   2.48	71.34	1.8 	价格区间: 5日:96.04 	10日:67.13 	20日:34.28 	30日:34.28 	60日:41.14 	120日:41.14 	250日:41.14 		,当前价：11.97	,当前：2022-05-03 17:48:39
        fangDiChanKaiFa.put("000029", "深深房Ａ");//217	房地产开发   10.05	89.73	1.31	价格区间: 5日:100.00	10日:69.55 	20日:43.94 	30日:43.94 	60日:43.94 	120日:47.20 	250日:49.68 		,当前价：8.87	,当前：2022-05-03 17:48:40
        fangDiChanKaiFa.put("600325", "华发股份");//216	房地产开发   5.83	161.54	3.37	价格区间: 5日:83.77 	10日:82.69 	20日:61.43 	30日:66.53 	60日:71.88 	120日:75.53 	250日:75.53 		,当前价：7.63	,当前：2022-05-03 17:48:41
        fangDiChanKaiFa.put("600162", "香江控股");//216	房地产开发   10.24	76.74	1.81	价格区间: 5日:100.00	10日:68.52 	20日:41.11 	30日:41.11 	60日:41.11 	120日:41.11 	250日:49.52 		,当前价：2.26	,当前：2022-05-03 17:48:42
        fangDiChanKaiFa.put("600048", "保利发展");//213	房地产开发   1.8 	2169.02	1.23	价格区间: 5日:82.69 	10日:59.11 	20日:49.43 	30日:63.18 	60日:71.88 	120日:77.32 	250日:83.78 		,当前价：18.12	,当前：2022-05-03 17:48:43
        fangDiChanKaiFa.put("600622", "光大嘉宝");//213	房地产开发   -0.48	62.69	1.15	价格区间: 5日:62.20 	10日:22.67 	20日:21.34 	30日:40.32 	60日:44.54 	120日:47.19 	250日:47.34 		,当前价：4.18	,当前：2022-05-03 17:48:43
        fangDiChanKaiFa.put("600340", "华夏幸福");//212	房地产开发   2.04	117.41	1.21	价格区间: 5日:57.14 	10日:28.57 	20日:12.83 	30日:14.21 	60日:21.63 	120日:21.63 	250日:10.16 		,当前价：3.0	,当前：2022-05-03 17:48:44
        fangDiChanKaiFa.put("600383", "金地集团");//211	房地产开发   3.33	644.68	1.06	价格区间: 5日:91.84 	10日:52.73 	20日:46.39 	30日:55.30 	60日:68.10 	120日:75.36 	250日:79.66 		,当前价：14.28	,当前：2022-05-03 17:48:45
        fangDiChanKaiFa.put("000965", "天保基建");//211	房地产开发   -2.01	75.80	1.21	价格区间: 5日:68.90 	10日:48.71 	20日:19.62 	30日:41.32 	60日:47.68 	120日:49.84 	250日:50.05 		,当前价：6.83	,当前：2022-05-03 17:48:46
        fangDiChanKaiFa.put("000402", "金融街  ");//208	房地产开发   6.27	192.49	1.77	价格区间: 5日:88.37 	10日:55.88 	20日:48.51 	30日:49.58 	60日:55.51 	120日:55.51 	250日:55.31 		,当前价：6.44	,当前：2022-05-03 17:48:46
        fangDiChanKaiFa.put("600466", "蓝光发展");//204	房地产开发   3.61	52.20	1   	价格区间: 5日:47.83 	10日:25.00 	20日:7.75  	30日:7.75  	60日:7.75  	120日:7.95  	250日:4.18  		,当前价：1.72	,当前：2022-05-03 17:48:47
        fangDiChanKaiFa.put("600639", "浦东金桥");//204	房地产开发   9.99	173.08	2.16	价格区间: 5日:100.00	10日:80.32 	20日:70.56 	30日:70.56 	60日:75.15 	120日:77.66 	250日:77.82 		,当前价：15.42	,当前：2022-05-03 17:48:48
        fangDiChanKaiFa.put("000838", "财信发展");//203	房地产开发   6.05	71.42	0.96	价格区间: 5日:68.32 	10日:32.09 	20日:16.95 	30日:13.02 	60日:13.02 	120日:46.08 	250日:46.46 		,当前价：6.49	,当前：2022-05-03 17:48:49
        fangDiChanKaiFa.put("600007", "中国国贸");//201	房地产开发   0.92	143.64	1.14	价格区间: 5日:85.37 	10日:53.03 	20日:23.10 	30日:25.44 	60日:32.37 	120日:32.37 	250日:15.76 		,当前价：14.26	,当前：2022-05-03 17:48:50
    }

    /**
     * gongChengJianShe
     */
    public static Map<String, String> gongChengJianShe = new HashMap<>();

    static {
        gongChengJianShe.put("002761", "浙江建投");//421	工程建设     10.02	332.51	1.29	价格区间: 5日:100.00	10日:100.00	20日:66.99 	30日:49.24 	60日:68.34 	120日:68.87 	250日:68.97 		,当前价：30.75	,当前：2022-05-03 17:58:54
        gongChengJianShe.put("002941", "新疆交建");//293	工程建设     -0.38	116.88	1.37	价格区间: 5日:69.35 	10日:70.48 	20日:59.79 	30日:61.66 	60日:72.66 	120日:74.59 	250日:76.54 		,当前价：18.12	,当前：2022-05-03 17:58:56
        gongChengJianShe.put("000498", "山东路桥");//287	工程建设     -3.49	163.80	1.65	价格区间: 5日:70.26 	10日:73.85 	20日:73.85 	30日:76.61 	60日:77.64 	120日:83.84 	250日:86.38 		,当前价：10.5	,当前：2022-05-03 17:58:57
        gongChengJianShe.put("601789", "宁波建工");//285	工程建设     1.15	67.16	1.09	价格区间: 5日:83.33 	10日:83.33 	20日:40.49 	30日:27.38 	60日:42.70 	120日:47.33 	250日:48.05 		,当前价：6.18	,当前：2022-05-03 17:58:58
        gongChengJianShe.put("600502", "安徽建工");//281	工程建设     -1.88	108.09	1.21	价格区间: 5日:74.27 	10日:76.34 	20日:71.72 	30日:76.07 	60日:77.95 	120日:82.39 	250日:83.28 		,当前价：6.28	,当前：2022-05-03 17:58:59
        gongChengJianShe.put("002060", "粤水电  ");//265	工程建设     -2.01	87.77	1.31	价格区间: 5日:67.98 	10日:67.98 	20日:29.88 	30日:40.59 	60日:49.56 	120日:49.56 	250日:59.60 		,当前价：7.3	,当前：2022-05-03 17:59:00
        gongChengJianShe.put("002307", "北新路桥");//264	工程建设     -0.53	68.67	1.11	价格区间: 5日:73.73 	10日:73.73 	20日:23.90 	30日:26.91 	60日:35.43 	120日:37.33 	250日:37.33 		,当前价：5.68	,当前：2022-05-03 17:59:01
    }

    /**
     * yinHang ["银行 "]：42;
     */
    public static Map<String, String> yinHang = new HashMap<>();

    static {
        yinHang.put("001227", "兰州银行");//202	银行         1.02	282.51	0.81	价格区间: 5日:29.89 	10日:29.89 	20日:14.44 	30日:14.44 	60日:12.09 	120日:20.99 	250日:20.99 		,当前价：4.96	,当前：2022-05-03 18:05:08
        yinHang.put("601838", "成都银行");//194	银行         -1.7	606.50	1.3 	价格区间: 5日:71.69 	10日:71.69 	20日:79.94 	30日:81.27 	60日:86.13 	120日:90.24 	250日:91.33 		,当前价：16.79	,当前：2022-05-03 18:05:10
        yinHang.put("601665", "齐鲁银行");//183	银行         4.17	240.49	0.69	价格区间: 5日:18.66 	10日:18.66 	20日:12.95 	30日:16.83 	60日:20.38 	120日:20.38 	250日:5.79  		,当前价：5.25	,当前：2022-05-03 18:05:11
        yinHang.put("601128", "常熟银行");//179	银行         0.37	221.74	0.95	价格区间: 5日:66.22 	10日:60.49 	20日:57.76 	30日:70.83 	60日:73.94 	120日:76.21 	250日:83.10 		,当前价：8.09	,当前：2022-05-03 18:05:12
        yinHang.put("600926", "杭州银行");//174	银行         0.2 	906.14	1.2 	价格区间: 5日:63.33 	10日:54.72 	20日:77.57 	30日:80.80 	60日:84.42 	120日:84.66 	250日:67.59 		,当前价：15.28	,当前：2022-05-03 18:05:13
        yinHang.put("600919", "江苏银行");//170	银行         -0.81	1082.61	1.34	价格区间: 5日:60.34 	10日:60.34 	20日:70.37 	30日:82.35 	60日:85.19 	120日:87.23 	250日:84.39 		,当前价：7.33	,当前：2022-05-03 18:05:14
        yinHang.put("601009", "南京银行");//163	银行         -1.61	1161.79	0.97	价格区间: 5日:30.69 	10日:26.96 	20日:58.82 	30日:68.54 	60日:74.07 	120日:76.99 	250日:79.26 		,当前价：11.6	,当前：2022-05-03 18:05:15
        yinHang.put("002839", "张家港行");//157	银行         -0.95	112.82	1   	价格区间: 5日:31.88 	10日:27.16 	20日:22.33 	30日:38.93 	60日:45.95 	120日:45.95 	250日:56.76 		,当前价：6.24	,当前：2022-05-03 18:05:15
        yinHang.put("603323", "苏农银行");//156	银行         -0.56	95.20	1.15	价格区间: 5日:40.00 	10日:36.84 	20日:28.87 	30日:41.03 	60日:47.73 	120日:48.51 	250日:59.17 		,当前价：5.28	,当前：2022-05-03 18:05:16
        yinHang.put("601166", "兴业银行");//147	银行         -2.71	4254.55	1.79	价格区间: 5日:44.04 	10日:24.37 	20日:19.83 	30日:36.60 	60日:38.01 	120日:48.11 	250日:55.37 		,当前价：20.48	,当前：2022-05-03 18:05:17
    }

    /**
     * shangYeBaiHuo ["商业百货"]：30;
     */
    public static Map<String, String> shangYeBaiHuo = new HashMap<>();

    static {
        shangYeBaiHuo.put("603123", "翠微股份");//286	商业百货     1.54	105.43	3.22	价格区间: 5日:85.17 	10日:41.69 	20日:17.47 	30日:17.47 	60日:9.32  	净利环:25.34;净利同:6.27;营收环:3.18;营收同:-2.85;
        shangYeBaiHuo.put("002251", "步步高  ");//261	商业百货     -1.66	76.97	2.78	价格区间: 5日:56.30 	10日:14.96 	20日:41.46 	30日:43.16 	60日:44.97 	净利环:107.87;净利同:-72.93;营收环:18.68;营收同:-21.58;
        shangYeBaiHuo.put("002419", "天虹股份");//226	商业百货     2.62	82.40	3.72	价格区间: 5日:90.21 	10日:90.21 	20日:83.73 	30日:83.73 	60日:62.28 	净利环:1239.82;净利同:104.62;营收环:12.72;营收同:2.74;
        shangYeBaiHuo.put("601116", "三江购物");//225	商业百货     6.94	64.13	2.82	价格区间: 5日:87.14 	10日:87.14 	20日:81.33 	30日:83.49 	60日:84.78 	净利环:104.72;净利同:75.98;营收环:16.48;营收同:-0.62;
        shangYeBaiHuo.put("002187", "广百股份");//209	商业百货     -5.03	62.52	2.22	价格区间: 5日:22.52 	10日:12.98 	20日:15.24 	30日:27.39 	60日:39.04 	净利环:-66.29;净利同:-73.64;营收环:6.27;营收同:11.07;
        shangYeBaiHuo.put("601933", "永辉超市");//208	商业百货     -0.64	425.62	2.62	价格区间: 5日:83.48 	10日:83.48 	20日:64.00 	30日:64.00 	60日:71.58 	净利环:128.44;净利同:2053.54;营收环:28.34;营收同:3.45;
        shangYeBaiHuo.put("600694", "大商股份");//196	商业百货     -1.14	61.18	1.26	价格区间: 5日:79.77 	10日:79.77 	20日:69.73 	30日:70.13 	60日:76.01 	净利环:349.97;净利同:-19.18;营收环:23.09;营收同:-10.55;
    }




    /**
     * lvYouJiuDian ["旅游酒店"]：9;
     */
    public static Map<String, String> lvYouJiuDian = new HashMap<>();

    static {
        lvYouJiuDian.put("000524", "岭南控股");//298	旅游酒店     3.58	60.12	0.75	价格区间: 5日:50.71 	10日:24.32 	20日:12.48 	30日:9.62  	60日:21.62 	120日:28.43 	250日:29.34 		,当前价：8.97	,当前：2022-05-02 23:57:50
        lvYouJiuDian.put("002059", "云南旅游");//247	旅游酒店     4.08	61.96	1.06	价格区间: 5日:55.29 	10日:20.35 	20日:12.02 	30日:12.02 	60日:12.02 	120日:31.61 	250日:33.85 		,当前价：6.12	,当前：2022-05-02 23:57:51
        lvYouJiuDian.put("000796", "凯撒旅业");//237	旅游酒店     4.42	66.33	0.9 	价格区间: 5日:47.37 	10日:20.00 	20日:10.96 	30日:10.96 	60日:11.27 	120日:21.59 	250日:24.04 		,当前价：8.26	,当前：2022-05-02 23:57:52
        lvYouJiuDian.put("600054", "黄山旅游");//224	旅游酒店     1.52	73.08	0.83	价格区间: 5日:76.77 	10日:36.84 	20日:36.84 	30日:36.84 	60日:31.07 	120日:35.77 	250日:43.95 		,当前价：10.02	,当前：2022-05-02 23:57:53
        lvYouJiuDian.put("002707", "众信旅游");//198	旅游酒店     4.33	50.21	1   	价格区间: 5日:51.65 	10日:23.15 	20日:16.55 	30日:16.55 	60日:12.84 	120日:21.43 	250日:31.40 		,当前价：5.54	,当前：2022-05-02 23:57:54
        lvYouJiuDian.put("600258", "首旅酒店");//187	旅游酒店     2.35	263.86	1.45	价格区间: 5日:98.56 	10日:54.23 	20日:54.23 	30日:54.23 	60日:32.32 	120日:32.32 	250日:52.31 		,当前价：23.53	,当前：2022-05-02 23:57:55
        lvYouJiuDian.put("601888", "中国中免");//178	旅游酒店     0.23	3553.31	0.96	价格区间: 5日:73.70 	10日:73.70 	20日:83.36 	30日:83.36 	60日:36.28 	120日:34.19 	250日:14.59 		,当前价：181.99	,当前：2022-05-02 23:57:57
    }

    /**
     * hangYunGangKou 航运港口
     */
    public static Map<String, String> hangYunGangKou = new HashMap<>();

    static {
        hangYunGangKou.put("600026", "中远海能");//282	航运港口     1.02	375.78	0.65	价格区间: 5日:85.71 	10日:56.98 	20日:68.18 	30日:76.23 	60日:79.47 	120日:79.79 	250日:79.79 		,当前价：7.89	,当前：2022-05-03 11:25:53
        hangYunGangKou.put("600190", "锦州港  ");//231	航运港口     2.99	62.07	0.97	价格区间: 5日:58.06 	10日:24.32 	20日:12.59 	30日:10.91 	60日:13.79 	120日:15.25 	250日:15.82 		,当前价：3.1	,当前：2022-05-03 11:25:55
        hangYunGangKou.put("000582", "北部湾港");//224	航运港口     1.77	126.50	0.87	价格区间: 5日:58.67 	10日:19.91 	20日:7.96  	30日:7.96  	60日:10.86 	120日:10.86 	250日:10.86 		,当前价：7.49	,当前：2022-05-03 11:25:56
        hangYunGangKou.put("601872", "招商轮船");//212	航运港口     1.39	414.31	0.6 	价格区间: 5日:66.20 	10日:48.45 	20日:43.48 	30日:67.50 	60日:68.45 	120日:68.45 	250日:61.04 		,当前价：5.11	,当前：2022-05-03 11:25:58
    }

    /**
     * shuiNiJianCai
     */
    public static Map<String, String> shuiNiJianCai = new HashMap<>();

    static {
        shuiNiJianCai.put("003037", "三和管桩");//294	水泥建材     9.98	68.27	1.61	价格区间: 5日:100.00	10日:81.82 	20日:81.82 	30日:81.82 	60日:82.49 	120日:82.94 	250日:40.88 		,当前价：13.55	,当前：2022-05-03 11:28:56
        shuiNiJianCai.put("600724", "宁波富达");//261	水泥建材     3.91	65.32	1.09	价格区间: 5日:91.23 	10日:44.07 	20日:17.33 	30日:18.69 	60日:29.75 	120日:34.04 	250日:35.75 		,当前价：4.52	,当前：2022-05-03 11:28:57
        shuiNiJianCai.put("000546", "金圆股份");//210	水泥建材     4.33	88.46	0.96	价格区间: 5日:91.67 	10日:50.35 	20日:21.93 	30日:21.93 	60日:16.19 	120日:21.53 	250日:42.14 		,当前价：11.33	,当前：2022-05-03 11:28:59
        shuiNiJianCai.put("600425", "青松建化");//202	水泥建材     -0.47	57.91	1.29	价格区间: 5日:88.89 	10日:74.07 	20日:25.64 	30日:27.95 	60日:34.83 	120日:40.21 	250日:42.00 		,当前价：4.2	,当前：2022-05-03 11:29:00
        shuiNiJianCai.put("600801", "华新水泥");//200	水泥建材     0.23	457.06	0.96	价格区间: 5日:75.86 	10日:80.93 	20日:80.93 	30日:85.97 	60日:88.33 	120日:87.13 	250日:54.33 		,当前价：21.8	,当前：2022-05-03 11:29:01
    }

    /**
     * guiJinShu    ["贵金属"]：9;
     */
    public static Map<String, String> guiJinShu = new HashMap<>();

    static {
        guiJinShu.put("600988", "赤峰黄金");//238	贵金属       10.01	305.49	1.2 	价格区间: 5日:70.77 	10日:37.71 	20日:32.42 	30日:35.34 	60日:53.70 	120日:53.70 	250日:53.70 		,当前价：18.36	,当前：2022-05-03 11:59:06
        guiJinShu.put("000975", "银泰黄金");//201	贵金属       10.05	258.51	0.93	价格区间: 5日:79.84 	10日:41.70 	20日:38.87 	30日:42.35 	60日:49.69 	120日:49.69 	250日:42.78 		,当前价：9.31	,当前：2022-05-03 11:59:07
        guiJinShu.put("002155", "湖南黄金");//200	贵金属       7.36	110.47	1.02	价格区间: 5日:65.00 	10日:29.89 	20日:26.94 	30日:26.94 	60日:20.88 	120日:20.88 	250日:15.72 		,当前价：9.19	,当前：2022-05-03 11:59:09
        guiJinShu.put("601069", "西部黄金");//197	贵金属       4.16	72.36	0.91	价格区间: 5日:44.44 	10日:20.57 	20日:15.87 	30日:15.87 	60日:9.89  	120日:9.89  	250日:9.89  		,当前价：11.26	,当前：2022-05-03 11:59:10
    }

    /**
     * huaFeiHangYe ["化肥行业"]：18;
     */
    public static Map<String, String> huaFeiHangYe = new HashMap<>();

    static {
        huaFeiHangYe.put("000893", "亚钾国际");//322	化肥行业     2.4 	303.52	3.31	价格区间: 5日:83.18 	10日:83.18 	20日:70.47 	30日:75.43 	60日:84.12 	净利环:56.89;净利同:1498.70;营收环:32.61;营收同:316.56;
        huaFeiHangYe.put("603938", "三孚股份");//278	化肥行业     6.06	96.98	4.93	价格区间: 5日:88.74 	10日:88.74 	20日:74.76 	30日:74.41 	60日:78.30 	净利环:69.44;净利同:183.75;营收环:14.17;营收同:85.10;
        huaFeiHangYe.put("002895", "川恒股份");//276	化肥行业     4.16	137.64	7.93	价格区间: 5日:88.79 	10日:88.79 	20日:88.79 	30日:89.10 	60日:90.34 	净利环:-33.23;净利同:205.13;营收环:-29.15;营收同:57.12;
        huaFeiHangYe.put("600096", "云天化  ");//271	化肥行业     -0.04	458.97	2.76	价格区间: 5日:82.50 	10日:56.37 	20日:48.75 	30日:48.75 	60日:59.13 	净利环:105.29;净利同:186.15;营收环:-4.20;营收同:13.28;
        huaFeiHangYe.put("600078", "*ST澄星 ");//238	化肥行业     -5   	70.56	0.4 	价格区间: 5日:47.85 	10日:27.37 	20日:27.27 	30日:40.06 	60日:73.50 	净利环:-96.54;净利同:700.05;营收环:21.43;营收同:26.62;
        huaFeiHangYe.put("002588", "史丹利  ");//232	化肥行业     5.1 	76.35	7.06	价格区间: 5日:86.99 	10日:61.35 	20日:51.84 	30日:51.84 	60日:51.84 	净利环:91.99;净利同:47.00;营收环:78.20;营收同:77.00;
        huaFeiHangYe.put("600141", "兴发集团");//217	化肥行业     0   	368.09	2.69	价格区间: 5日:85.21 	10日:50.90 	20日:45.68 	30日:45.68 	60日:38.01 	净利环:-2.02;净利同:384.07;营收环:22.04;营收同:90.65;
        huaFeiHangYe.put("002539", "云图控股");//215	化肥行业     -0.97	144.34	2.28	价格区间: 5日:84.72 	10日:57.57 	20日:53.59 	30日:53.59 	60日:60.47 	净利环:3.14;净利同:157.59;营收环:14.81;营收同:87.03;
        huaFeiHangYe.put("000912", "泸天化  ");//202	化肥行业     -0.19	83.42	2.79	价格区间: 5日:78.72 	10日:35.58 	20日:35.07 	30日:35.07 	60日:32.17 	净利环:1921.03;净利同:176.35;营收环:-8.77;营收同:54.41;
    }

    /**
     * tieLuGongLu ["铁路公路"]：20;
     */
    public static Map<String, String> tieLuGongLu = new HashMap<>();

    static {
        tieLuGongLu.put("603032", "*ST德新 ");//179	铁路公路     5   	97.32	1.47	价格区间: 5日:83.42 	10日:62.46 	20日:47.89 	30日:35.06 	60日:29.05 	120日:20.78 	250日:57.94 		,当前价：58.16	,当前：2022-05-03 12:02:58
        tieLuGongLu.put("600650", "锦江在线");//178	铁路公路     9.31	51.80	1.21	价格区间: 5日:83.11 	10日:37.73 	20日:36.61 	30日:36.61 	60日:36.61 	120日:36.61 	250日:36.61 		,当前价：9.39	,当前：2022-05-03 12:02:59
        tieLuGongLu.put("601107", "四川成渝");//171	铁路公路     1.22	126.60	1.06	价格区间: 5日:75.76 	10日:40.32 	20日:26.32 	30日:26.32 	60日:16.67 	120日:31.58 	250日:38.51 		,当前价：4.14	,当前：2022-05-03 12:03:00
        tieLuGongLu.put("600662", "外服控股");//171	铁路公路     10.08	126.06	0.81	价格区间: 5日:68.29 	10日:34.85 	20日:34.85 	30日:34.85 	60日:33.07 	120日:24.63 	250日:15.36 		,当前价：5.57	,当前：2022-05-03 12:03:01
    }

    /**
     * nongYaoShouYao ["农药兽药"]：16;
     */
    public static Map<String, String> nongYaoShouYao = new HashMap<>();

    static {
        nongYaoShouYao.put("600389", "江山股份");//268	农药兽药     3.27	155.87	0.86	价格区间: 5日:66.78 	10日:36.31 	20日:44.13 	30日:55.86 	60日:60.86 	120日:63.83 	250日:69.62 		,当前价：52.48	,当前：2022-05-03 12:04:44
        nongYaoShouYao.put("600486", "扬农化工");//201	农药兽药     3.42	406.31	0.91	价格区间: 5日:95.91 	10日:95.91 	20日:94.01 	30日:94.75 	60日:96.56 	120日:76.39 	250日:76.39 		,当前价：131.11	,当前：2022-05-03 12:04:45
        nongYaoShouYao.put("600596", "新安股份");//193	农药兽药     1.77	197.76	1.44	价格区间: 5日:32.65 	10日:21.15 	20日:21.15 	30日:21.15 	60日:40.13 	120日:38.52 	250日:36.73 		,当前价：17.26	,当前：2022-05-03 12:04:47
        nongYaoShouYao.put("000553", "安道麦A"); //191	农药兽药     9.23	223.43	3.16	价格区间: 5日:97.22 	10日:97.22 	20日:97.22 	30日:97.22 	60日:97.45 	120日:97.45 	250日:60.58 		,当前价：9.59	,当前：2022-05-03 12:04:48
        nongYaoShouYao.put("603566", "普莱柯  ");//190	农药兽药     8.78	65.33	1.4 	价格区间: 5日:63.22 	10日:34.11 	20日:18.68 	30日:17.83 	60日:17.70 	120日:19.95 	250日:23.60 		,当前价：20.32	,当前：2022-05-03 12:04:48
    }

    /**
     * gongChengZiXunFuWu ["工程咨询服务"]：6;
     */
    public static Map<String, String> gongChengZiXunFuWu = new HashMap<>();

    static {
        gongChengZiXunFuWu.put("603018", "华设集团");//171	工程咨询服务 6.73	57.51	1.48	价格区间: 5日:79.69 	10日:81.02 	20日:57.51 	30日:57.51 	60日:35.35 	120日:48.61 	250日:49.25 		,当前价：8.41	,当前：2022-05-03 12:07:39
        gongChengZiXunFuWu.put("003013", "地铁设计");//141	工程咨询服务 2.56	62.44	0.85	价格区间: 5日:91.60 	10日:47.81 	20日:32.52 	30日:29.56 	60日:14.83 	120日:14.83 	250日:13.14 		,当前价：15.61	,当前：2022-05-03 12:07:40
        gongChengZiXunFuWu.put("000928", "中钢国际");//139	工程咨询服务 2.71	72.76	0.78	价格区间: 5日:92.86 	10日:43.33 	20日:23.42 	30日:23.42 	60日:15.85 	120日:10.12 	250日:5.98  		,当前价：5.68	,当前：2022-05-03 12:07:42
    }

    /**
     * gangTieHangYe ["钢铁行业"]：37;
     */
    public static Map<String, String> gangTieHangYe = new HashMap<>();

    static {
        gangTieHangYe.put("002545", "东方铁塔");//268	钢铁行业     0.18	139.71	0.81	价格区间: 5日:80.21 	10日:35.21 	20日:27.93 	30日:27.93 	60日:40.55 	120日:48.54 	250日:55.21 		,当前价：11.23	,当前：2022-05-03 12:09:04
        gangTieHangYe.put("600295", "鄂尔多斯");//246	钢铁行业     1.97	405.54	0.94	价格区间: 5日:95.67 	10日:51.64 	20日:46.43 	30日:54.05 	60日:59.97 	120日:59.97 	250日:41.00 		,当前价：28.4	,当前：2022-05-03 12:09:06
        gangTieHangYe.put("600581", "八一钢铁");//227	钢铁行业     1.19	91.51	1.34	价格区间: 5日:45.97 	10日:21.51 	20日:18.69 	30日:18.69 	60日:25.97 	120日:25.97 	250日:23.05 		,当前价：5.97	,当前：2022-05-03 12:09:07
        gangTieHangYe.put("002756", "永兴材料");//208	钢铁行业     5.25	422.55	1.11	价格区间: 5日:95.17 	10日:91.69 	20日:48.16 	30日:41.91 	60日:27.74 	120日:27.74 	250日:48.50 		,当前价：104.09	,当前：2022-05-03 12:09:08
        gangTieHangYe.put("000932", "华菱钢铁");//201	钢铁行业     5.61	403.46	1.14	价格区间: 5日:94.64 	10日:46.09 	20日:41.73 	30日:50.00 	60日:57.23 	120日:58.89 	250日:23.87 		,当前价：5.84	,当前：2022-05-03 12:09:09
        gangTieHangYe.put("000923", "河钢资源");//201	钢铁行业     8.97	94.32	1.03	价格区间: 5日:97.77 	10日:36.76 	20日:35.79 	30日:35.79 	60日:33.39 	120日:33.39 	250日:11.35 		,当前价：14.45	,当前：2022-05-03 12:09:10
    }

    /**
     * hangKongJiChang 航空机场
     */
    public static Map<String, String> lvYou_hangKongJiChang = new HashMap<>();

    static {
        lvYou_hangKongJiChang.put("601111", "中国国航");//187	航空机场     -4.19	1360.98	0.96	价格区间: 5日:4.42  	10日:4.07  	20日:28.48 	30日:46.85 	60日:34.10 	120日:45.97 	250日:60.97 		,当前价：9.37	,当前：2022-04-26 00:08:44
        lvYou_hangKongJiChang.put("600009", "上海机场");//182	航空机场     -5.31	935.15	1.1 	价格区间: 5日:0.00  	10日:9.42  	20日:20.89 	30日:37.66 	60日:22.25 	120日:34.06 	250日:51.25 		,当前价：48.53	,当前：2022-04-26 00:08:45
        lvYou_hangKongJiChang.put("600004", "白云机场");//175	航空机场     -5.22	279.51	1.31	价格区间: 5日:6.86  	10日:6.06  	20日:6.06  	30日:26.48 	60日:17.36 	120日:26.33 	250日:52.53 		,当前价：11.81	,当前：2022-04-26 00:08:46
        lvYou_hangKongJiChang.put("600029", "南方航空");//174	航空机场     -4.55	1101.65	1.15	价格区间: 5日:0.00  	10日:6.06  	20日:39.81 	30日:49.18 	60日:28.17 	120日:28.17 	250日:47.96 		,当前价：6.5	,当前：2022-04-26 00:08:48
        lvYou_hangKongJiChang.put("600115", "中国东航");//157	航空机场     -3.35	872.00	1.47	价格区间: 5日:0.00  	10日:24.00 	20日:18.46 	30日:9.23  	60日:7.06  	120日:7.06  	250日:19.80 		,当前价：4.62	,当前：2022-04-26 00:08:49
        lvYou_hangKongJiChang.put("002928", "华夏航空");//154	航空机场     -2.4	102.88	1.24	价格区间: 5日:11.48 	10日:21.17 	20日:23.94 	30日:25.68 	60日:8.60  	120日:8.60  	250日:14.34 		,当前价：10.15	,当前：2022-04-26 00:08:49
        lvYou_hangKongJiChang.put("603885", "吉祥航空");//151	航空机场     -10.01	233.38	1.74	价格区间: 5日:0.00  	10日:0.00  	20日:0.00  	30日:0.00  	60日:0.00  	120日:0.00  	250日:6.07  		,当前价：11.87	,当前：2022-04-26 00:08:50

    }

    /**
     * wuLiuHangYe ["物流行业"]：28;
     */
    public static Map<String, String> wuLiuHangYe = new HashMap<>();

    static {
        wuLiuHangYe.put("600180", "瑞茂通  ");//258	物流行业     1.3 	94.94	2.85	价格区间: 5日:75.49 	10日:69.29 	20日:74.33 	30日:74.48 	60日:75.91 	净利环:3.80;净利同:34.84;营收环:-27.57;营收同:-11.48;
        wuLiuHangYe.put("600575", "淮河能源");//219	物流行业     -0.96	119.70	2.68	价格区间: 5日:85.71 	10日:52.50 	20日:38.53 	30日:38.53 	60日:40.53 	净利环:254.20;净利同:19.57;营收环:-3.35;营收同:30.79;
        wuLiuHangYe.put("601156", "东航物流");//218	物流行业     4.23	387.68	6.28	价格区间: 5日:86.86 	10日:86.86 	20日:88.08 	30日:89.39 	60日:89.39 	净利环:14.29;净利同:102.32;营收环:-7.31;营收同:46.43;
        wuLiuHangYe.put("600233", "圆通速递");//215	物流行业     -3.32	620.82	1.15	价格区间: 5日:68.56 	10日:75.92 	20日:75.92 	30日:75.92 	60日:75.92 	净利环:-24.28;净利同:134.88;营收环:-19.06;营收同:32.00;
        wuLiuHangYe.put("603056", "德邦股份");//206	物流行业     0   	142.03	1.52	价格区间: 5日:81.82 	10日:79.05 	20日:33.43 	30日:12.21 	60日:29.74 	净利环:-169.24;净利同:-838.73;营收环:-20.23;营收同:-4.75;
        wuLiuHangYe.put("603871", "嘉友国际");//201	物流行业     0.26	61.33	1.15	价格区间: 5日:96.27 	10日:96.27 	20日:96.27 	30日:96.27 	60日:43.99 	净利环:14.30;净利同:28.59;营收环:-51.59;营收同:8.43;
        wuLiuHangYe.put("600787", "中储股份");//195	物流行业     -1.79	120.25	1.89	价格区间: 5日:72.29 	10日:46.15 	20日:26.20 	30日:26.20 	60日:26.20 	净利环:39.58;净利同:479.21;营收环:-27.48;营收同:20.03;
        wuLiuHangYe.put("000557", "西部创业");//193	物流行业     -0.5	58.63	2.46	价格区间: 5日:83.93 	10日:47.47 	20日:41.96 	30日:36.43 	60日:24.74 	净利环:137.33;净利同:19.90;营收环:9.74;营收同:73.43;
        wuLiuHangYe.put("002183", "怡亚通  ");//190	物流行业     3.64	140.50	1.38	价格区间: 5日:88.60 	10日:75.94 	20日:75.94 	30日:75.94 	60日:75.94 	净利环:-37.54;净利同:-44.59;营收环:-17.66;营收同:-24.61;
        wuLiuHangYe.put("002468", "申通快递");//188	物流行业     -0.22	138.69	2.52	价格区间: 5日:85.86 	10日:85.35 	20日:86.64 	30日:86.64 	60日:83.12 	净利环:115.84;净利同:218.84;营收环:-14.29;营收同:35.91;
    }

    /**
     * nongMuSiYu
     */
    public static Map<String, String> nongMuSiYu = new HashMap<>();

    static {
        nongMuSiYu.put("600313", "农发种业");//313	农牧饲渔     3.65	86.14	0.91	价格区间: 5日:50.87 	10日:19.05 	20日:20.76 	30日:42.64 	60日:45.64 	120日:45.64 	250日:49.93 		,当前价：7.96	,当前：2022-05-03 18:22:28
        nongMuSiYu.put("001313", "粤海饲料");//296	农牧饲渔     4.27	85.40	0.73	价格区间: 5日:33.96 	10日:16.10 	20日:16.10 	30日:9.87  	60日:40.88 	120日:40.88 	250日:40.88 		,当前价：12.2	,当前：2022-05-03 18:22:29
        nongMuSiYu.put("603363", "傲农生物");//253	农牧饲渔     -4.44	115.02	1.17	价格区间: 5日:18.18 	10日:5.40  	20日:5.40  	30日:5.40  	60日:5.40  	120日:35.59 	250日:42.99 		,当前价：16.58	,当前：2022-05-03 18:22:31
        nongMuSiYu.put("000505", "京粮控股");//232	农牧饲渔     2.81	63.75	0.86	价格区间: 5日:36.69 	10日:12.60 	20日:11.92 	30日:19.53 	60日:30.05 	120日:30.05 	250日:30.34 		,当前价：8.77	,当前：2022-05-03 18:22:32
        nongMuSiYu.put("603477", "巨星农牧");//223	农牧饲渔     -0.7	92.87	0.66	价格区间: 5日:24.87 	10日:9.95  	20日:9.18  	30日:8.64  	60日:12.23 	120日:39.46 	250日:46.85 		,当前价：18.35	,当前：2022-05-03 18:22:33
        nongMuSiYu.put("600251", "冠农股份");//221	农牧饲渔     1.57	70.56	0.64	价格区间: 5日:74.83 	10日:27.86 	20日:27.86 	30日:27.86 	60日:30.92 	120日:30.92 	250日:41.22 		,当前价：9.03	,当前：2022-05-03 18:22:34
    }

    /**
     * fangDiChanFuWu ["房地产服务"]：8;
     */
    public static Map<String, String> fangDiChanFuWu = new HashMap<>();

    static {
        fangDiChanFuWu.put("000056", "皇庭国际");//225	房地产服务   -9.93	62.84	0.45	价格区间: 5日:0.00  	10日:0.00  	20日:0.00  	30日:0.00  	60日:0.00  	120日:29.92 	250日:39.08 		,当前价：5.35	,当前：2022-05-03 18:52:37
        fangDiChanFuWu.put("002285", "世联行  ");//207	房地产服务   4.55	65.48	1.68	价格区间: 5日:76.56 	10日:53.26 	20日:21.68 	30日:21.68 	60日:21.68 	120日:21.68 	250日:8.43  		,当前价：3.22	,当前：2022-05-03 18:52:38
        fangDiChanFuWu.put("001914", "招商积余");//205	房地产服务   0.5 	192.98	1.48	价格区间: 5日:63.79 	10日:63.79 	20日:57.97 	30日:72.83 	60日:77.07 	120日:72.30 	250日:63.68 		,当前价：18.2	,当前：2022-05-03 18:52:39
        fangDiChanFuWu.put("002146", "荣盛发展");//199	房地产服务   4.76	162.62	0.94	价格区间: 5日:85.71 	10日:32.31 	20日:22.95 	30日:22.95 	60日:25.79 	120日:25.79 	250日:14.58 		,当前价：3.74	,当前：2022-05-03 18:52:40
    }

    /**
     * zongHeHangYe
     */
    public static Map<String, String> zongHeHangYe = new HashMap<>();

    static {
        zongHeHangYe.put("002758", "浙农股份");//252	综合行业     3.09	61.98	0.76	价格区间: 5日:63.69 	10日:21.88 	20日:21.23 	30日:16.53 	60日:18.39 	120日:23.83 	250日:30.54 		,当前价：12.33	,当前：2022-05-03 18:56:53
        zongHeHangYe.put("000839", "中信国安");//243	综合行业     -6.06	121.51	2.12	价格区间: 5日:60.00 	10日:64.63 	20日:64.63 	30日:64.63 	60日:64.86 	120日:64.86 	250日:68.29 		,当前价：3.1	,当前：2022-05-03 18:56:54
        zongHeHangYe.put("600770", "综艺股份");//235	综合行业     0   	102.57	1.25	价格区间: 5日:85.80 	10日:85.80 	20日:77.04 	30日:77.72 	60日:81.09 	120日:70.87 	250日:73.67 		,当前价：7.89	,当前：2022-05-03 18:56:56
        zongHeHangYe.put("000861", "海印股份");//199	综合行业     0.34	68.37	0.93	价格区间: 5日:91.67 	10日:74.32 	20日:40.44 	30日:39.57 	60日:39.57 	120日:53.85 	250日:57.58 		,当前价：2.94	,当前：2022-05-03 18:56:57
    }

    /**
     * gongYongShiYe ["公用事业"]：11;
     */
    public static Map<String, String> gongYongShiYe = new HashMap<>();

    static {
        gongYongShiYe.put("601199", "江南水务");//204	公用事业     8.21	54.24	0.74	价格区间: 5日:52.29 	10日:36.36 	20日:36.36 	30日:30.19 	60日:30.19 	120日:50.93 	250日:54.55 		,当前价：5.8	,当前：2022-05-03 21:01:05
        gongYongShiYe.put("600874", "创业环保");//188	公用事业     2.31	94.63	0.95	价格区间: 5日:91.38 	10日:38.13 	20日:23.35 	30日:23.35 	60日:26.27 	120日:26.27 	250日:34.34 		,当前价：6.63	,当前：2022-05-03 21:01:06
    }

    /**
     * baoXian ["保险"]：6;
     */
    public static Map<String, String> baoXian = new HashMap<>();

    static {
        baoXian.put("601318", "中国平安");//137	保险         2.06	8145.68	0.93	价格区间: 5日:46.36 	10日:28.99 	20日:20.71 	30日:20.71 	60日:16.04 	120日:16.04 	250日:6.89  		,当前价：44.56	,当前：2022-05-03 21:11:47
        baoXian.put("601628", "中国人寿");//135	保险         3.88	7193.37	0.86	价格区间: 5日:59.15 	10日:47.37 	20日:39.87 	30日:39.87 	60日:20.62 	120日:20.62 	250日:13.07 		,当前价：25.45	,当前：2022-05-03 21:11:50
        baoXian.put("601336", "新华保险");//130	保险         1.46	930.56	0.63	价格区间: 5日:27.33 	10日:18.60 	20日:17.29 	30日:17.29 	60日:10.50 	120日:10.50 	250日:6.08  		,当前价：29.83	,当前：2022-05-03 21:11:52
    }

    /**
     * zhuBaoShouShi["珠宝首饰"]：6;
     */
    public static Map<String, String> zhuBaoShouShi = new HashMap<>();

    static {
        zhuBaoShouShi.put("002356", "*ST赫美 ");//213	珠宝首饰     4.95	69.50	1.46	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:68.15 	250日:66.09 		,当前价：5.3	,当前：2022-05-03 21:13:46
        zhuBaoShouShi.put("600916", "中国黄金");//160	珠宝首饰     5.39	180.60	0.94	价格区间: 5日:66.90 	10日:35.19 	20日:25.68 	30日:25.68 	60日:17.53 	120日:17.53 	250日:9.66  		,当前价：10.75	,当前：2022-05-03 21:13:48
        zhuBaoShouShi.put("600655", "豫园股份");//152	珠宝首饰     5.89	349.75	1.06	价格区间: 5日:47.11 	10日:31.84 	20日:22.09 	30日:22.09 	60日:22.09 	120日:22.09 	250日:9.47  		,当前价：8.99	,当前：2022-05-03 21:13:49
    }

    /**
     * yiYaoShangYe ["医药商业"]：15;
     */
    public static Map<String, String> yiYaoShangYe = new HashMap<>();

    static {
        yiYaoShangYe.put("600056", "中国医药");//281	医药商业     -0.38	225.98	1.47	价格区间: 5日:68.75 	10日:30.68 	20日:8.69  	30日:8.69  	60日:31.83 	120日:31.83 	250日:31.83 		,当前价：21.15	,当前：2022-05-03 21:15:43
        yiYaoShangYe.put("002589", "瑞康医药");//208	医药商业     6.16	54.47	1   	价格区间: 5日:41.94 	10日:23.64 	20日:7.72  	30日:7.72  	60日:7.72  	120日:7.99  	250日:7.99  		,当前价：3.62	,当前：2022-05-03 21:15:44
        yiYaoShangYe.put("600511", "国药股份");//194	医药商业     0.55	222.65	1.07	价格区间: 5日:79.36 	10日:79.36 	20日:77.50 	30日:54.69 	60日:54.69 	120日:54.69 	250日:36.50 		,当前价：29.51	,当前：2022-05-03 21:15:45
    }

    /**
     * maoYiHangYe ["贸易行业"]：16;
     */
    public static Map<String, String> maoYiHangYe = new HashMap<>();

    static {
        maoYiHangYe.put("600153", "建发股份");//254	贸易行业     2.99	414.05	1.39	价格区间: 5日:86.87 	10日:86.87 	20日:78.90 	30日:90.12 	60日:91.41 	120日:93.30 	250日:93.68 		,当前价：14.46	,当前：2022-05-03 21:18:35
        maoYiHangYe.put("000019", "深粮控股");//202	贸易行业     3.48	82.29	0.74	价格区间: 5日:42.48 	10日:21.15 	20日:16.72 	30日:15.29 	60日:17.90 	120日:17.90 	250日:22.22 		,当前价：7.14	,当前：2022-05-03 21:18:36
    }

    /**
     * niangJiuHangYe ["酿酒行业"]：29;
     */
    public static Map<String, String> niangJiuHangYe = new HashMap<>();

    static {
        niangJiuHangYe.put("600199", "金种子酒");//307	酿酒行业     3.67	170.90	1.06	价格区间: 5日:79.85 	10日:37.43 	20日:48.23 	30日:34.44 	60日:65.62 	120日:65.62 	250日:66.65 		,当前价：25.98	,当前：2022-05-03 21:24:19
        niangJiuHangYe.put("600238", "海南椰岛");//205	酿酒行业     3.35	55.26	0.9 	价格区间: 5日:66.41 	10日:24.22 	20日:20.63 	30日:20.63 	60日:16.47 	120日:8.12  	250日:11.47 		,当前价：12.33	,当前：2022-05-03 21:24:21
        niangJiuHangYe.put("002646", "天佑德酒");//203	酿酒行业     0.92	82.56	1.35	价格区间: 5日:90.32 	10日:87.50 	20日:75.88 	30日:75.88 	60日:67.80 	120日:31.78 	250日:20.25 		,当前价：17.47	,当前：2022-05-03 21:24:22
        niangJiuHangYe.put("603919", "金徽酒  ");//190	酿酒行业     1.26	151.06	1.2 	价格区间: 5日:96.75 	10日:96.75 	20日:96.75 	30日:76.94 	60日:50.64 	120日:23.70 	250日:16.41 		,当前价：29.78	,当前：2022-05-03 21:24:23
    }

    /**
     * huaXueZhiYao ["化学制药"]：50;
     */
    public static Map<String, String> huaXueZhiYao = new HashMap<>();

    static {
        huaXueZhiYao.put("000756", "新华制药");//361	化学制药     9.99	111.29	1.97	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	净利环:71.65;净利同:8.20;营收环:13.05;营收同:3.57;
        huaXueZhiYao.put("603229", "奥翔药业");//347	化学制药     -6.87	180.93	1.88	价格区间: 5日:45.70 	10日:45.70 	20日:36.65 	30日:36.65 	60日:64.18 	净利环:98.57;净利同:61.18;营收环:46.49;营收同:42.45;
        huaXueZhiYao.put("600062", "华润双鹤");//330	化学制药     -8.53	290.75	2.12	价格区间: 5日:53.84 	10日:58.22 	20日:73.32 	30日:75.53 	60日:77.08 	净利环:611.72;净利同:15.99;营收环:12.61;营收同:4.59;
        huaXueZhiYao.put("002550", "千红制药");//261	化学制药     -4.75	76.92	1.63	价格区间: 5日:44.34 	10日:67.76 	20日:67.76 	30日:67.76 	60日:56.41 	净利环:1550.33;净利同:135.93;营收环:9.01;营收同:41.16;
        huaXueZhiYao.put("603538", "美诺华  ");//257	化学制药     2.55	73.48	2.55	价格区间: 5日:80.48 	10日:63.17 	20日:23.36 	30日:16.02 	60日:33.69 	净利环:1515.47;净利同:128.94;营收环:47.36;营收同:47.86;
        huaXueZhiYao.put("603222", "济民医疗");//245	化学制药     1.23	53.16	3   	价格区间: 5日:84.00 	10日:32.61 	20日:32.61 	30日:32.61 	60日:32.61 	净利环:2764.61;净利同:76.94;营收环:-8.47;营收同:12.50;
        huaXueZhiYao.put("002435", "长江健康");//233	化学制药     -0.81	60.81	3.8 	价格区间: 5日:66.67 	10日:27.67 	20日:21.67 	30日:11.99 	60日:14.16 	净利环:108.50;净利同:-29.51;营收环:-9.07;营收同:-13.44;
        huaXueZhiYao.put("605116", "奥锐特  ");//231	化学制药     -0.43	93.03	2.35	价格区间: 5日:83.22 	10日:83.22 	20日:83.22 	30日:48.48 	60日:32.26 	净利环:16.07;净利同:25.42;营收环:2.13;营收同:17.45;
        huaXueZhiYao.put("000915", "华特达因");//219	化学制药     -2.56	82.20	1.42	价格区间: 5日:85.71 	10日:75.41 	20日:76.10 	30日:76.10 	60日:76.10 	净利环:153.38;净利同:43.18;营收环:33.16;营收同:23.74;
        huaXueZhiYao.put("603456", "九洲药业");//210	化学制药     -2.64	375.96	1.26	价格区间: 5日:28.67 	10日:51.03 	20日:50.91 	30日:24.32 	60日:33.53 	净利环:29.25;净利同:120.13;营收环:29.72;营收同:60.46;
        huaXueZhiYao.put("600196", "复星医药");//209	化学制药     -4.2	1068.98	1.21	价格区间: 5日:26.88 	10日:38.17 	20日:12.50 	30日:11.36 	60日:20.81 	净利环:-60.49;净利同:-45.41;营收环:-13.17;营收同:28.87;
        huaXueZhiYao.put("000566", "海南海药");//198	化学制药     -2.01	50.73	2.66	价格区间: 5日:75.00 	10日:38.89 	20日:16.22 	30日:16.22 	60日:16.22 	净利环:98.33;净利同:88.31;营收环:-1.05;营收同:1.54;
        huaXueZhiYao.put("600521", "华海药业");//197	化学制药     2.35	240.62	2.05	价格区间: 5日:87.19 	10日:62.43 	20日:29.10 	30日:17.84 	60日:15.70 	净利环:234.89;净利同:-46.02;营收环:-13.36;营收同:18.42;
    }

    /**
     * shiYouHangYe ["石油行业"]：9;
     */
    public static Map<String, String> shiYouHangYe = new HashMap<>();

    static {
        shiYouHangYe.put("600256", "广汇能源");//253	石油行业     3.99	581.73	0.78	价格区间: 5日:73.57 	10日:74.13 	20日:58.56 	30日:72.43 	60日:80.92 	120日:80.92 	250日:88.87 		,当前价：8.86	,当前：2022-05-03 21:34:11
        shiYouHangYe.put("601857", "中国石油");//181	石油行业     3.86	9846.53	1.1 	价格区间: 5日:97.73 	10日:64.18 	20日:57.33 	30日:57.33 	60日:42.62 	120日:51.39 	250日:57.14 		,当前价：5.38	,当前：2022-05-03 21:34:12
    }

    /**
     * huaQianHangYe ["化纤行业"]：14;
     */
    public static Map<String, String> huaQianHangYe = new HashMap<>();

    static {
        huaQianHangYe.put("600063", "皖维高新");//196	化纤行业     1.94	121.33	1.02	价格区间: 5日:96.15 	10日:68.97 	20日:68.97 	30日:71.88 	60日:75.27 	120日:62.84 	250日:40.84 		,当前价：6.3	,当前：2022-05-03 21:36:51
        huaQianHangYe.put("000301", "东方盛虹");//162	化纤行业     4.52	728.45	0.86	价格区间: 5日:85.16 	10日:44.67 	20日:39.74 	30日:28.76 	60日:17.53 	120日:10.00 	250日:5.07  		,当前价：12.25	,当前：2022-05-03 21:36:53
    }

    /**
     * fangZhiFuZhuang ["纺织服装"]：25;
     */
    public static Map<String, String> fangZhiFuZhuang = new HashMap<>();

    static {
        fangZhiFuZhuang.put("605138", "盛泰集团");//227	纺织服装     0.15	74.45	3.45	价格区间: 5日:66.77 	10日:43.82 	20日:47.76 	30日:47.76 	60日:49.20 	净利环:7.79;净利同:43.41;营收环:-12.46;营收同:30.50;
        fangZhiFuZhuang.put("002612", "朗姿股份");//208	纺织服装     -0.43	102.78	2.8 	价格区间: 5日:77.35 	10日:54.88 	20日:54.88 	30日:54.88 	60日:32.25 	净利环:-107.67;净利同:-106.37;营收环:-11.86;营收同:0.26;
        fangZhiFuZhuang.put("605080", "浙江自然");//199	纺织服装     1.79	67.73	7.99	价格区间: 5日:72.25 	10日:77.26 	20日:80.31 	30日:80.31 	60日:79.59 	净利环:133.20;净利同:37.82;营收环:86.02;营收同:46.61;
        fangZhiFuZhuang.put("603665", "康隆达  ");//198	纺织服装     -2.5	68.85	1.26	价格区间: 5日:63.28 	10日:64.93 	20日:53.37 	30日:34.80 	60日:48.32 	净利环:109.76;净利同:-19.33;营收环:-10.59;营收同:5.84;
    }

    /**
     * zhongYao ["中药"]：35;
     */
    public static Map<String, String> zhongYao = new HashMap<>();

    static {
        zhongYao.put("002349", "精华制药");//393	中药         7.79	147.53	11.2	价格区间: 5日:100.00	10日:100.00	20日:76.87 	30日:38.59 	60日:41.09 	净利环:106.98;净利同:17.96;营收环:5.11;营收同:22.19;净利:0.67;
        zhongYao.put("002317", "众生药业");//293	中药         6.11	134.47	2.86	价格区间: 5日:93.37 	10日:79.80 	20日:78.20 	30日:57.00 	60日:69.46 	净利环:306.44;净利同:31.41;营收环:11.61;营收同:9.73;净利:0.75;
        zhongYao.put("002603", "以岭药业");//276	中药         -2.6	431.21	5.77	价格区间: 5日:95.12 	10日:55.35 	20日:20.95 	30日:20.95 	60日:31.94 	净利环:302.96;净利同:-28.22;营收环:35.74;营收同:-25.80;净利:4.84;
        zhongYao.put("002750", "龙津药业");//253	中药         2.91	55.27	8.95	价格区间: 5日:93.72 	10日:93.98 	20日:70.71 	30日:42.84 	60日:42.84 	净利环:123.92;净利同:-68.43;营收环:-56.24;营收同:-76.92;净利:0.01;
        zhongYao.put("600557", "康缘药业");//232	中药         0.27	84.22	2.18	价格区间: 5日:88.73 	10日:92.36 	20日:50.82 	30日:50.82 	60日:63.65 	净利环:-3.03;净利同:30.94;营收环:1.28;营收同:25.16;净利:1.10;
        zhongYao.put("002737", "葵花药业");//230	中药         2.44	107.92	2.11	价格区间: 5日:82.30 	10日:87.37 	20日:87.52 	30日:87.52 	60日:89.84 	净利环:-27.91;净利同:-2.96;营收环:-17.10;营收同:-1.50;净利:2.19;
        zhongYao.put("000999", "华润三九");//224	中药         2.89	390.39	5.89	价格区间: 5日:95.88 	10日:96.86 	20日:62.43 	30日:48.11 	60日:54.55 	净利环:174.34;净利同:30.45;营收环:-0.62;营收同:2.81;净利:8.39;
        zhongYao.put("600422", "昆药集团");//208	中药         10.04	89.78	0.71	价格区间: 5日:100.00	10日:95.54 	20日:86.99 	30日:69.03 	60日:71.68 	净利环:55.10;净利同:-41.27;营收环:6.19;营收同:24.71;净利:1.14;
        zhongYao.put("002424", "贵州百灵");//206	中药         4.97	101.32	1.63	价格区间: 5日:92.31 	10日:94.41 	20日:52.53 	30日:26.73 	60日:29.52 	净利环:1740.69;净利同:4.55;营收环:-34.82;营收同:-1.91;净利:0.65;
        zhongYao.put("002907", "华森制药");//204	中药         1.58	51.50	20.03	价格区间: 5日:89.39 	10日:90.57 	20日:57.95 	30日:33.80 	60日:33.80 	净利环:1152.10;净利同:-19.53;营收环:1.09;营收同:-11.75;净利:0.29;
        zhongYao.put("600129", "太极集团");//203	中药         0.46	98.18	2.68	价格区间: 5日:86.32 	10日:72.14 	20日:37.92 	30日:32.58 	60日:32.58 	净利环:102.58;净利同:-20.03;营收环:35.87;营收同:6.28;净利:0.20;
    }

    /**
     * huaXueYuanLiao ["化学原料"]：39;
     */
    public static Map<String, String> huaXueYuanLiao = new HashMap<>();

    static {
        huaXueYuanLiao.put("600367", "红星发展");//249	化学原料     3.37	54.89	0.98	价格区间: 5日:90.97 	10日:36.95 	20日:25.74 	30日:25.74 	60日:21.16 	120日:32.97 	250日:54.65 		,当前价：18.72	,当前：2022-05-03 21:51:05
        huaXueYuanLiao.put("600328", "中盐化工");//238	化学原料     8.69	171.33	0.91	价格区间: 5日:94.55 	10日:63.53 	20日:50.21 	30日:50.21 	60日:55.38 	120日:55.38 	250日:42.75 		,当前价：17.89	,当前：2022-05-03 21:51:07
        huaXueYuanLiao.put("000822", "山东海化");//234	化学原料     8.51	67.31	0.98	价格区间: 5日:84.09 	10日:46.39 	20日:45.68 	30日:45.68 	60日:45.68 	120日:45.68 	250日:20.97 		,当前价：7.52	,当前：2022-05-03 21:51:08
        huaXueYuanLiao.put("603299", "苏盐井神");//232	化学原料     2.25	80.85	0.79	价格区间: 5日:35.19 	10日:44.44 	20日:63.45 	30日:64.10 	60日:67.29 	120日:67.29 	250日:65.51 		,当前价：10.46	,当前：2022-05-03 21:51:09
        huaXueYuanLiao.put("000683", "远兴能源");//232	化学原料     5.84	312.97	0.91	价格区间: 5日:75.86 	10日:37.41 	20日:31.79 	30日:31.79 	60日:31.79 	120日:47.20 	250日:53.65 		,当前价：8.52	,当前：2022-05-03 21:51:10
        huaXueYuanLiao.put("002053", "云南能投");//231	化学原料     2.8 	80.97	0.95	价格区间: 5日:61.49 	10日:36.53 	20日:21.02 	30日:8.76  	60日:10.35 	120日:20.02 	250日:26.09 		,当前价：10.64	,当前：2022-05-03 21:51:10
        huaXueYuanLiao.put("000422", "湖北宜化");//228	化学原料     1.98	157.22	0.89	价格区间: 5日:68.06 	10日:26.68 	20日:21.75 	30日:21.75 	60日:21.75 	120日:13.15 	250日:42.90 		,当前价：17.51	,当前：2022-05-03 21:51:11
        huaXueYuanLiao.put("600277", "亿利洁能");//228	化学原料     5.66	159.52	1.12	价格区间: 5日:69.62 	10日:37.16 	20日:24.34 	30日:15.45 	60日:12.67 	120日:12.67 	250日:35.98 		,当前价：4.48	,当前：2022-05-03 21:51:12
    }

    /**
     * caiJueHangYe ["采掘行业"]：10;
     */
    public static Map<String, String> caiJueHangYe = new HashMap<>();

    static {
        caiJueHangYe.put("603619", "中曼石油");//249	采掘行业     0.89	63.44	2.27	价格区间: 5日:81.20 	10日:86.46 	20日:68.37 	30日:68.37 	60日:54.08 	净利环:171.07;净利同:725.32;营收环:-0.45;营收同:83.21;净利:0.73;
        caiJueHangYe.put("000762", "西藏矿业");//178	采掘行业     2.45	178.64	1.56	价格区间: 5日:79.12 	10日:86.99 	20日:55.78 	30日:41.19 	60日:28.99 	净利环:975.84;净利同:557.72;营收环:70.13;营收同:159.18;净利:1.32;
    }

    /**
     * ranQi ["燃气"]：15;
     */
    public static Map<String, String> ranQi = new HashMap<>();

    static {
        ranQi.put("000968", "蓝焰控股");//270	燃气         0.28	104.97	1.02	价格区间: 5日:39.19 	10日:55.59 	20日:71.29 	30日:71.29 	60日:72.16 	120日:69.53 	250日:58.21 		,当前价：10.85	,当前：2022-05-03 21:53:32
        ranQi.put("600617", "国新能源");//207	燃气         7.32	60.63	1.19	价格区间: 5日:94.51 	10日:71.07 	20日:71.07 	30日:71.07 	60日:69.35 	120日:61.87 	250日:35.25 		,当前价：4.4	,当前：2022-05-03 21:53:33
        ranQi.put("603393", "新天然气");//193	燃气         0.24	88.56	0.9 	价格区间: 5日:65.33 	10日:36.83 	20日:36.83 	30日:36.83 	60日:20.94 	120日:20.94 	250日:19.12 		,当前价：20.89	,当前：2022-05-03 21:53:34
    }

    /**
     * dianLiHangYe ["电力行业"]：57;
     */
    public static Map<String, String> dianLiHangYe = new HashMap<>();

    static {
        dianLiHangYe.put("600982", "宁波能源");//240	电力行业     2.28	60.25	0.75	价格区间: 5日:25.00 	10日:36.22 	20日:36.22 	30日:23.12 	60日:32.01 	120日:37.69 	250日:43.82 		,当前价：5.39	,当前：2022-05-03 22:59:20
        dianLiHangYe.put("000993", "闽东电力");//231	电力行业     1.59	61.32	0.83	价格区间: 5日:48.85 	10日:61.59 	20日:73.38 	30日:73.38 	60日:75.33 	120日:46.44 	250日:49.89 		,当前价：13.39	,当前：2022-05-03 22:59:21
        dianLiHangYe.put("600863", "内蒙华电");//202	电力行业     1.13	233.66	1.08	价格区间: 5日:69.23 	10日:76.12 	20日:82.61 	30日:82.61 	60日:60.80 	120日:43.68 	250日:51.50 		,当前价：3.58	,当前：2022-05-03 22:59:22
    }

    /**
     * feiJinShuCaiLiao ["非金属材料"]：9;
     */
    public static Map<String, String> feiJinShuCaiLiao = new HashMap<>();

    static {
        feiJinShuCaiLiao.put("603826", "坤彩科技");//224	非金属材料   3.32	275.65	1.4 	价格区间: 5日:87.72 	10日:44.04 	20日:29.36 	30日:42.80 	60日:56.90 	120日:59.95 	250日:63.33 		,当前价：58.9	,当前：2022-05-03 23:01:07
        feiJinShuCaiLiao.put("600172", "黄河旋风");//223	非金属材料   6.82	135.57	1.18	价格区间: 5日:90.28 	10日:83.33 	20日:63.41 	30日:63.41 	60日:65.18 	120日:40.04 	250日:64.99 		,当前价：9.4	,当前：2022-05-03 23:01:08
        feiJinShuCaiLiao.put("603688", "石英股份");//223	非金属材料   5.31	229.55	1.3 	价格区间: 5日:98.95 	10日:98.95 	20日:98.96 	30日:98.96 	60日:99.01 	120日:74.28 	250日:89.21 		,当前价：65.0	,当前：2022-05-03 23:01:09
    }

    /**
     * zaoZhiYinShua ["造纸印刷"]：13;
     */
    public static Map<String, String> zaoZhiYinShua = new HashMap<>();

    static {
        zaoZhiYinShua.put("000815", "美利云  ");//270	造纸印刷     3.78	70.57	1.1 	价格区间: 5日:90.32 	10日:29.32 	20日:16.84 	30日:9.29  	60日:27.23 	120日:30.34 	250日:33.31 		,当前价：10.15	,当前：2022-05-03 23:02:46
        zaoZhiYinShua.put("603429", "集友股份");//216	造纸印刷     6.95	85.44	0.88	价格区间: 5日:62.65 	10日:51.13 	20日:54.76 	30日:54.76 	60日:50.85 	120日:24.67 	250日:21.97 		,当前价：22.47	,当前：2022-05-03 23:02:47
    }

    /**
     * jiaDianHangYe ["家电行业"]：35;
     */
    public static Map<String, String> jiaDianHangYe = new HashMap<>();

    static {
        jiaDianHangYe.put("000810", "创维数字");//219	家电行业     3.26	131.32	0.98	价格区间: 5日:78.43 	10日:47.90 	20日:35.32 	30日:35.16 	60日:35.16 	120日:59.98 	250日:62.22 		,当前价：12.35	,当前：2022-05-03 23:04:15
        jiaDianHangYe.put("605117", "德业股份");//218	家电行业     4.74	377.17	1.57	价格区间: 5日:81.11 	10日:81.11 	20日:81.92 	30日:41.85 	60日:37.97 	120日:31.50 	250日:59.35 		,当前价：221.0	,当前：2022-05-03 23:04:17
        jiaDianHangYe.put("002959", "小熊电器");//216	家电行业     10   	75.55	1   	价格区间: 5日:36.46 	10日:36.46 	20日:45.82 	30日:45.94 	60日:54.22 	120日:27.13 	250日:20.33 		,当前价：48.29	,当前：2022-05-03 23:04:20
        jiaDianHangYe.put("603868", "飞科电器");//215	家电行业     9.99	261.75	2.89	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：60.09	,当前：2022-05-03 23:04:22
        jiaDianHangYe.put("605555", "德昌股份");//212	家电行业     10.01	58.68	1.15	价格区间: 5日:67.90 	10日:67.90 	20日:67.90 	30日:66.14 	60日:51.94 	120日:22.73 	250日:22.73 		,当前价：30.89	,当前：2022-05-03 23:04:23
        jiaDianHangYe.put("603219", "富佳股份");//212	家电行业     7.84	79.44	1.3 	价格区间: 5日:89.32 	10日:77.07 	20日:77.70 	30日:84.41 	60日:85.90 	120日:54.02 	250日:54.02 		,当前价：19.81	,当前：2022-05-03 23:04:24
        jiaDianHangYe.put("002759", "天际股份");//200	家电行业     8.37	91.69	1.27	价格区间: 5日:98.48 	10日:63.93 	20日:40.25 	30日:29.98 	60日:29.98 	120日:24.38 	250日:22.69 		,当前价：22.8	,当前：2022-05-03 23:04:25
    }

    /**
     * shiPinYinLiao ["食品饮料"]：43;
     */
    public static Map<String, String> shiPinYinLiao = new HashMap<>();

    static {
        shiPinYinLiao.put("600381", "青海春天");//306	食品饮料     10.01	93.52	1.17	价格区间: 5日:100.00	10日:45.66 	20日:39.15 	30日:41.26 	60日:65.97 	120日:67.33 	250日:68.15 		,当前价：15.93	,当前：2022-05-03 23:06:14
        shiPinYinLiao.put("603317", "天味食品");//219	食品饮料     -1.5	158.38	1.41	价格区间: 5日:82.14 	10日:82.14 	20日:85.29 	30日:85.29 	60日:74.36 	120日:39.86 	250日:24.05 		,当前价：21.0	,当前：2022-05-03 23:06:15
        shiPinYinLiao.put("605089", "味知香  ");//204	食品饮料     -1.99	59.20	0.71	价格区间: 5日:85.03 	10日:40.07 	20日:40.07 	30日:40.07 	60日:40.07 	120日:17.41 	250日:18.35 		,当前价：59.2	,当前：2022-05-03 23:06:17
        shiPinYinLiao.put("002216", "三全食品");//200	食品饮料     1.55	173.20	0.62	价格区间: 5日:34.96 	10日:65.88 	20日:76.26 	30日:76.57 	60日:79.14 	120日:68.43 	250日:69.43 		,当前价：19.7	,当前：2022-05-03 23:06:18
    }

    /**
     * jiaoYunSheBei ["交运设备"]：10;
     */
    public static Map<String, String> jiaoYunSheBei = new HashMap<>();

    static {
        jiaoYunSheBei.put("603529", "爱玛科技");//197	交运设备     5.55	187.20	1.73	价格区间: 5日:94.74 	10日:74.63 	20日:73.61 	30日:80.34 	60日:82.68 	120日:60.39 	250日:25.95 		,当前价：45.61	,当前：2022-05-03 23:08:46
        jiaoYunSheBei.put("603129", "春风动力");//196	交运设备     7.5 	175.29	1.01	价格区间: 5日:90.91 	10日:92.02 	20日:92.03 	30日:71.62 	60日:44.84 	120日:24.85 	250日:24.85 		,当前价：116.8	,当前：2022-05-03 23:08:48
    }

    /**
     * xiaoJinShu ["小金属"]：23;
     */
    public static Map<String, String> xiaoJinShu = new HashMap<>();

    static {
        xiaoJinShu.put("603399", "吉翔股份");//372	小金属       4.77	106.18	1.12	价格区间: 5日:84.31 	10日:36.10 	20日:34.96 	30日:34.96 	60日:55.56 	120日:64.70 	250日:67.91 		,当前价：20.88	,当前：2022-05-03 23:10:18
        xiaoJinShu.put("002738", "中矿资源");//282	小金属       6.55	272.21	1.55	价格区间: 5日:95.84 	10日:95.84 	20日:60.32 	30日:49.19 	60日:49.63 	120日:52.93 	250日:66.31 		,当前价：83.59	,当前：2022-05-03 23:10:19
        xiaoJinShu.put("000960", "锡业股份");//206	小金属       3.05	299.04	0.83	价格区间: 5日:89.38 	10日:34.53 	20日:28.90 	30日:28.90 	60日:19.61 	120日:22.33 	250日:37.18 		,当前价：17.92	,当前：2022-05-03 23:10:20
        xiaoJinShu.put("002056", "横店东磁");//202	小金属       3.1 	248.72	1.65	价格区间: 5日:97.20 	10日:97.20 	20日:97.20 	30日:97.20 	60日:57.56 	120日:26.63 	250日:30.49 		,当前价：15.29	,当前：2022-05-03 23:10:21
    }

    /**
     * jiaYongQingGong ["家用轻工"]：5;
     */
    public static Map<String, String> jiaYongQingGong = new HashMap<>();

    static {
        jiaYongQingGong.put("603398", "沐邦高科");//232	家用轻工     10.02	76.34	1.55	价格区间: 5日:100.00	10日:76.09 	20日:73.03 	30日:73.03 	60日:77.88 	120日:72.13 	250日:80.32 		,当前价：22.28	,当前：2022-05-03 23:13:38
        jiaYongQingGong.put("002605", "姚记科技");//184	家用轻工     6.79	59.23	1.05	价格区间: 5日:57.92 	10日:28.54 	20日:12.76 	30日:12.76 	60日:8.58  	120日:6.05  	250日:6.05  		,当前价：14.63	,当前：2022-05-03 23:13:39
    }

    /**
     * dianZiHuaXuePin ["电子化学品"]：3;
     */
    public static Map<String, String> dianZiHuaXuePin = new HashMap<>();

    static {
        dianZiHuaXuePin.put("603078", "江化微  ");//214	电子化学品   -0.46	58.83	2.3 	价格区间: 5日:83.99 	10日:72.63 	20日:67.19 	30日:57.94 	60日:55.27 	净利环:15.05;净利同:253.78;营收环:-3.45;营收同:55.98;
    }

    /**
     * youSeJinShu ["有色金属"]：37;
     */
    public static Map<String, String> youSeJinShu = new HashMap<>();

    static {
        youSeJinShu.put("000807", "云铝股份");//237	有色金属     3.14	364.48	0.82	价格区间: 5日:78.57 	10日:35.84 	20日:28.21 	30日:25.35 	60日:18.87 	120日:18.87 	250日:9.86  		,当前价：10.51	,当前：2022-05-03 23:16:54
        youSeJinShu.put("600331", "宏达股份");//212	有色金属     3.17	59.54	0.57	价格区间: 5日:41.38 	10日:25.35 	20日:21.69 	30日:21.69 	60日:21.69 	120日:21.69 	250日:26.07 		,当前价：2.93	,当前：2022-05-03 23:16:55
        youSeJinShu.put("000933", "神火股份");//211	有色金属     null	269.67	null	价格区间: 5日:0.00  	10日:0.00  	20日:0.00  	30日:25.58 	60日:28.40 	120日:48.45 	250日:39.61 		,当前价：null	,当前：2022-05-03 23:16:57
        youSeJinShu.put("000630", "铜陵有色");//208	有色金属     2.94	368.43	0.83	价格区间: 5日:70.00 	10日:35.00 	20日:26.92 	30日:26.92 	60日:26.92 	120日:26.92 	250日:28.16 		,当前价：3.5	,当前：2022-05-03 23:16:57
        youSeJinShu.put("000688", "国城矿业");//204	有色金属     0.79	160.36	0.68	价格区间: 5日:47.06 	10日:32.59 	20日:20.95 	30日:17.67 	60日:27.84 	120日:46.08 	250日:49.48 		,当前价：14.1	,当前：2022-05-03 23:16:58
        youSeJinShu.put("601168", "西部矿业");//201	有色金属     3.19	285.25	0.77	价格区间: 5日:65.69 	10日:37.12 	20日:36.51 	30日:32.78 	60日:20.00 	120日:20.00 	250日:17.48 		,当前价：11.97	,当前：2022-05-03 23:16:59
    }

    /**
     * huaXueZhiPin ["化学制品"]：36;
     */
    public static Map<String, String> huaXueZhiPin = new HashMap<>();

    static {
        huaXueZhiPin.put("603906", "龙蟠科技");//224	化学制品     5.41	148.29	0.94	价格区间: 5日:43.42 	10日:43.83 	20日:65.19 	30日:65.19 	60日:62.19 	120日:16.12 	250日:22.61 		,当前价：30.76	,当前：2022-05-03 23:19:35
        huaXueZhiPin.put("002497", "雅化集团");//214	化学制品     3.11	306.12	1.01	价格区间: 5日:89.52 	10日:45.85 	20日:39.96 	30日:37.26 	60日:25.72 	120日:25.72 	250日:33.38 		,当前价：26.56	,当前：2022-05-03 23:19:36
        huaXueZhiPin.put("002810", "山东赫达");//205	化学制品     4.5 	150.36	1.34	价格区间: 5日:95.93 	10日:95.93 	20日:76.99 	30日:76.87 	60日:44.01 	120日:34.23 	250日:34.23 		,当前价：43.89	,当前：2022-05-03 23:19:37
        huaXueZhiPin.put("605399", "晨光新材");//205	化学制品     8.11	74.63	0.94	价格区间: 5日:60.40 	10日:43.34 	20日:41.21 	30日:40.19 	60日:31.57 	120日:25.71 	250日:60.33 		,当前价：40.38	,当前：2022-05-03 23:19:38
        huaXueZhiPin.put("600160", "巨化股份");//204	化学制品     4.03	306.42	1   	价格区间: 5日:67.52 	10日:55.24 	20日:42.25 	30日:37.44 	60日:26.64 	120日:26.64 	250日:24.88 		,当前价：11.35	,当前：2022-05-03 23:19:39
        huaXueZhiPin.put("600230", "沧州大化");//200	化学制品     3.82	54.58	0.69	价格区间: 5日:52.86 	10日:24.88 	20日:20.85 	30日:20.85 	60日:15.54 	120日:15.54 	250日:21.32 		,当前价：13.04	,当前：2022-05-03 23:19:40
    }

    /**
     * qiCheFuWu ["汽车服务"]：4;
     */
    public static Map<String, String> qiCheFuWu = new HashMap<>();

    static {
        qiCheFuWu.put("600335", "国机汽车");//226	汽车服务     6.75	89.89	0.76	价格区间: 5日:42.75 	10日:17.78 	20日:17.50 	30日:10.33 	60日:10.33 	120日:9.59  	250日:22.01 		,当前价：6.17	,当前：2022-05-03 23:21:31
    }

    /**
     * zhuangXiuJianCai ["装修建材"]：19;
     */
    public static Map<String, String> zhuangXiuJianCai = new HashMap<>();

    static {
        zhuangXiuJianCai.put("002572", "索菲亚  ");//209	装修建材     7.09	186.12	1.55	价格区间: 5日:93.80 	10日:63.02 	20日:60.65 	30日:64.07 	60日:50.87 	120日:48.35 	250日:27.95 		,当前价：20.4	,当前：2022-05-03 23:22:58
    }

    /**
     * tongXinFuWu ["通信服务"]：9;
     */
    public static Map<String, String> tongXinFuWu = new HashMap<>();

    static {
        tongXinFuWu.put("002544", "杰赛科技");//201	通信服务     10.02	128.98	0.97	价格区间: 5日:57.43 	10日:35.17 	20日:35.17 	30日:34.74 	60日:27.75 	120日:21.09 	250日:37.11 		,当前价：18.89	,当前：2022-05-03 23:24:08
    }

    /**
     * zhuangXiuZhuangShi ["装修装饰"]：3;
     */
    public static Map<String, String> zhuangXiuZhuangShi = new HashMap<>();

    static {
        zhuangXiuZhuangShi.put("002375", "亚厦股份");//150	装修装饰     7.87	62.44	1.2 	价格区间: 5日:68.66 	10日:42.20 	20日:26.14 	30日:20.54 	60日:15.65 	120日:10.57 	250日:9.58  		,当前价：4.66	,当前：2022-05-03 23:25:00
    }

    /**
     * boLiBoQian ["玻璃玻纤"]：12;
     */
    public static Map<String, String> boLiBoQian = new HashMap<>();

    static {
        boLiBoQian.put("002163", "海南发展");//208	玻璃玻纤     2.8 	91.52	0.63	价格区间: 5日:33.49 	10日:28.76 	20日:42.70 	30日:43.08 	60日:46.38 	120日:42.83 	250日:19.61 		,当前价：11.39	,当前：2022-05-03 23:26:52
    }

    /**
     * zhengQuan ["证券"]：48;
     */
    public static Map<String, String> zhengQuan = new HashMap<>();

    static {
        zhengQuan.put("002945", "华林证券");//220	证券         10   	374.22	1.1 	价格区间: 5日:37.95 	10日:37.95 	20日:31.07 	30日:20.30 	60日:20.30 	120日:40.68 	250日:41.07 		,当前价：13.86	,当前：2022-05-03 23:28:46
        zhengQuan.put("002670", "国盛金控");//170	证券         3.22	161.19	0.65	价格区间: 5日:17.56 	10日:17.22 	20日:12.68 	30日:12.68 	60日:15.36 	120日:15.36 	250日:9.49  		,当前价：8.33	,当前：2022-05-03 23:28:48
        zhengQuan.put("601696", "中银证券");//168	证券         1.46	347.81	0.88	价格区间: 5日:11.52 	10日:11.52 	20日:8.14  	30日:14.00 	60日:38.70 	120日:38.70 	250日:19.15 		,当前价：12.52	,当前：2022-05-03 23:28:49
        zhengQuan.put("601236", "红塔证券");//150	证券         5.12	426.40	0.85	价格区间: 5日:23.14 	10日:20.27 	20日:18.79 	30日:18.79 	60日:18.79 	120日:14.01 	250日:9.92  		,当前价：9.04	,当前：2022-05-03 23:28:51
        zhengQuan.put("600155", "华创阳安");//147	证券         2.77	135.69	0.9 	价格区间: 5日:25.00 	10日:15.50 	20日:14.93 	30日:13.99 	60日:13.99 	120日:13.94 	250日:7.84  		,当前价：7.8	,当前：2022-05-03 23:28:52
        zhengQuan.put("000776", "广发证券");//146	证券         6.78	1224.71	1.57	价格区间: 5日:85.20 	10日:54.40 	20日:43.38 	30日:42.28 	60日:20.90 	120日:13.03 	250日:15.79 		,当前价：16.07	,当前：2022-05-03 23:28:53
        zhengQuan.put("000712", "锦龙股份");//146	证券         3.06	111.55	0.97	价格区间: 5日:32.79 	10日:24.10 	20日:17.54 	30日:17.54 	60日:13.82 	120日:13.82 	250日:12.08 		,当前价：12.45	,当前：2022-05-03 23:28:54
    }

    /**
     * jiaoYu ["教育"]：3;
     */
    public static Map<String, String> jiaoYu = new HashMap<>();

    static {
        jiaoYu.put("600880", "博瑞传播");//253	教育         10.09	54.89	0.55	价格区间: 5日:73.17 	10日:34.48 	20日:17.00 	30日:17.00 	60日:13.61 	120日:25.87 	250日:27.93 		,当前价：5.02	,当前：2022-05-03 23:31:13
        jiaoYu.put("003032", "传智教育");//203	教育         7.13	53.85	0.87	价格区间: 5日:77.29 	10日:31.68 	20日:31.40 	30日:31.40 	60日:24.74 	120日:14.89 	250日:7.02  		,当前价：13.38	,当前：2022-05-03 23:31:14
    }

    /**
     * meiRongHuLi ["美容护理"]：8;
     */
    public static Map<String, String> meiRongHuLi = new HashMap<>();

    static {
        meiRongHuLi.put("000615", "奥园美谷");//252	美容护理     1.54	61.79	1.15	价格区间: 5日:24.44 	10日:16.52 	20日:16.52 	30日:18.48 	60日:27.79 	120日:13.97 	250日:4.63  		,当前价：7.91	,当前：2022-05-03 23:32:23
        meiRongHuLi.put("603605", "珀莱雅  ");//181	美容护理     2.96	404.95	0.88	价格区间: 5日:86.05 	10日:90.27 	20日:91.89 	30日:93.67 	60日:94.83 	120日:76.12 	250日:69.14 		,当前价：201.46	,当前：2022-05-03 23:32:24
    }

    /**
     * wenHuaChuanMei ["文化传媒"]：38;
     */
    public static Map<String, String> wenHuaChuanMei = new HashMap<>();

    static {
        wenHuaChuanMei.put("600996", "贵广网络");//313	文化传媒     9.97	71.66	1.24	价格区间: 5日:83.33 	10日:20.25 	20日:20.00 	30日:20.00 	60日:14.60 	120日:35.09 	250日:35.71 		,当前价：6.73	,当前：2022-05-03 23:34:39
        wenHuaChuanMei.put("000665", "湖北广电");//312	文化传媒     10.06	85.46	0.92	价格区间: 5日:71.55 	10日:30.07 	20日:19.58 	30日:28.96 	60日:31.80 	120日:44.39 	250日:44.56 		,当前价：7.55	,当前：2022-05-03 23:34:40
        wenHuaChuanMei.put("600936", "广西广电");//250	文化传媒     7.34	51.30	0.88	价格区间: 5日:59.09 	10日:16.46 	20日:16.46 	30日:16.46 	60日:16.35 	120日:28.88 	250日:29.26 		,当前价：3.07	,当前：2022-05-03 23:34:41
        wenHuaChuanMei.put("002400", "省广集团");//204	文化传媒     9.97	73.05	0.83	价格区间: 5日:100.00	10日:51.30 	20日:32.42 	30日:32.42 	60日:18.55 	120日:18.55 	250日:18.55 		,当前价：4.19	,当前：2022-05-03 23:34:42
        wenHuaChuanMei.put("000681", "视觉中国");//203	文化传媒     8.64	83.65	1.47	价格区间: 5日:79.57 	10日:38.05 	20日:16.46 	30日:16.46 	60日:16.46 	120日:8.63  	250日:8.63  		,当前价：11.94	,当前：2022-05-03 23:34:43
        wenHuaChuanMei.put("603466", "风语筑  ");//195	文化传媒     5.55	71.40	1.43	价格区间: 5日:65.59 	10日:29.35 	20日:17.11 	30日:17.11 	60日:9.05  	120日:8.21  	250日:13.47 		,当前价：16.92	,当前：2022-05-03 23:34:44
    }

    /**
     * duoYuanJinRong ["多元金融"]：19;
     */
    public static Map<String, String> duoYuanJinRong = new HashMap<>();

    static {
        duoYuanJinRong.put("600053", "九鼎投资");//193	多元金融     7.81	59.87	1.19	价格区间: 5日:90.51 	10日:65.90 	20日:24.16 	30日:22.34 	60日:15.04 	120日:15.04 	250日:12.64 		,当前价：13.81	,当前：2022-05-03 23:37:11
    }

    /**
     * yiLiaoQiXie ["医疗器械"]：16;
     */
    public static Map<String, String> yiLiaoQiXie = new HashMap<>();

    static {
        yiLiaoQiXie.put("002432", "九安医疗");//386	医疗器械     0.21	391.13	2.34	价格区间: 5日:76.22 	10日:72.38 	20日:54.22 	30日:59.49 	60日:67.04 	净利环:1567.05;净利同:37527.35;营收环:1252.94;营收同:6646.79;
        yiLiaoQiXie.put("002932", "明德生物");//308	医疗器械     10   	137.67	4.29	价格区间: 5日:100.00	10日:100.00	20日:94.35 	30日:95.59 	60日:96.71 	净利环:240.63;净利同:307.05;营收环:178.99;营收同:267.41;
        yiLiaoQiXie.put("603122", "合富中国");//244	医疗器械     5.79	56.05	9.35	价格区间: 5日:88.86 	10日:73.19 	20日:36.24 	30日:18.68 	60日:40.69 	净利环:-42.71;净利同:7.24;营收环:5.49;营收同:19.67;
        yiLiaoQiXie.put("603387", "基蛋生物");//216	医疗器械     2.35	69.60	2.91	价格区间: 5日:89.69 	10日:89.69 	20日:71.31 	30日:59.75 	60日:52.92 	净利环:49.94;净利同:249.06;营收环:19.01;营收同:106.80;
        yiLiaoQiXie.put("600587", "新华医疗");//212	医疗器械     3.16	79.43	9.48	价格区间: 5日:85.79 	10日:62.59 	20日:35.43 	30日:25.17 	60日:25.17 	净利环:7.61;净利同:-12.84;营收环:-0.67;营收同:-16.05;
        yiLiaoQiXie.put("600055", "万东医疗");//206	医疗器械     -3.01	145.18	1.54	价格区间: 5日:73.81 	10日:41.39 	20日:28.64 	30日:21.23 	60日:14.79 	净利环:-60.83;净利同:-49.73;营收环:-40.75;营收同:-12.25;
        yiLiaoQiXie.put("603392", "万泰生物");//202	医疗器械     -1.12	1441.34	1.72	价格区间: 5日:60.24 	10日:39.01 	20日:26.37 	30日:26.37 	60日:40.17 	净利环:59.72;净利同:360.18;营收环:47.20;营收同:284.85;
        yiLiaoQiXie.put("605369", "拱东医疗");//199	医疗器械     2.31	130.84	2.83	价格区间: 5日:88.46 	10日:63.41 	20日:40.85 	30日:40.85 	60日:35.08 	净利环:61.01;净利同:19.77;营收环:0.07;营收同:32.71;
    }

    /**
     * shengWuZhiPin ["生物制品"]：11;
     */
    public static Map<String, String> shengWuZhiPin = new HashMap<>();

    static {
        shengWuZhiPin.put("002581", "未名医药");//199	生物制品     2.83	108.00	0.75	价格区间: 5日:63.64 	10日:36.70 	20日:34.27 	30日:34.27 	60日:34.27 	120日:20.29 	250日:43.27 		,当前价：16.37	,当前：2022-05-03 23:41:17
        shengWuZhiPin.put("002038", "双鹭药业");//178	生物制品     5.41	104.07	1.1 	价格区间: 5日:65.28 	10日:65.28 	20日:58.33 	30日:58.33 	60日:58.33 	120日:45.82 	250日:31.34 		,当前价：10.13	,当前：2022-05-03 23:41:18
        shengWuZhiPin.put("000661", "长春高新");//166	生物制品     2.03	635.49	0.95	价格区间: 5日:94.91 	10日:94.91 	20日:62.45 	30日:50.89 	60日:41.37 	120日:14.06 	250日:6.49  		,当前价：157.02	,当前：2022-05-03 23:41:19
    }

    /**
     * zhuanYeFuWu ["专业服务"]：4;
     */
    public static Map<String, String> zhuanYeFuWu = new HashMap<>();

    static {
        zhuanYeFuWu.put("003035", "南网能源");//143	专业服务     2.5 	217.42	0.77	价格区间: 5日:56.38 	10日:37.86 	20日:32.52 	30日:23.66 	60日:23.25 	120日:11.21 	250日:7.57  		,当前价：5.74	,当前：2022-05-03 23:42:45
    }

    /**
     * huanBaoHangYe ["环保行业"]：17;
     */
    public static Map<String, String> huanBaoHangYe = new HashMap<>();

    static {
        huanBaoHangYe.put("002645", "华宏科技");//191	环保行业     9.96	104.72	1.78	价格区间: 5日:99.68 	10日:65.15 	20日:56.03 	30日:55.83 	60日:32.08 	120日:22.95 	250日:32.16 		,当前价：17.99	,当前：2022-05-03 23:44:09
    }

    /**
     * yiLiaoFuWu ["医疗服务"]：9;
     */
    public static Map<String, String> yiLiaoFuWu = new HashMap<>();

    static {
        yiLiaoFuWu.put("000516", "国际医学");//224	医疗服务     5.55	203.47	2.42	价格区间: 5日:90.69 	10日:90.69 	20日:89.56 	30日:89.56 	60日:89.60 	净利环:-80.58;净利同:-134.01;营收环:-65.06;营收同:-51.78;
        yiLiaoFuWu.put("603882", "金域医学");//217	医疗服务     1.45	410.83	2.84	价格区间: 5日:81.12 	10日:84.21 	20日:84.21 	30日:84.21 	60日:84.21 	净利环:55.31;净利同:58.00;营收环:27.82;营收同:58.70;
        yiLiaoFuWu.put("603108", "润达医疗");//211	医疗服务     9.99	63.81	8.62	价格区间: 5日:100.00	10日:100.00	20日:68.84 	30日:49.79 	60日:49.79 	净利环:-24.48;净利同:-53.96;营收环:3.91;营收同:7.34;
        yiLiaoFuWu.put("603127", "昭衍新药");//182	医疗服务     -3.17	354.67	1.06	价格区间: 5日:31.88 	10日:37.45 	20日:17.17 	30日:13.08 	60日:18.27 	净利环:-59.49;净利同:34.27;营收环:-58.94;营收同:34.82;
        yiLiaoFuWu.put("603259", "药明康德");//177	医疗服务     -3.34	2801.62	1.4 	价格区间: 5日:1.41  	10日:1.35  	20日:0.81  	30日:0.58  	60日:32.98 	净利环:7.04;净利同:9.54;营收环:32.81;营收同:71.18;
        yiLiaoFuWu.put("600763", "通策医疗");//173	医疗服务     -0.93	405.16	1.7 	价格区间: 5日:74.17 	10日:42.80 	20日:36.57 	30日:36.57 	60日:27.50 	净利环:101.28;净利同:1.25;营收环:1.60;营收同:3.74;
        yiLiaoFuWu.put("002821", "凯莱英  ");//166	医疗服务     -3.28	663.50	1.32	价格区间: 5日:12.98 	10日:4.99  	20日:2.41  	30日:2.07  	60日:2.07  	净利环:33.38;净利同:223.59;营收环:20.16;营收同:165.28;
    }

    /**
     * tongYongSheBei ["通用设备"]：26;
     */
    public static Map<String, String> tongYongSheBei = new HashMap<>();

    static {
        tongYongSheBei.put("600860", "京城股份");//283	通用设备     5.96	76.73	1.15	价格区间: 5日:46.89 	10日:27.08 	20日:16.84 	30日:12.12 	60日:17.30 	120日:43.42 	250日:46.23 		,当前价：15.82	,当前：2022-05-03 23:47:25
        tongYongSheBei.put("002639", "雪人股份");//263	通用设备     7.72	77.65	1.04	价格区间: 5日:47.22 	10日:24.43 	20日:17.71 	30日:15.04 	60日:15.04 	120日:22.15 	250日:29.53 		,当前价：10.05	,当前：2022-05-03 23:47:26
    }

    /**
     * baoZhuangCaiLiao ["包装材料"]：6;
     */
    public static Map<String, String> baoZhuangCaiLiao = new HashMap<>();

    static {
        baoZhuangCaiLiao.put("601515", "东风股份");//177	包装材料     4.11	105.05	0.91	价格区间: 5日:98.44 	10日:69.23 	20日:51.22 	30日:55.88 	60日:65.12 	120日:28.50 	250日:29.57 		,当前价：6.84	,当前：2022-05-03 23:48:55
    }

    /**
     * nengYuanJinShu ["能源金属"]：6;
     */
    public static Map<String, String> nengYuanJinShu = new HashMap<>();

    static {
        nengYuanJinShu.put("002466", "天齐锂业");//211	能源金属     10   	1128.95	1.39	价格区间: 5日:100.00	10日:100.00	20日:66.62 	30日:58.61 	60日:41.37 	120日:27.49 	250日:35.86 		,当前价：76.43	,当前：2022-05-03 23:50:30
        nengYuanJinShu.put("002240", "盛新锂能");//209	能源金属     7.72	384.13	1.9 	价格区间: 5日:93.28 	10日:93.28 	20日:52.00 	30日:42.13 	60日:41.93 	120日:34.02 	250日:40.68 		,当前价：44.39	,当前：2022-05-03 23:50:31
        nengYuanJinShu.put("603799", "华友钴业");//190	能源金属     5.03	1005.22	1.08	价格区间: 5日:96.49 	10日:93.71 	20日:44.97 	30日:37.65 	60日:25.07 	120日:19.25 	250日:17.23 		,当前价：82.31	,当前：2022-05-03 23:50:32
        nengYuanJinShu.put("002460", "赣锋锂业");//188	能源金属     4.55	1590.86	1.23	价格区间: 5日:95.71 	10日:78.82 	20日:49.83 	30日:47.31 	60日:32.80 	120日:23.58 	250日:15.44 		,当前价：110.67	,当前：2022-05-03 23:50:34
    }

    /**
     * huLianWangFuWu ["互联网服务"]：26;
     */
    public static Map<String, String> huLianWangFuWu = new HashMap<>();

    static {
        huLianWangFuWu.put("603636", "南威软件");//233	互联网服务   2.71	56.07	1.55	价格区间: 5日:84.47 	10日:28.10 	20日:22.93 	30日:10.78 	60日:10.78 	净利环:-118.02;净利同:-244.31;营收环:-88.20;营收同:-4.89;
        huLianWangFuWu.put("603171", "税友股份");//202	互联网服务   -0.12	104.92	1.48	价格区间: 5日:74.44 	10日:27.20 	20日:22.25 	30日:17.60 	60日:10.71 	净利环:-72.81;净利同:-16.59;营收环:-48.25;营收同:8.05;
        huLianWangFuWu.put("600228", "返利科技");//201	互联网服务   10   	59.77	28.28	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:45.82 	净利环:-114.08;净利同:-136.24;营收环:-55.30;营收同:-30.78;
        huLianWangFuWu.put("600797", "浙大网新");//191	互联网服务   1.95	53.84	1.53	价格区间: 5日:84.00 	10日:39.38 	20日:26.25 	30日:22.26 	60日:13.58 	净利环:100.96;净利同:120.12;营收环:-35.15;营收同:30.72;
    }

    /**
     * tongXinSheBei ["通信设备"]：27;
     */
    public static Map<String, String> tongXinSheBei = new HashMap<>();

    static {
        tongXinSheBei.put("002104", "恒宝股份");//239	通信设备     1.91	55.75	1.19	价格区间: 5日:59.63 	10日:22.65 	20日:9.31  	30日:9.31  	60日:6.11  	120日:20.16 	250日:23.87 		,当前价：8.0	,当前：2022-05-03 23:54:42
        tongXinSheBei.put("003040", "楚天龙  ");//231	通信设备     2.25	81.67	0.69	价格区间: 5日:44.15 	10日:15.60 	20日:14.72 	30日:14.72 	60日:13.90 	120日:9.63  	250日:5.95  		,当前价：17.71	,当前：2022-05-03 23:54:44
        tongXinSheBei.put("600522", "中天科技");//212	通信设备     6.17	558.02	0.93	价格区间: 5日:95.81 	10日:95.81 	20日:74.25 	30日:49.00 	60日:43.07 	120日:44.99 	250日:68.83 		,当前价：16.35	,当前：2022-05-03 23:54:45
    }

    /**
     * qiCheLingBuJian ["汽车零部件"]：46;
     */
    public static Map<String, String> qiCheLingBuJian = new HashMap<>();

    static {
        qiCheLingBuJian.put("002537", "海联金汇");//271	汽车零部件   4.79	87.35	0.9 	价格区间: 5日:60.98 	10日:26.22 	20日:11.83 	30日:11.30 	60日:11.30 	120日:24.78 	250日:28.95 		,当前价：7.44	,当前：2022-05-03 23:57:31
        qiCheLingBuJian.put("002865", "钧达股份");//263	汽车零部件   7.68	100.60	1.03	价格区间: 5日:95.14 	10日:65.89 	20日:49.19 	30日:39.93 	60日:39.93 	120日:55.42 	250日:67.33 		,当前价：71.08	,当前：2022-05-03 23:57:32
        qiCheLingBuJian.put("603348", "文灿股份");//229	汽车零部件   7.27	101.74	1.22	价格区间: 5日:90.36 	10日:90.39 	20日:77.20 	30日:74.16 	60日:44.93 	120日:24.29 	250日:34.05 		,当前价：38.81	,当前：2022-05-03 23:57:33
        qiCheLingBuJian.put("603596", "伯特利  ");//228	汽车零部件   10   	235.07	1   	价格区间: 5日:100.00	10日:73.80 	20日:49.24 	30日:27.71 	60日:27.71 	120日:23.25 	250日:48.47 		,当前价：57.55	,当前：2022-05-03 23:57:34
        qiCheLingBuJian.put("603179", "新泉股份");//223	汽车零部件   6.66	121.83	0.88	价格区间: 5日:93.60 	10日:93.60 	20日:69.18 	30日:45.56 	60日:45.56 	120日:33.06 	250日:33.06 		,当前价：25.0	,当前：2022-05-03 23:57:35
        qiCheLingBuJian.put("601689", "拓普集团");//217	汽车零部件   3.42	579.35	0.71	价格区间: 5日:92.54 	10日:92.54 	20日:55.28 	30日:50.53 	60日:45.44 	120日:36.90 	250日:62.54 		,当前价：52.57	,当前：2022-05-03 23:57:36
    }

    /**
     * qiCheZhengChe ["汽车整车"]：17;
     */
    public static Map<String, String> qiCheZhengChe = new HashMap<>();

    static {
        qiCheZhengChe.put("601127", "小康股份");//191	汽车整车     7.67	528.61	0.9 	价格区间: 5日:59.90 	10日:48.39 	20日:44.87 	30日:44.87 	60日:37.19 	120日:13.69 	250日:15.93 		,当前价：38.87	,当前：2022-05-03 23:59:01
        qiCheZhengChe.put("601238", "广汽集团");//180	汽车整车     5.43	1280.79	1.56	价格区间: 5日:98.58 	10日:95.85 	20日:95.85 	30日:95.85 	60日:52.00 	120日:24.62 	250日:19.28 		,当前价：12.24	,当前：2022-05-03 23:59:02
        qiCheZhengChe.put("002594", "比亚迪  ");//180	汽车整车     4.75	7074.08	1.5 	价格区间: 5日:96.68 	10日:75.38 	20日:75.38 	30日:75.15 	60日:71.15 	120日:27.85 	250日:53.08 		,当前价：243.0	,当前：2022-05-03 23:59:04
    }

    /**
     * zhuanYongSheBei ["专用设备"]：40;
     */
    public static Map<String, String> zhuanYongSheBei = new HashMap<>();

    static {
        zhuanYongSheBei.put("000519", "中兵红箭");//232	专用设备     5.89	290.35	1.13	价格区间: 5日:96.47 	10日:92.93 	20日:55.30 	30日:55.30 	60日:56.54 	120日:25.77 	250日:51.87 		,当前价：20.85	,当前：2022-05-04 00:00:18
        zhuanYongSheBei.put("603169", "兰石重装");//225	专用设备     6.31	85.82	0.85	价格区间: 5日:47.93 	10日:21.64 	20日:21.64 	30日:14.83 	60日:13.78 	120日:19.10 	250日:28.48 		,当前价：6.57	,当前：2022-05-04 00:00:20
        zhuanYongSheBei.put("600545", "卓郎智能");//207	专用设备     10.18	59.52	3.84	价格区间: 5日:100.00	10日:85.90 	20日:58.26 	30日:58.26 	60日:58.26 	120日:58.26 	250日:59.38 		,当前价：3.14	,当前：2022-05-04 00:00:21
        zhuanYongSheBei.put("601038", "一拖股份");//204	专用设备     1.89	114.95	1.76	价格区间: 5日:91.53 	10日:47.01 	20日:43.91 	30日:43.47 	60日:22.94 	120日:22.94 	250日:15.86 		,当前价：10.23	,当前：2022-05-04 00:00:22
    }

    /**
     * gongChengJiXie ["工程机械"]：14;
     */
    public static Map<String, String> gongChengJiXie = new HashMap<>();

    static {
        gongChengJiXie.put("002204", "大连重工");//161	工程机械     2.7 	66.05	0.68	价格区间: 5日:47.54 	10日:25.89 	20日:25.89 	30日:25.89 	60日:21.64 	120日:19.73 	250日:19.73 		,当前价：3.42	,当前：2022-05-04 00:01:54
        gongChengJiXie.put("000680", "山推股份");//161	工程机械     1.37	55.57	1   	价格区间: 5日:47.27 	10日:25.49 	20日:21.67 	30日:21.67 	60日:21.67 	120日:21.67 	250日:18.06 		,当前价：3.7	,当前：2022-05-04 00:01:56
        gongChengJiXie.put("600031", "三一重工");//160	工程机械     4.56	1401.39	1.31	价格区间: 5日:86.49 	10日:51.75 	20日:39.59 	30日:39.59 	60日:26.34 	120日:17.89 	250日:10.38 		,当前价：16.5	,当前：2022-05-04 00:01:57
    }

    /**
     * suLiaoZhiPin ["塑料制品"]：10;
     */
    public static Map<String, String> suLiaoZhiPin = new HashMap<>();

    static {
        suLiaoZhiPin.put("002585", "双星新材");//186	塑料制品     5.02	154.71	1.11	价格区间: 5日:85.27 	10日:49.61 	20日:29.80 	30日:19.27 	60日:13.50 	120日:10.11 	250日:11.37 		,当前价：13.38	,当前：2022-05-04 00:02:52
    }

    /**
     * chuanBoZhiZao ["船舶制造"]：5;
     */
    public static Map<String, String> chuanBoZhiZao = new HashMap<>();

    static {
        chuanBoZhiZao.put("601890", "亚星锚链");//156	船舶制造     3.72	58.91	0.75	价格区间: 5日:54.44 	10日:19.84 	20日:18.08 	30日:18.08 	60日:13.61 	120日:10.10 	250日:15.01 		,当前价：6.14	,当前：2022-05-04 00:03:57
    }

    /**
     * xiangJiaoZhiPin ["橡胶制品"]：11;
     */
    public static Map<String, String> xiangJiaoZhiPin = new HashMap<>();

    static {
        xiangJiaoZhiPin.put("002068", "黑猫股份");//190	橡胶制品     0.37	60.22	0.95	价格区间: 5日:28.14 	10日:23.27 	20日:17.17 	30日:15.38 	60日:15.38 	120日:36.21 	250日:36.21 		,当前价：8.05	,当前：2022-05-04 00:06:32
    }

    /**
     * dianWangSheBei ["电网设备"]：31;
     */
    public static Map<String, String> dianWangSheBei = new HashMap<>();

    static {
        dianWangSheBei.put("603070", "万控智造");//227	电网设备     5.23	67.77	0.88	价格区间: 5日:19.82 	10日:10.07 	20日:4.96  	30日:3.35  	60日:17.90 	120日:17.90 	250日:17.90 		,当前价：16.9	,当前：2022-05-04 00:07:53
        dianWangSheBei.put("000720", "新能泰山");//221	电网设备     10.08	67.58	1.66	价格区间: 5日:100.00	10日:100.00	20日:67.95 	30日:67.95 	60日:69.14 	120日:51.38 	250日:58.91 		,当前价：5.24	,当前：2022-05-04 00:07:55
        dianWangSheBei.put("603606", "东方电缆");//201	电网设备     4.69	325.50	1.31	价格区间: 5日:90.79 	10日:90.79 	20日:54.79 	30日:38.28 	60日:32.72 	120日:32.72 	250日:63.15 		,当前价：47.33	,当前：2022-05-04 00:07:56
    }

    /**
     * yiQiYiBiao ["仪器仪表"]：3;
     */
    public static Map<String, String> yiQiYiBiao = new HashMap<>();

    static {
        yiQiYiBiao.put("603100", "川仪股份");//167	仪器仪表     -1.04	56.52	1.84	价格区间: 5日:86.30 	10日:86.30 	20日:86.30 	30日:60.21 	60日:33.33 	净利环:-11.53;净利同:-27.96;营收环:-15.75;营收同:30.30;
    }

    /**
     * jiSuanJiSheBei ["计算机设备"]：11;
     */
    public static Map<String, String> jiSuanJiSheBei = new HashMap<>();

    static {
        jiSuanJiSheBei.put("002197", "证通电子");//221	计算机设备   2.51	50.13	0.96	价格区间: 5日:60.66 	10日:22.91 	20日:13.26 	30日:13.26 	60日:7.71  	120日:13.56 	250日:14.23 		,当前价：8.16	,当前：2022-05-04 00:10:08
    }

    /**
     * ruanJianKaiFa ["软件开发"]：20;
     */
    public static Map<String, String> ruanJianKaiFa = new HashMap<>();

    static {
        ruanJianKaiFa.put("600602", "云赛智联");//242	软件开发     1.88	88.90	2.09	价格区间: 5日:81.05 	10日:37.38 	20日:30.20 	30日:15.98 	60日:15.98 	净利环:-15.23;净利同:97.99;营收环:-21.40;营收同:-3.50;
        ruanJianKaiFa.put("002280", "联络互动");//242	软件开发     7.3 	83.17	5.94	价格区间: 5日:90.63 	10日:82.08 	20日:56.49 	30日:41.23 	60日:42.59 	净利环:-158.39;净利同:-270.26;营收环:-18.91;营收同:-17.77;
        ruanJianKaiFa.put("002268", "卫士通  ");//208	软件开发     -2.32	271.24	0.96	价格区间: 5日:68.04 	10日:26.63 	20日:19.38 	30日:17.68 	60日:17.68 	净利环:-116.82;净利同:49.54;营收环:-49.65;营收同:123.07;
    }

    /**
     * guangFuSheBei ["光伏设备"]：15;
     */
    public static Map<String, String> guangFuSheBei = new HashMap<>();

    static {
        guangFuSheBei.put("603185", "上机数控");//227	光伏设备     0.48	337.40	1.06	价格区间: 5日:86.98 	10日:51.49 	20日:49.63 	30日:30.37 	60日:26.47 	120日:13.54 	250日:8.04  		,当前价：122.59	,当前：2022-05-04 00:12:50
        guangFuSheBei.put("002459", "晶澳科技");//207	光伏设备     3.23	1302.95	0.81	价格区间: 5日:95.44 	10日:71.60 	20日:71.60 	30日:59.43 	60日:45.09 	120日:39.39 	250日:72.59 		,当前价：81.43	,当前：2022-05-04 00:12:51
        guangFuSheBei.put("002129", "中环股份");//187	光伏设备     1.4 	1261.02	0.97	价格区间: 5日:92.57 	10日:63.51 	20日:51.29 	30日:41.45 	60日:33.61 	120日:31.83 	250日:42.02 		,当前价：39.02	,当前：2022-05-04 00:12:52
    }

    /**
     * youXi ["游戏"]：11;
     */
    public static Map<String, String> youXi = new HashMap<>();

    static {
        youXi.put("002624", "完美世界");//214	游戏         1.23	286.53	1.44	价格区间: 5日:73.32 	10日:73.32 	20日:75.36 	30日:75.36 	60日:78.32 	120日:29.48 	250日:25.78 		,当前价：14.77	,当前：2022-05-04 00:14:01
        youXi.put("002555", "三七互娱");//203	游戏         10.02	535.61	1.65	价格区间: 5日:100.00	10日:100.00	20日:71.09 	30日:71.09 	60日:71.56 	120日:49.79 	250日:58.06 		,当前价：24.15	,当前：2022-05-04 00:14:02
    }

    /**
     * dianZiYuanJian ["电子元件"]：34;
     */
    public static Map<String, String> dianZiYuanJian = new HashMap<>();

    static {
        dianZiYuanJian.put("002484", "江海股份");//233	电子元件     9.75	158.91	1.79	价格区间: 5日:99.05 	10日:99.05 	20日:60.32 	30日:40.37 	60日:34.55 	120日:29.12 	250日:40.55 		,当前价：19.02	,当前：2022-05-04 00:15:23
        dianZiYuanJian.put("002463", "沪电股份");//208	电子元件     7.53	246.57	1.27	价格区间: 5日:90.70 	10日:90.70 	20日:81.09 	30日:58.53 	60日:28.96 	120日:27.60 	250日:34.93 		,当前价：13.0	,当前：2022-05-04 00:15:24
    }

    /**
     * dianJi ["电机"]：6;
     */
    public static Map<String, String> dianJi = new HashMap<>();

    static {
        dianJi.put("002176", "江特电机");//258	电机         4.31	346.55	1.45	价格区间: 5日:96.85 	10日:96.85 	20日:72.39 	30日:47.25 	60日:48.44 	120日:38.87 	250日:53.42 		,当前价：20.31	,当前：2022-05-04 00:17:01
    }

    /**
     * dianYuanSheBei ["电源设备"]：8;
     */
    public static Map<String, String> dianYuanSheBei = new HashMap<>();

    static {
        dianYuanSheBei.put("600875", "东方电气");//166	电源设备     5.87	393.62	1.14	价格区间: 5日:96.32 	10日:71.04 	20日:51.64 	30日:36.51 	60日:20.96 	120日:12.69 	250日:19.40 		,当前价：12.62	,当前：2022-05-04 00:18:15
    }

    /**
     * banDaoTi ["半导体"]：21;
     */
    public static Map<String, String> banDaoTi = new HashMap<>();

    static {
        banDaoTi.put("603290", "斯达半导");//207	半导体       1.7 	588.11	1.19	价格区间: 5日:98.50 	10日:98.50 	20日:46.12 	30日:39.53 	60日:43.89 	120日:28.02 	250日:49.69 		,当前价：344.72	,当前：2022-05-04 00:19:53
        banDaoTi.put("605111", "新洁能  ");//197	半导体       3.73	182.21	1.49	价格区间: 5日:90.88 	10日:61.22 	20日:40.10 	30日:18.26 	60日:18.26 	120日:11.97 	250日:11.97 		,当前价：91.13	,当前：2022-05-04 00:19:54
        banDaoTi.put("603986", "兆易创新");//186	半导体       5.27	833.07	1.18	价格区间: 5日:79.42 	10日:44.12 	20日:36.96 	30日:22.59 	60日:22.59 	120日:16.82 	250日:10.04 		,当前价：124.81	,当前：2022-05-04 00:19:56
        banDaoTi.put("600460", "士兰微  ");//179	半导体       6.09	594.75	1.38	价格区间: 5日:91.20 	10日:68.96 	20日:40.73 	30日:24.01 	60日:24.01 	120日:18.18 	250日:32.70 		,当前价：42.0	,当前：2022-05-04 00:19:57
        banDaoTi.put("600198", "大唐电信");//179	半导体       1.79	89.46	0.65	价格区间: 5日:59.38 	10日:24.05 	20日:24.05 	30日:24.37 	60日:23.87 	120日:13.68 	250日:30.68 		,当前价：6.81	,当前：2022-05-04 00:19:58
        banDaoTi.put("002371", "北方华创");//168	半导体       0.54	1260.02	1.49	价格区间: 5日:67.76 	10日:37.40 	20日:29.83 	30日:18.10 	60日:18.10 	120日:8.94  	250日:29.85 		,当前价：239.0	,当前：2022-05-04 00:19:59
        banDaoTi.put("002049", "紫光国微");//166	半导体       4.61	1110.55	1.07	价格区间: 5日:93.21 	10日:93.21 	20日:50.52 	30日:44.54 	60日:38.81 	120日:32.98 	250日:54.39 		,当前价：183.0	,当前：2022-05-04 00:20:00
    }

    /**
     * hangTianHangKong ["航天航空"]：16;
     */
    public static Map<String, String> hangTianHangKong = new HashMap<>();

    static {
        hangTianHangKong.put("600765", "中航重机");//222	航天航空     -1.03	395.84	2.5 	价格区间: 5日:83.08 	10日:84.43 	20日:65.56 	30日:51.58 	60日:44.33 	净利环:-26.30;净利同:174.95;营收环:-8.95;营收同:15.65;
        hangTianHangKong.put("600372", "中航电子");//194	航天航空     -3.85	331.85	1.23	价格区间: 5日:76.14 	10日:76.14 	20日:61.84 	30日:48.02 	60日:48.02 	净利环:-9.96;净利同:44.37;营收环:-19.17;营收同:19.60;
        hangTianHangKong.put("600760", "中航沈飞");//185	航天航空     -0.82	1022.82	1.84	价格区间: 5日:82.48 	10日:79.85 	20日:69.72 	30日:47.84 	60日:47.84 	净利环:111.67;净利同:48.18;营收环:-14.92;营收同:34.78;
        hangTianHangKong.put("600862", "中航高科");//185	航天航空     -2.95	307.59	1.47	价格区间: 5日:87.04 	10日:87.04 	20日:87.04 	30日:71.41 	60日:47.78 	净利环:1164.98;净利同:22.74;营收环:20.68;营收同:16.64;
        hangTianHangKong.put("000738", "航发控制");//182	航天航空     -0.57	323.27	1.37	价格区间: 5日:83.11 	10日:84.87 	20日:84.87 	30日:84.87 	60日:78.33 	净利环:137.22;净利同:59.99;营收环:8.20;营收同:31.33;
    }

    /**
     * guangXueGuangDianZi ["光学光电子"]：21;
     */
    public static Map<String, String> guangXueGuangDianZi = new HashMap<>();

    static {
        guangXueGuangDianZi.put("603297", "永新光学");//200	光学光电子   10   	79.15	0.93	价格区间: 5日:59.42 	10日:37.97 	20日:22.33 	30日:17.38 	60日:16.16 	120日:14.81 	250日:27.93 		,当前价：71.64	,当前：2022-05-04 00:24:40
    }

    /**
     * xiaoFeiDianZi ["消费电子"]：21;
     */
    public static Map<String, String> xiaoFeiDianZi = new HashMap<>();

    static {
        xiaoFeiDianZi.put("603595", "东尼电子");//235	消费电子     3.48	78.75	1.8 	价格区间: 5日:87.96 	10日:91.20 	20日:91.20 	30日:91.20 	60日:83.77 	120日:42.50 	250日:54.08 		,当前价：33.88	,当前：2022-05-04 00:27:16
        xiaoFeiDianZi.put("002241", "歌尔股份");//195	消费电子     4.85	1197.42	1.28	价格区间: 5日:96.36 	10日:96.36 	20日:86.18 	30日:67.16 	60日:35.48 	120日:24.70 	250日:24.70 		,当前价：35.05	,当前：2022-05-04 00:27:18
    }

    /**
     * dianChi ["电池"]：9;
     */
    public static Map<String, String> dianChi = new HashMap<>();

    static {
        dianChi.put("002192", "融捷股份");//262	电池         10.01	270.92	2.45	价格区间: 5日:100.00	10日:100.00	20日:58.07 	30日:47.71 	60日:47.71 	120日:37.95 	250日:35.14 		,当前价：104.34	,当前：2022-05-04 00:29:45
        dianChi.put("002245", "蔚蓝锂芯");//216	电池         3.23	195.46	1.14	价格区间: 5日:97.69 	10日:57.78 	20日:40.05 	30日:34.14 	60日:32.59 	120日:18.63 	250日:34.20 		,当前价：18.87	,当前：2022-05-04 00:29:47
    }

    /**
     * fengDianSheBei ["风电设备"]：8;
     */
    public static Map<String, String> fengDianSheBei = new HashMap<>();

    static {
        fengDianSheBei.put("600416", "湘电股份");//206	风电设备     9.07	148.64	1.39	价格区间: 5日:89.91 	10日:59.59 	20日:58.07 	30日:43.07 	60日:29.97 	120日:17.21 	250日:17.21 		,当前价：12.87	,当前：2022-05-04 00:31:40
        fengDianSheBei.put("603063", "禾望电气");//198	风电设备     3.04	112.47	0.89	价格区间: 5日:95.56 	10日:48.67 	20日:27.97 	30日:20.71 	60日:18.98 	120日:18.98 	250日:40.53 		,当前价：25.75	,当前：2022-05-04 00:31:42
    }


    /**
     * all
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(meiTanHangYe);
        all.putAll(fangDiChanKaiFa);
        all.putAll(gongChengJianShe);
        all.putAll(yinHang);//银行
        all.putAll(shangYeBaiHuo);
        all.putAll(lvYouJiuDian);
        all.putAll(hangYunGangKou);
        all.putAll(shuiNiJianCai);
        all.putAll(guiJinShu);
        all.putAll(huaFeiHangYe);

        all.putAll(tieLuGongLu);
        all.putAll(nongYaoShouYao);
        all.putAll(gongChengZiXunFuWu);
        all.putAll(lvYou_hangKongJiChang);
        all.putAll(wuLiuHangYe);
        all.putAll(gangTieHangYe);
        all.putAll(nongMuSiYu);
        all.putAll(fangDiChanFuWu);
        all.putAll(gongYongShiYe);

        all.putAll(huaXueYuanLiao);
        all.putAll(caiJueHangYe);
        all.putAll(ranQi);
        all.putAll(dianLiHangYe);
        all.putAll(feiJinShuCaiLiao);
        all.putAll(zaoZhiYinShua);
        all.putAll(jiaDianHangYe);
        all.putAll(shiPinYinLiao);
        all.putAll(jiaoYunSheBei);
        all.putAll(xiaoJinShu);

        all.putAll(baoXian);
        all.putAll(zhuBaoShouShi);
        all.putAll(yiYaoShangYe);
        all.putAll(maoYiHangYe);
        all.putAll(niangJiuHangYe);
        all.putAll(huaXueZhiYao);
        all.putAll(shiYouHangYe);
        all.putAll(huaQianHangYe);
        all.putAll(fangZhiFuZhuang);
        all.putAll(zhongYao);
        all.putAll(zongHeHangYe);

        all.putAll(jiaYongQingGong);
        all.putAll(dianZiHuaXuePin);
        all.putAll(youSeJinShu);
        all.putAll(huaXueZhiPin);
        all.putAll(qiCheFuWu);
        all.putAll(zhuangXiuJianCai);
        all.putAll(tongXinFuWu);
        all.putAll(zhuangXiuZhuangShi);
        all.putAll(boLiBoQian);
        all.putAll(zhengQuan);

        all.putAll(jiaoYu);
        all.putAll(meiRongHuLi);
        all.putAll(wenHuaChuanMei);
        all.putAll(duoYuanJinRong);
        all.putAll(yiLiaoQiXie);
        all.putAll(shengWuZhiPin);
        all.putAll(zhuanYeFuWu);
        all.putAll(huanBaoHangYe);
        all.putAll(yiLiaoFuWu);
        all.putAll(tongYongSheBei);

        all.putAll(baoZhuangCaiLiao);
        all.putAll(nengYuanJinShu);
        all.putAll(huLianWangFuWu);
        all.putAll(tongXinSheBei);
        all.putAll(qiCheLingBuJian);
        all.putAll(qiCheZhengChe);
        all.putAll(zhuanYongSheBei);
        all.putAll(gongChengJiXie);
        all.putAll(suLiaoZhiPin);
        all.putAll(chuanBoZhiZao);

        all.putAll(xiangJiaoZhiPin);
        all.putAll(dianWangSheBei);
        all.putAll(yiQiYiBiao);
        all.putAll(jiSuanJiSheBei);
        all.putAll(ruanJianKaiFa);
        all.putAll(guangFuSheBei);
        all.putAll(youXi);
        all.putAll(dianZiYuanJian);
        all.putAll(dianJi);
        all.putAll(dianYuanSheBei);

        all.putAll(banDaoTi);
        all.putAll(hangTianHangKong);
        all.putAll(guangXueGuangDianZi);
        all.putAll(xiaoFeiDianZi);
        all.putAll(dianChi);
        all.putAll(fengDianSheBei);

    }

    public static void main(String[] args) {
        String spDate = null;
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);
//        String date = "2022-05-06";
//        spDate = "2022-05-09";//特定日期：下一交易日
        KlineService.checkMaDemo(huaXueZhiYao, date, spDate);// all   huaGong   huaGong_linHuaGong    yinHang
    }
}
