package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：消费
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStXiaoFei {

    /**
     * shiPin_tiaoWeiPin ["调味品概念"]：19;
     */
    public static Map<String, String> shiPin_tiaoWeiPin = new HashMap<>();

    static {
        shiPin_tiaoWeiPin.put("002053", "云南能投");//374	化学原料	2.03	103.04	1.23	价格区间: 5日:18.60 	10日:5.13  	20日:35.20 	30日:35.37 	60日:39.54 	120日:42.72 	250日:47.63 		,当前价：13.54	,当前：2022-03-30 14:19:50
        shiPin_tiaoWeiPin.put("000505", "京粮控股");//332	农牧饲渔	4   	96.39	6.56	价格区间: 5日:86.45 	10日:88.53 	20日:89.44 	30日:89.44 	60日:90.03 	120日:90.07 	250日:90.07 		,当前价：13.26	,当前：2022-03-30 14:19:52
        shiPin_tiaoWeiPin.put("600328", "中盐化工");//299	化学原料	4.21	161.08	2.34	价格区间: 5日:94.71 	10日:95.65 	20日:75.16 	30日:73.55 	60日:73.55 	120日:33.63 	250日:39.60 		,当前价：16.82	,当前：2022-03-30 14:19:53
        shiPin_tiaoWeiPin.put("002539", "云图控股");//284	化肥行业	-0.73	137.88	2.65	价格区间: 5日:78.81 	10日:82.42 	20日:69.09 	30日:65.29 	60日:61.29 	120日:31.96 	250日:35.96 		,当前价：13.65	,当前：2022-03-30 14:19:54
        shiPin_tiaoWeiPin.put("002597", "金禾实业");//271	食品饮料	0.45	223.75	1.05	价格区间: 5日:55.03 	10日:59.75 	20日:81.89 	30日:73.46 	60日:35.56 	120日:33.73 	250日:45.23 		,当前价：39.89	,当前：2022-03-30 14:19:56
        shiPin_tiaoWeiPin.put("600251", "冠农股份");//268	农牧饲渔	-5.79	78.85	2.44	价格区间: 5日:14.29 	10日:36.25 	20日:42.29 	30日:55.89 	60日:63.31 	120日:63.31 	250日:60.00 		,当前价：10.09	,当前：2022-03-30 14:19:57
        shiPin_tiaoWeiPin.put("002568", "百润股份");//250	酿酒行业	7.38	276.61	2.41	价格区间: 5日:71.47 	10日:52.92 	20日:29.29 	30日:24.46 	60日:11.16 	120日:8.40  	250日:5.46  		,当前价：36.83	,当前：2022-03-30 14:19:57
    }
    /**
     * nongYe_linHuaGong ["磷化工"]：26;
     */
    public static Map<String, String> nongYe_linHuaGong = new HashMap<>();

    static {
        nongYe_linHuaGong.put("000422", "湖北宜化");//465	化学原料	10.01	190.53	2.31	价格区间: 5日:100.00	10日:100.00	20日:96.97 	30日:79.43 	60日:80.79 	120日:26.15 	250日:56.09 		,当前价：21.22	,当前：2022-03-29 14:09:47
        nongYe_linHuaGong.put("600096", "云天化  ");//455	化肥行业	9.52	504.87	2.36	价格区间: 5日:94.31 	10日:94.79 	20日:95.33 	30日:97.07 	60日:97.67 	120日:72.85 	250日:67.56 		,当前价：27.5	,当前：2022-03-29 14:09:49
        nongYe_linHuaGong.put("600141", "兴发集团");//363	化肥行业	6.44	399.00	3.4 	价格区间: 5日:87.30 	10日:87.30 	20日:42.04 	30日:37.29 	60日:53.01 	120日:26.31 	250日:50.70 		,当前价：35.89	,当前：2022-03-29 14:09:50
        nongYe_linHuaGong.put("002895", "川恒股份");//359	化肥行业	5.54	111.60	2.31	价格区间: 5日:85.07 	10日:91.40 	20日:54.25 	30日:41.48 	60日:40.95 	120日:12.89 	250日:31.50 		,当前价：22.85	,当前：2022-03-29 14:09:52
        nongYe_linHuaGong.put("600596", "新安股份");//333	农药兽药	3.07	236.19	1.76	价格区间: 5日:87.29 	10日:94.22 	20日:94.07 	30日:94.07 	60日:96.08 	120日:56.43 	250日:48.43 		,当前价：28.86	,当前：2022-03-29 14:09:53
    }

    /**
     * nongYe_shuiChanYangZhi ["水产养殖"]：6;
     */
    public static Map<String, String> nongYe_shuiChanYangZhi = new HashMap<>();

    static {
        nongYe_shuiChanYangZhi.put("001313", "粤海饲料");//280	农牧饲渔	-1.86	110.81	1.35	价格区间: 5日:14.32 	10日:27.13 	20日:35.62 	30日:60.74 	60日:66.52 	120日:66.52 	250日:66.52 		,当前价：15.83	,当前：2022-03-30 14:48:56
        nongYe_shuiChanYangZhi.put("002385", "大北农  ");//275	农牧饲渔	0   	360.71	2.9 	价格区间: 5日:80.87 	10日:84.51 	20日:75.62 	30日:75.62 	60日:38.58 	120日:36.71 	250日:46.09 		,当前价：8.71	,当前：2022-03-30 14:48:57
        nongYe_shuiChanYangZhi.put("600438", "通威股份");//264	光伏设备	2.02	2002.29	1.58	价格区间: 5日:94.81 	10日:66.48 	20日:67.89 	30日:79.17 	60日:82.62 	120日:39.52 	250日:46.48 		,当前价：44.48	,当前：2022-03-30 14:48:58
    }
    /**
     * 农业-转基因 ["转基因"]：8;
     */
    public static Map<String, String> nongYe_zhuanJiYin = new HashMap<>();
    static {
        nongYe_zhuanJiYin.put("600313", "农发种业");//325	农牧饲渔	6.43	89.61	21.97	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：8.28	,当前：2022-03-31 10:21:08
        nongYe_zhuanJiYin.put("600596", "新安股份");//321	农药兽药	-2.59	221.78	2.41	价格区间: 5日:6.69  	10日:39.69 	20日:54.60 	30日:54.49 	60日:69.87 	120日:42.30 	250日:42.70 		,当前价：27.1	,当前：2022-03-31 10:21:09
        nongYe_zhuanJiYin.put("002385", "大北农  ");//273	农牧饲渔	0.46	361.53	3.98	价格区间: 5日:93.04 	10日:94.33 	20日:82.59 	30日:82.59 	60日:42.13 	120日:40.10 	250日:48.97 		,当前价：8.73	,当前：2022-03-31 10:21:11
        nongYe_zhuanJiYin.put("002100", "天康生物");//271	农牧饲渔	-3.02	165.17	2.36	价格区间: 5日:31.78 	10日:58.69 	20日:70.67 	30日:70.67 	60日:72.06 	120日:82.91 	250日:85.92 		,当前价：12.2	,当前：2022-03-31 10:21:12
        nongYe_zhuanJiYin.put("002041", "登海种业");//268	农牧饲渔	-0.13	210.67	3.21	价格区间: 5日:71.43 	10日:83.94 	20日:86.71 	30日:86.71 	60日:69.54 	120日:55.08 	250日:68.87 		,当前价：23.94	,当前：2022-03-31 10:21:13
    }

    /**
     * nongYe_caoGanLin ["草甘膦"]：10;
     */
    public static Map<String, String> nongYe_caoGanLin = new HashMap<>();

    static {
        nongYe_caoGanLin.put("600389", "江山股份");//354	农药兽药	-0.96	128.81	1.51	价格区间: 5日:56.31 	10日:80.37 	20日:73.48 	30日:55.75 	60日:59.54 	120日:40.69 	250日:53.36 		,当前价：43.37	,当前：2022-03-28 14:09:50
        nongYe_caoGanLin.put("600141", "兴发集团");//347	化肥行业	-5.18	370.43	7.91	价格区间: 5日:26.72 	10日:26.72 	20日:11.98 	30日:11.41 	60日:33.70 	120日:16.73 	250日:45.69 		,当前价：33.32	,当前：2022-03-28 14:09:52
        nongYe_caoGanLin.put("600596", "新安股份");//323	农药兽药	-0.47	227.51	3.54	价格区间: 5日:51.87 	10日:79.28 	20日:75.91 	30日:77.05 	60日:84.05 	120日:44.96 	250日:45.80 		,当前价：27.8	,当前：2022-03-28 14:09:53
    }

    /**
     * nongYe_jiRou ["鸡肉概念"]：13;
     */
    public static Map<String, String> nongYe_jiRou = new HashMap<>();

    static {
        nongYe_jiRou.put("603477", "巨星农牧");//398	农牧饲渔	-2.24	130.07	6.59	价格区间: 5日:18.11 	10日:61.40 	20日:67.07 	30日:67.07 	60日:76.96 	120日:81.75 	250日:83.98 		,当前价：25.7	,当前：2022-03-31 10:40:30
        nongYe_jiRou.put("002100", "天康生物");//271	农牧饲渔	-1.99	166.93	2.36	价格区间: 5日:27.13 	10日:55.87 	20日:68.67 	30日:68.67 	60日:70.16 	120日:81.75 	250日:84.96 		,当前价：12.33	,当前：2022-03-31 10:40:32
        nongYe_jiRou.put("002746", "仙坛股份");//254	农牧饲渔	7.14	85.28	1.47	价格区间: 5日:73.15 	10日:73.15 	20日:84.57 	30日:66.67 	60日:43.48 	120日:60.08 	250日:60.90 		,当前价：9.91	,当前：2022-03-31 10:40:33
        nongYe_jiRou.put("000876", "新希望  ");//251	农牧饲渔	0.12	771.29	4.29	价格区间: 5日:64.29 	10日:82.58 	20日:87.56 	30日:87.56 	60日:69.16 	120日:71.14 	250日:60.50 		,当前价：17.12	,当前：2022-03-31 10:40:34
        nongYe_jiRou.put("002567", "唐人神  ");//248	农牧饲渔	-3.8	128.20	3.09	价格区间: 5日:35.66 	10日:66.40 	20日:73.40 	30日:73.40 	60日:80.24 	120日:84.62 	250日:85.42 		,当前价：10.63	,当前：2022-03-31 10:40:36
    }

    /**
     * ["在线旅游"]：8;
     */
    public static Map<String, String> zaiXianLvYou = new HashMap<>();

    static {
        zaiXianLvYou.put("000524", "岭南控股");//328	旅游酒店	10.04	86.66	77.48	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：12.93	,当前：2022-03-18 10:29:08
        zaiXianLvYou.put("000796", "凯撒旅业");//313	旅游酒店	2.63	84.48	13.48	价格区间: 5日:74.00 	10日:78.15 	20日:80.23 	30日:67.03 	60日:74.48 	120日:75.50 	250日:76.35 		,当前价：10.52	,当前：2022-03-18 10:29:10
        zaiXianLvYou.put("600258", "首旅酒店");//256	旅游酒店	0.86	277.77	2.2 	价格区间: 5日:95.47 	10日:64.52 	20日:56.98 	30日:50.51 	60日:50.51 	120日:50.51 	250日:59.71 		,当前价：24.77	,当前：2022-03-18 10:29:11
        zaiXianLvYou.put("002707", "众信旅游");//244	旅游酒店	0.7 	64.80	16.07	价格区间: 5日:81.61 	10日:80.46 	20日:80.46 	30日:47.95 	60日:58.70 	120日:64.07 	250日:67.31 		,当前价：7.15	,当前：2022-03-18 10:29:12
        zaiXianLvYou.put("000069", "华侨城Ａ");//188	房地产开发	-0.31	519.17	2.68	价格区间: 5日:65.05 	10日:45.27 	20日:39.18 	30日:27.35 	60日:23.51 	120日:23.51 	250日:14.38 		,当前价：6.33	,当前：2022-03-18 10:29:17
    }

    /**
     * yuZhiCaiGaiNian ["预制菜概念"]：16;
     */
    public static Map<String, String> yuZhiCaiGaiNian = new HashMap<>();

    static {
        yuZhiCaiGaiNian.put("000524", "岭南控股");//356	旅游酒店	9.98	95.30	47.18	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：14.22	,当前：2022-03-21 10:40:58
        yuZhiCaiGaiNian.put("605089", "味知香  ");//326	食品饮料	6.34	61.68	1.18	价格区间: 5日:85.38 	10日:72.40 	20日:56.38 	30日:44.72 	60日:16.25 	120日:16.25 	250日:20.80 		,当前价：61.68	,当前：2022-03-21 10:40:59
        yuZhiCaiGaiNian.put("600965", "福成股份");//240	农牧饲渔	5.05	56.24	2.4 	价格区间: 5日:90.91 	10日:90.91 	20日:90.91 	30日:90.91 	60日:24.69 	120日:25.43 	250日:37.11 		,当前价：6.87	,当前：2022-03-21 10:41:01
        yuZhiCaiGaiNian.put("000876", "新希望  ");//236	农牧饲渔	2.5 	701.46	1.98	价格区间: 5日:98.17 	10日:58.27 	20日:55.99 	30日:44.51 	60日:42.24 	120日:57.76 	250日:42.92 		,当前价：15.57	,当前：2022-03-21 10:41:02
        yuZhiCaiGaiNian.put("603345", "安井食品");//235	食品饮料	3.12	339.89	3.46	价格区间: 5日:86.65 	10日:86.65 	20日:44.35 	30日:34.64 	60日:15.72 	120日:13.03 	250日:8.52  		,当前价：115.88	,当前：2022-03-21 10:41:03
    }

    /**
     * nongYe 农业
     */
    public static Map<String, String> nongYe = new HashMap<>();

    static {
        nongYe.putAll(nongYe_zhuanJiYin);//农业-转基因
        nongYe.putAll(nongYe_caoGanLin);//农业-草甘膦
        nongYe.putAll(nongYe_shuiChanYangZhi);//农业-水产养殖
        nongYe.putAll(nongYe_linHuaGong);//农业-磷化工
        nongYe.putAll(nongYe_jiRou);//鸡肉概念
    }

    /**
     * shiPin 食品
     */
    public static Map<String, String> shiPin = new HashMap<>();

    static {
        shiPin.putAll(shiPin_tiaoWeiPin);
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {
        all.putAll(zaiXianLvYou);
        all.putAll(yuZhiCaiGaiNian);

        all.putAll(nongYe); //农业:转基因,草甘膦,水产养殖,磷化工
        all.putAll(shiPin); //食品
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.nongYe, date);//all nongYe
        StockStatDemo.checkMaDemo(ContMapStXiaoFei.shiPin, date);//
    }
}
