package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：消费
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStXiaoFei {




    /**
     * shiPin_tiaoWeiPin ["调味品概念"]：19;
     */
    public static Map<String, String> shiPin_tiaoWeiPin = new HashMap<>();

    static {
        shiPin_tiaoWeiPin.put("600328", "中盐化工");//362	化学原料     3.68	199.86	3.52	价格区间: 5日:85.77 	10日:87.67 	20日:89.67 	30日:91.22 	60日:91.22 	120日:77.68 	250日:55.70 		,当前价：20.87	,当前：2022-04-15 10:32:33
        shiPin_tiaoWeiPin.put("002053", "云南能投");//342	化学原料     0.84	91.62	2.6 	价格区间: 5日:43.62 	10日:15.19 	20日:4.41  	30日:22.24 	60日:27.45 	120日:31.27 	250日:36.71 		,当前价：12.04	,当前：2022-04-15 10:32:35
        shiPin_tiaoWeiPin.put("000505", "京粮控股");//316	农牧饲渔     -2.85	84.11	3.97	价格区间: 5日:86.32 	10日:50.76 	20日:65.27 	30日:68.05 	60日:69.81 	120日:69.93 	250日:69.93 		,当前价：11.57	,当前：2022-04-15 10:32:36
        shiPin_tiaoWeiPin.put("002539", "云图控股");//311	化肥行业     2.94	152.12	8.12	价格区间: 5日:80.33 	10日:82.22 	20日:87.53 	30日:88.71 	60日:88.71 	120日:61.55 	250日:48.11 		,当前价：15.06	,当前：2022-04-15 10:32:37
    }






    /**
     * ["在线旅游"]：8;
     */
    public static Map<String, String> lvYou_zaiXianLvYou = new HashMap<>();

    static {
        lvYou_zaiXianLvYou.put("000524", "岭南控股");//348	旅游酒店     2.69	86.99	3.56	价格区间: 5日:63.25 	10日:69.93 	20日:55.07 	30日:57.32 	60日:64.04 	120日:67.69 	250日:67.69 		,当前价：12.98	,当前：2022-04-12 10:27:32
        lvYou_zaiXianLvYou.put("000796", "凯撒旅业");//320	旅游酒店     3.44	94.27	4.03	价格区间: 5日:62.27 	10日:68.32 	20日:73.82 	30日:78.16 	60日:82.30 	120日:84.77 	250日:85.34 		,当前价：11.74	,当前：2022-04-12 10:27:33
        lvYou_zaiXianLvYou.put("002707", "众信旅游");//258	旅游酒店     2.23	66.62	4.08	价格区间: 5日:30.88 	10日:37.50 	20日:70.10 	30日:70.10 	60日:52.70 	120日:63.57 	250日:67.96 		,当前价：7.35	,当前：2022-04-12 10:27:35
        lvYou_zaiXianLvYou.put("002244", "滨江集团");//255	房地产开发   -0.14	226.82	1.3 	价格区间: 5日:33.70 	10日:54.14 	20日:74.48 	30日:74.48 	60日:79.25 	120日:84.67 	250日:85.05 		,当前价：7.29	,当前：2022-04-12 10:27:36
        lvYou_zaiXianLvYou.put("600258", "首旅酒店");//252	旅游酒店     5.01	256.12	2.51	价格区间: 5日:36.18 	10日:33.71 	20日:35.28 	30日:21.51 	60日:19.07 	120日:19.07 	250日:39.40 		,当前价：22.84	,当前：2022-04-12 10:27:37
        lvYou_zaiXianLvYou.put("600640", "新国脉  ");//236	文化传媒     0.78	81.96	1.58	价格区间: 5日:5.04  	10日:5.04  	20日:24.57 	30日:24.57 	60日:7.88  	120日:7.74  	250日:7.74  		,当前价：10.3	,当前：2022-04-12 10:27:38
        lvYou_zaiXianLvYou.put("000069", "华侨城Ａ");//224	房地产开发   -0.14	602.01	1.25	价格区间: 5日:3.23  	10日:48.86 	20日:63.27 	30日:63.27 	60日:54.39 	120日:54.39 	250日:33.26 		,当前价：7.34	,当前：2022-04-12 10:27:39
        lvYou_zaiXianLvYou.put("600138", "中青旅  ");//190	旅游酒店     4.51	90.55	4.17	价格区间: 5日:38.21 	10日:47.22 	20日:65.14 	30日:65.14 	60日:62.34 	120日:70.48 	250日:72.94 		,当前价：12.51	,当前：2022-04-12 10:27:40
    }

    /**
     * lvYou_mianShui ["免税概念"]：22;
     */
    public static Map<String, String> lvYou_mianShui = new HashMap<>();

    static {
        lvYou_mianShui.put("600338", "西藏珠峰");//376	有色金属     -2.23	216.12	2.34	价格区间: 5日:27.62 	10日:10.68 	20日:6.76  	30日:4.94  	60日:3.90  	120日:2.97  	250日:33.25 		,当前价：23.64	,当前：2022-04-15 10:00:02
        lvYou_mianShui.put("000524", "岭南控股");//354	旅游酒店     0.95	78.68	2.01	价格区间: 5日:16.23 	10日:26.00 	20日:22.73 	30日:42.58 	60日:54.05 	120日:58.58 	250日:58.58 		,当前价：11.74	,当前：2022-04-15 10:00:04
        lvYou_mianShui.put("000796", "凯撒旅业");//328	旅游酒店     -1.08	88.01	2.16	价格区间: 5日:9.26  	10日:29.80 	20日:33.78 	30日:47.08 	60日:57.54 	120日:62.48 	250日:63.65 		,当前价：10.96	,当前：2022-04-15 10:00:05
        lvYou_mianShui.put("002707", "众信旅游");//280	旅游酒店     -0.93	67.62	1.8 	价格区间: 5日:46.59 	10日:46.59 	20日:64.12 	30日:77.62 	60日:55.97 	120日:68.46 	250日:72.26 		,当前价：7.46	,当前：2022-04-15 10:00:08
        lvYou_mianShui.put("001979", "招商蛇口");//274	房地产开发   5.58	1394.49	2.74	价格区间: 5日:89.63 	10日:90.51 	20日:93.91 	30日:95.10 	60日:95.10 	120日:96.65 	250日:96.77 		,当前价：17.6	,当前：2022-04-15 10:00:09
        lvYou_mianShui.put("601888", "中国中免");//251	旅游酒店     -0.63	3523.05	2.74	价格区间: 5日:86.19 	10日:86.19 	20日:86.19 	30日:49.93 	60日:34.69 	120日:22.83 	250日:13.95 		,当前价：180.44	,当前：2022-04-15 10:00:10
        lvYou_mianShui.put("002251", "步步高  ");//251	商业百货     9.97	87.69	44.91	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：10.15	,当前：2022-04-15 10:00:12
        lvYou_mianShui.put("002163", "海南发展");//247	玻璃玻纤     -1.56	91.52	1.88	价格区间: 5日:9.09  	10日:43.14 	20日:43.52 	30日:46.79 	60日:46.79 	120日:43.21 	250日:17.32 		,当前价：11.39	,当前：2022-04-15 10:00:13
        lvYou_mianShui.put("000861", "海印股份");//233	综合行业     1.27	73.96	2.29	价格区间: 5日:31.43 	10日:16.42 	20日:15.71 	30日:43.27 	60日:54.26 	120日:67.58 	250日:70.20 		,当前价：3.18	,当前：2022-04-15 10:00:14
        lvYou_mianShui.put("600009", "上海机场");//229	航空机场     0.56	1007.61	1.53	价格区间: 5日:79.01 	10日:79.01 	20日:81.16 	30日:59.72 	60日:50.04 	120日:57.63 	250日:64.13 		,当前价：52.29	,当前：2022-04-15 10:00:14
    }

    /**
     * lvYou_tuiShuiShangDian 退税商店
     */
    public static Map<String, String> lvYou_tuiShuiShangDian = new HashMap<>();

    static {
        lvYou_tuiShuiShangDian.put("600415", "小商品城");//189	商业百货     1.47	304.22	4.52	价格区间: 5日:72.41 	10日:78.67 	20日:84.85 	30日:89.29 	60日:89.29 	120日:89.29 	250日:77.64 		,当前价：5.54	,当前：2022-04-15 09:54:07
        lvYou_tuiShuiShangDian.put("600827", "百联股份");//172	商业百货     0.82	219.81	2.47	价格区间: 5日:73.37 	10日:79.32 	20日:81.30 	30日:84.16 	60日:69.67 	120日:53.56 	250日:18.24 		,当前价：12.32	,当前：2022-04-15 09:54:08
        lvYou_tuiShuiShangDian.put("600655", "豫园股份");//171	珠宝首饰     -0.39	392.93	2.13	价格区间: 5日:45.45 	10日:19.61 	20日:60.00 	30日:66.80 	60日:66.80 	120日:66.80 	250日:27.92 		,当前价：10.1	,当前：2022-04-15 09:54:10
        lvYou_tuiShuiShangDian.put("600828", "茂业商业");//170	商业百货     0.71	73.78	2.03	价格区间: 5日:76.09 	10日:78.43 	20日:87.50 	30日:89.42 	60日:89.81 	120日:90.27 	250日:90.27 		,当前价：4.26	,当前：2022-04-15 09:54:11
    }

    /**
     * lvYou_hangKongJiChang 航空机场
     */
    public static Map<String, String> lvYou_hangKongJiChang = new HashMap<>();

    static {
        lvYou_hangKongJiChang.put("600004", "白云机场");//230	航空机场	3.84	301.05	2.56	价格区间: 5日:90.43 	10日:65.82 	20日:71.43 	30日:51.24 	60日:42.75 	120日:50.89 	250日:67.11 		,当前价：12.72	,当前：2022-04-01 11:39:04
        lvYou_hangKongJiChang.put("601111", "中国国航");//224	航空机场	4.94	1388.57	2.28	价格区间: 5日:87.50 	10日:73.04 	20日:73.82 	30日:62.95 	60日:46.23 	120日:55.91 	250日:68.16 		,当前价：9.56	,当前：2022-04-01 11:39:05
        lvYou_hangKongJiChang.put("002928", "华夏航空");//223	航空机场	1.36	105.72	2.56	价格区间: 5日:43.75 	10日:37.23 	20日:32.84 	30日:18.23 	60日:14.93 	120日:14.93 	250日:17.28 		,当前价：10.43	,当前：2022-04-01 11:39:07
        lvYou_hangKongJiChang.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:91.75 	10日:66.73 	20日:56.71 	30日:47.23 	60日:39.57 	120日:48.75 	250日:54.94 		,当前价：50.49	,当前：2022-04-01 11:39:08
    }

    /**
     * lvYou 旅游
     */
    public static Map<String, String> lvYou = new HashMap<>();

    static {
        lvYou.putAll(lvYou_zaiXianLvYou);//在线旅游
        lvYou.putAll(lvYou_mianShui);//免税概念
        lvYou.putAll(lvYou_tuiShuiShangDian);//退税商店
        lvYou.putAll(lvYou_hangKongJiChang);//航空机场
    }

    /**
     * yuZhiCaiGaiNian ["预制菜概念"]：16;
     */
    public static Map<String, String> shiPin_yuZhiCai = new HashMap<>();

    static {
        shiPin_yuZhiCai.put("000524", "岭南控股");//354	旅游酒店     0.95	78.68	2.01	价格区间: 5日:16.60 	10日:26.33 	20日:22.92 	30日:42.73 	60日:54.17 	120日:58.69 	250日:58.69 		,当前价：11.74	,当前：2022-04-15 10:26:31
        shiPin_yuZhiCai.put("605089", "味知香  ");//341	食品饮料     -0.02	65.99	3.62	价格区间: 5日:93.62 	10日:93.77 	20日:93.77 	30日:94.73 	60日:29.22 	120日:29.22 	250日:27.27 		,当前价：65.99	,当前：2022-04-15 10:26:33
        shiPin_yuZhiCai.put("603345", "安井食品");//263	食品饮料     1.61	354.11	6.84	价格区间: 5日:94.74 	10日:94.74 	20日:94.74 	30日:94.30 	60日:32.59 	120日:19.20 	250日:12.57 		,当前价：120.73	,当前：2022-04-15 10:26:34
        shiPin_yuZhiCai.put("002124", "天邦股份");//259	农牧饲渔     -0.57	160.19	3.73	价格区间: 5日:88.89 	10日:84.00 	20日:89.03 	30日:89.97 	60日:90.00 	120日:90.00 	250日:58.82 		,当前价：8.71	,当前：2022-04-15 10:26:36
        shiPin_yuZhiCai.put("000019", "深粮控股");//238	贸易行业     -3.93	98.54	1.78	价格区间: 5日:27.97 	10日:44.44 	20日:56.76 	30日:61.38 	60日:65.43 	120日:67.25 	250日:67.25 		,当前价：8.55	,当前：2022-04-15 10:26:37
        shiPin_yuZhiCai.put("002481", "双塔食品");//234	食品饮料     2.31	110.16	11.51	价格区间: 5日:93.53 	10日:93.53 	20日:73.27 	30日:75.73 	60日:49.32 	120日:49.32 	250日:26.58 		,当前价：8.86	,当前：2022-04-15 10:26:38
        shiPin_yuZhiCai.put("600965", "福成股份");//233	农牧饲渔     -0.7	57.80	3.03	价格区间: 5日:92.31 	10日:85.33 	20日:71.01 	30日:76.33 	60日:31.85 	120日:31.85 	250日:43.09 		,当前价：7.06	,当前：2022-04-15 10:26:39
        shiPin_yuZhiCai.put("000876", "新希望  ");//221	农牧饲渔     -0.65	693.80	2.86	价格区间: 5日:40.87 	10日:19.42 	20日:40.73 	30日:52.32 	60日:44.31 	120日:42.04 	250日:55.52 		,当前价：15.4	,当前：2022-04-15 10:26:40
        shiPin_yuZhiCai.put("601933", "永辉超市");//199	商业百货     0.64	426.53	2.06	价格区间: 5日:28.92 	10日:48.25 	20日:52.42 	30日:68.95 	60日:68.95 	120日:68.95 	250日:37.64 		,当前价：4.7	,当前：2022-04-15 10:26:40
    }

    /**
     * shiPin_sheQuTuanGou ["社区团购"]：18;
     */
    public static Map<String, String> shiPin_sheQuTuanGou = new HashMap<>();

    static {
        shiPin_sheQuTuanGou.put("000607", "华媒控股");//288	文化传媒     -9.45	55.57	3.01	价格区间: 5日:5.79  	10日:17.39 	20日:37.70 	30日:37.70 	60日:31.77 	120日:51.54 	250日:54.13 		,当前价：5.46	,当前：2022-04-13 11:09:22
        shiPin_sheQuTuanGou.put("600327", "大东方  ");//238	汽车服务     -4.07	50.08	5.14	价格区间: 5日:5.71  	10日:3.77  	20日:2.33  	30日:2.01  	60日:15.58 	120日:23.83 	250日:37.21 		,当前价：5.66	,当前：2022-04-13 11:09:24
        shiPin_sheQuTuanGou.put("002183", "怡亚通  ");//225	物流行业     7.65	146.21	12.1	价格区间: 5日:82.35 	10日:83.87 	20日:87.29 	30日:87.29 	60日:51.24 	120日:44.02 	250日:32.88 		,当前价：5.63	,当前：2022-04-13 11:09:25
        shiPin_sheQuTuanGou.put("601933", "永辉超市");//210	商业百货     -3.14	447.40	8.27	价格区间: 5日:69.07 	10日:74.58 	20日:75.81 	30日:84.21 	60日:84.21 	120日:84.21 	250日:45.58 		,当前价：4.93	,当前：2022-04-13 11:09:26
    }

    /**
     * shiPin_ruYe ["乳业"]：14;
     */
    public static Map<String, String> shiPin_ruYe = new HashMap<>();

    static {
        shiPin_ruYe.put("605337", "李子园  ");//304	食品饮料     -1.72	75.46	6.15	价格区间: 5日:86.65 	10日:86.65 	20日:86.65 	30日:77.75 	60日:32.64 	120日:28.77 	250日:22.15 		,当前价：34.82	,当前：2022-04-15 10:51:06
        shiPin_ruYe.put("605388", "均瑶健康");//298	食品饮料     0.46	85.18	3.26	价格区间: 5日:90.97 	10日:90.97 	20日:49.61 	30日:56.97 	60日:52.76 	120日:43.70 	250日:24.78 		,当前价：19.81	,当前：2022-04-15 10:51:07
        shiPin_ruYe.put("002557", "洽洽食品");//264	食品饮料     -0.88	281.34	1.06	价格区间: 5日:35.01 	10日:59.43 	20日:74.59 	30日:76.77 	60日:70.45 	120日:52.03 	250日:64.59 		,当前价：55.49	,当前：2022-04-15 10:51:09
        shiPin_ruYe.put("002385", "大北农  ");//261	农牧饲渔     -0.35	355.32	2.64	价格区间: 5日:76.58 	10日:76.58 	20日:82.78 	30日:78.11 	60日:56.27 	120日:37.92 	250日:47.12 		,当前价：8.58	,当前：2022-04-15 10:51:10
        shiPin_ruYe.put("600882", "妙可蓝多");//252	食品饮料     -2.2	169.78	4.29	价格区间: 5日:88.79 	10日:65.88 	20日:48.82 	30日:35.65 	60日:15.07 	120日:10.97 	250日:6.83  		,当前价：32.89	,当前：2022-04-15 10:51:11
        shiPin_ruYe.put("601515", "东风股份");//242	包装材料     1.45	107.20	7.88	价格区间: 5日:15.15 	10日:44.55 	20日:58.82 	30日:67.44 	60日:34.73 	120日:29.52 	250日:36.47 		,当前价：6.98	,当前：2022-04-15 10:51:12
        shiPin_ruYe.put("002505", "鹏都农牧");//232	贸易行业     3.67	198.24	3.17	价格区间: 5日:89.29 	10日:43.86 	20日:28.74 	30日:28.74 	60日:22.73 	120日:16.56 	250日:47.50 		,当前价：3.11	,当前：2022-04-15 10:51:14
    }

    /**
     * shiPin_renZaoRou ["人造肉"]：6;
     */
    public static Map<String, String> shiPin_renZaoRou = new HashMap<>();

    static {
        shiPin_renZaoRou.put("002810", "山东赫达");//274	化学制品     -4.64	127.51	3.37	价格区间: 5日:35.53 	10日:17.45 	20日:17.41 	30日:9.13  	60日:8.57  	120日:6.61  	250日:10.85 		,当前价：37.22	,当前：2022-04-15 10:55:19
        shiPin_renZaoRou.put("002481", "双塔食品");//234	食品饮料     2.31	110.16	11.51	价格区间: 5日:86.89 	10日:86.89 	20日:73.27 	30日:75.73 	60日:49.32 	120日:49.32 	250日:26.58 		,当前价：8.86	,当前：2022-04-15 10:55:21
    }

    /**
     * shiPin 食品: 预制菜概念,社区团购,调味品概念
     */
    public static Map<String, String> shiPin = new HashMap<>();

    static {
        shiPin.putAll(shiPin_yuZhiCai);
        shiPin.putAll(shiPin_tiaoWeiPin);
        shiPin.putAll(shiPin_sheQuTuanGou);
        shiPin.putAll(shiPin_ruYe);//乳业
        shiPin.putAll(shiPin_renZaoRou);//人造肉
    }

    /**
     * jiuShui_baiJiu ["白酒"]：37;
     */
    public static Map<String, String> jiuShui_baiJiu = new HashMap<>();

    static {
        jiuShui_baiJiu.put("600199", "金种子酒");//446	酿酒行业     4.1 	190.23	4.18	价格区间: 5日:91.97 	10日:93.00 	20日:61.08 	30日:61.08 	60日:79.59 	120日:79.59 	250日:80.20 		,当前价：28.92	,当前：2022-04-14 10:12:51
        jiuShui_baiJiu.put("600381", "青海春天");//382	食品饮料     2.38	116.00	4.42	价格区间: 5日:80.99 	10日:89.99 	20日:91.45 	30日:93.59 	60日:94.47 	120日:94.69 	250日:94.93 		,当前价：19.76	,当前：2022-04-14 10:12:52
        jiuShui_baiJiu.put("600238", "海南椰岛");//355	酿酒行业     0.71	64.00	3.26	价格区间: 5日:94.38 	10日:94.68 	20日:95.20 	30日:95.20 	60日:56.18 	120日:36.57 	250日:28.31 		,当前价：14.28	,当前：2022-04-14 10:12:53
        jiuShui_baiJiu.put("600771", "广誉远  ");//340	中药         1.91	154.68	0.96	价格区间: 5日:33.82 	10日:17.16 	20日:31.60 	30日:31.60 	60日:25.63 	120日:24.37 	250日:41.55 		,当前价：31.44	,当前：2022-04-14 10:12:55
        jiuShui_baiJiu.put("600702", "舍得酒业");//323	酿酒行业     2.54	507.47	0.7 	价格区间: 5日:82.68 	10日:60.00 	20日:37.75 	30日:27.63 	60日:23.78 	120日:13.39 	250日:40.85 		,当前价：152.82	,当前：2022-04-14 10:12:56
    }

    /**
     * jiuShui_piJiu ["啤酒概念"]：6;
     */
    public static Map<String, String> jiuShui_piJiu = new HashMap<>();

    static {
        jiuShui_piJiu.put("600132", "重庆啤酒");//281	酿酒行业     1.12	599.50	1.35	价格区间: 5日:91.60 	10日:91.70 	20日:92.84 	30日:72.05 	60日:58.93 	120日:37.85 	250日:24.54 		,当前价：123.87	,当前：2022-04-15 10:57:53
        jiuShui_piJiu.put("600600", "青岛啤酒");//247	酿酒行业     -0.77	1149.88	1.98	价格区间: 5日:92.07 	10日:92.07 	20日:78.90 	30日:43.63 	60日:40.77 	120日:34.65 	250日:27.73 		,当前价：84.28	,当前：2022-04-15 10:57:55
        jiuShui_piJiu.put("600108", "亚盛集团");//244	农牧饲渔     -2.05	74.57	1.62	价格区间: 5日:26.67 	10日:23.21 	20日:52.75 	30日:59.81 	60日:63.56 	120日:65.87 	250日:73.62 		,当前价：3.83	,当前：2022-04-15 10:57:56
    }

    /**
     * jiuShui 酒水
     */
    public static Map<String, String> jiuShui = new HashMap<>();

    static {
        jiuShui.putAll(jiuShui_baiJiu);
        jiuShui.putAll(jiuShui_piJiu);//啤酒概念
    }




    /**
     * wuLiu_kuaiDi ["快递概念"]：23;
     */
    public static Map<String, String> wuLiu_kuaiDi = new HashMap<>();

    static {
        wuLiu_kuaiDi.put("002210", "飞马国际");//305	物流行业     10.12	98.47	77   	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:50.62 	250日:55.56 		,当前价：3.7	,当前：2022-04-13 10:05:01
        wuLiu_kuaiDi.put("603056", "德邦股份");//280	物流行业     3.94	151.78	5.93	价格区间: 5日:30.41 	10日:14.80 	20日:9.21  	30日:35.57 	60日:37.84 	120日:39.95 	250日:40.47 		,当前价：14.78	,当前：2022-04-13 10:05:02
        wuLiu_kuaiDi.put("600787", "中储股份");//275	物流行业     9.97	157.73	53.57	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:96.44 	250日:79.48 		,当前价：7.17	,当前：2022-04-13 10:05:03
        wuLiu_kuaiDi.put("002120", "韵达股份");//259	物流行业     1.49	512.63	2.38	价格区间: 5日:89.32 	10日:85.19 	20日:56.62 	30日:38.82 	60日:24.24 	120日:24.24 	250日:46.91 		,当前价：17.66	,当前：2022-04-13 10:05:05
        wuLiu_kuaiDi.put("600153", "建发股份");//250	贸易行业     1.55	375.11	2.88	价格区间: 5日:25.00 	10日:49.66 	20日:72.88 	30日:72.88 	60日:73.13 	120日:79.30 	250日:80.53 		,当前价：13.1	,当前：2022-04-13 10:05:06
        wuLiu_kuaiDi.put("600233", "圆通速递");//246	物流行业     2.79	569.97	2.54	价格区间: 5日:90.00 	10日:54.62 	20日:52.50 	30日:46.44 	60日:39.13 	120日:57.33 	250日:72.52 		,当前价：16.59	,当前：2022-04-13 10:05:07
        wuLiu_kuaiDi.put("002010", "传化智联");//239	物流行业     6.1 	218.99	15.58	价格区间: 5日:76.99 	10日:76.99 	20日:78.15 	30日:54.71 	60日:34.07 	120日:25.27 	250日:29.77 		,当前价：7.13	,当前：2022-04-13 10:05:08
        wuLiu_kuaiDi.put("002183", "怡亚通  ");//225	物流行业     7.65	146.21	12.1	价格区间: 5日:80.00 	10日:81.72 	20日:85.59 	30日:85.59 	60日:50.25 	120日:43.16 	250日:32.33 		,当前价：5.63	,当前：2022-04-13 10:05:09
    }

    /**
     * wuLiu_tongYiDaShiChang ["统一大市场"]：11;
     */
    public static Map<String, String> wuLiu_tongYiDaShiChang = new HashMap<>();

    static {
        wuLiu_tongYiDaShiChang.put("002314", "南山控股");//348	房地产开发   -6.94	130.79	2.42	价格区间: 5日:2.23  	10日:24.48 	20日:37.96 	30日:41.60 	60日:41.60 	120日:49.07 	250日:49.07 		,当前价：4.83	,当前：2022-04-15 14:42:25
        wuLiu_tongYiDaShiChang.put("002210", "飞马国际");//305	物流行业     -3.9	85.16	9.91	价格区间: 5日:25.64 	10日:46.30 	20日:46.30 	30日:46.30 	60日:46.30 	120日:30.04 	250日:37.04 		,当前价：3.2	,当前：2022-04-15 14:42:26
        wuLiu_tongYiDaShiChang.put("600787", "中储股份");//242	物流行业     -7.73	128.69	5.64	价格区间: 5日:7.64  	10日:30.73 	20日:33.17 	30日:38.71 	60日:38.71 	120日:37.33 	250日:36.16 		,当前价：5.85	,当前：2022-04-15 14:42:27
        wuLiu_tongYiDaShiChang.put("600603", "广汇物流");//228	房地产开发   -10.03	71.02	54.88	价格区间: 5日:59.62 	10日:74.90 	20日:77.82 	30日:79.07 	60日:79.07 	120日:79.07 	250日:79.07 		,当前价：5.65	,当前：2022-04-15 14:42:28
        wuLiu_tongYiDaShiChang.put("002010", "传化智联");//226	物流行业     -5.55	193.50	3.84	价格区间: 5日:2.88  	10日:10.62 	20日:10.62 	30日:10.59 	60日:7.03  	120日:4.89  	250日:12.73 		,当前价：6.3	,当前：2022-04-15 14:42:30
        wuLiu_tongYiDaShiChang.put("001213", "中铁特货");//210	物流行业     -5   	236.44	6.23	价格区间: 5日:6.90  	10日:11.48 	20日:14.29 	30日:16.28 	60日:16.28 	120日:9.66  	250日:13.06 		,当前价：5.32	,当前：2022-04-15 14:42:31
        wuLiu_tongYiDaShiChang.put("002183", "怡亚通  ");//210	物流行业     -5.35	133.23	3.8 	价格区间: 5日:20.00 	10日:34.12 	20日:42.27 	30日:52.54 	60日:35.63 	120日:26.50 	250日:21.64 		,当前价：5.13	,当前：2022-04-15 14:42:32
        wuLiu_tongYiDaShiChang.put("000927", "中国铁物");//207	物流行业     -10 	212.37	14.88	价格区间: 5日:7.27  	10日:27.14 	20日:28.67 	30日:32.89 	60日:32.89 	120日:32.89 	250日:32.89 		,当前价：3.51	,当前：2022-04-15 14:42:33
    }

    /**
     * wuLiu_haiYangJingJi ["海洋经济"]：17;
     */
    public static Map<String, String> wuLiu_haiYangJingJi = new HashMap<>();

    static {
        wuLiu_haiYangJingJi.put("002639", "雪人股份");//369	通用设备     5.76	99.36	2.49	价格区间: 5日:75.12 	10日:76.71 	20日:61.59 	30日:61.59 	60日:39.06 	120日:49.65 	250日:53.95 		,当前价：12.86	,当前：2022-04-12 11:47:22
        wuLiu_haiYangJingJi.put("600522", "中天科技");//330	通信设备     -0.87	503.41	1.23	价格区间: 5日:1.18  	10日:1.02  	20日:0.59  	30日:0.50  	60日:12.30 	120日:50.08 	250日:56.37 		,当前价：14.75	,当前：2022-04-12 11:47:23
        wuLiu_haiYangJingJi.put("600026", "中远海能");//293	航运港口     2.04	332.91	2.09	价格区间: 5日:81.01 	10日:90.13 	20日:91.33 	30日:91.33 	60日:93.48 	120日:93.48 	250日:79.93 		,当前价：6.99	,当前：2022-04-12 11:47:24
        wuLiu_haiYangJingJi.put("601919", "中远海控");//284	航运港口     0.4 	2411.74	0.78	价格区间: 5日:15.08 	10日:12.33 	20日:12.33 	30日:7.11  	60日:7.05  	120日:12.45 	250日:36.42 		,当前价：15.06	,当前：2022-04-12 11:47:26
        wuLiu_haiYangJingJi.put("601890", "亚星锚链");//270	船舶制造     5.34	71.96	0.99	价格区间: 5日:83.33 	10日:83.33 	20日:82.42 	30日:38.07 	60日:21.93 	120日:35.82 	250日:50.19 		,当前价：7.5	,当前：2022-04-12 11:47:27
    }

    /**
     * wuLiu_rcep ["RCEP概念"]：13;
     */
    public static Map<String, String> wuLiu_rcep = new HashMap<>();

    static {
        wuLiu_rcep.put("000811", "冰轮环境");//287	通用设备     0.84	80.92	1.92	价格区间: 5日:41.86 	10日:36.73 	20日:23.15 	30日:22.86 	60日:12.24 	120日:11.52 	250日:37.50 		,当前价：10.85	,当前：2022-04-12 13:51:45
        wuLiu_rcep.put("002803", "吉宏股份");//277	文化传媒     -0.61	50.41	1.17	价格区间: 5日:14.00 	10日:12.21 	20日:19.25 	30日:19.25 	60日:5.38  	120日:5.38  	250日:3.30  		,当前价：13.01	,当前：2022-04-12 13:51:47
        wuLiu_rcep.put("002612", "朗姿股份");//244	纺织服装     -0.57	91.98	1.73	价格区间: 5日:16.50 	10日:13.51 	20日:11.65 	30日:7.29  	60日:5.82  	120日:3.11  	250日:1.31  		,当前价：20.79	,当前：2022-04-12 13:51:48
        wuLiu_rcep.put("000582", "北部湾港");//239	航运港口     10   	186.86	8.54	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：11.44	,当前：2022-04-12 13:51:49
        wuLiu_rcep.put("603565", "中谷物流");//236	航运港口     -1.6	253.21	2.92	价格区间: 5日:45.39 	10日:38.78 	20日:64.35 	30日:38.87 	60日:28.60 	120日:28.60 	250日:22.37 		,当前价：26.41	,当前：2022-04-12 13:51:50
        wuLiu_rcep.put("600190", "锦州港  ");//231	航运港口     6.68	83.10	2.66	价格区间: 5日:85.71 	10日:86.67 	20日:32.91 	30日:32.55 	60日:50.69 	120日:51.85 	250日:51.85 		,当前价：4.15	,当前：2022-04-12 13:51:51
    }

    /**
     * wuLiu_zhongEMaoYi ["中俄贸易概念"]：11;
     */
    public static Map<String, String> wuLiu_zhongEMaoYi = new HashMap<>();

    static {
        wuLiu_zhongEMaoYi.put("002758", "浙农股份");//265	综合行业     3.94	76.91	2.11	价格区间: 5日:66.50 	10日:39.71 	20日:51.96 	30日:35.16 	60日:48.24 	120日:51.91 	250日:55.95 		,当前价：15.3	,当前：2022-04-13 11:39:49
        wuLiu_zhongEMaoYi.put("600251", "冠农股份");//263	农牧饲渔     1.59	84.79	5.21	价格区间: 5日:82.86 	10日:83.33 	20日:86.67 	30日:77.53 	60日:85.71 	120日:85.71 	250日:71.61 		,当前价：10.85	,当前：2022-04-13 11:39:50
        wuLiu_zhongEMaoYi.put("600798", "宁波海运");//260	航运港口     -1.47	64.55	7   	价格区间: 5日:63.92 	10日:70.83 	20日:76.03 	30日:57.81 	60日:66.25 	120日:66.25 	250日:66.25 		,当前价：5.35	,当前：2022-04-13 11:39:52
        wuLiu_zhongEMaoYi.put("002353", "杰瑞股份");//259	专用设备     -0.15	382.57	2.26	价格区间: 5日:42.25 	10日:23.81 	20日:20.34 	30日:17.61 	60日:17.61 	120日:16.89 	250日:40.98 		,当前价：39.94	,当前：2022-04-13 11:39:53
        wuLiu_zhongEMaoYi.put("600190", "锦州港  ");//230	航运港口     -1.94	80.89	5.33	价格区间: 5日:62.50 	10日:63.79 	20日:36.45 	30日:20.00 	60日:46.21 	120日:47.47 	250日:47.47 		,当前价：4.04	,当前：2022-04-13 11:39:54
    }

    /**
     * wuLiu 物流
     */
    public static Map<String, String> wuLiu = new HashMap<>();

    static {
        wuLiu.putAll(wuLiu_kuaiDi);//快递概念
        wuLiu.putAll(wuLiu_tongYiDaShiChang);//统一大市场
        wuLiu.putAll(wuLiu_haiYangJingJi);//海洋经济
        wuLiu.putAll(wuLiu_rcep);//RCEP概念
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {

        all.putAll(shiPin); //食品
        all.putAll(jiuShui); //酒水
        all.putAll(wuLiu); //物流

        all.putAll(lvYou); //旅游
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStXiaoFei.all, date);//all nongYe
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.lvYou, date);//all nongYe lvYou
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.shiPin, date);//
    }
}
