package utils;

import ttjj.stat.StockStatDemo;

import java.util.HashMap;
import java.util.Map;

/**
 * ContMapStZiYuan简介-股票分类数据：消费
 *
 * @author Administrator
 * @date 2022-03-18 10:09
 */
public class ContMapStXiaoFei {




    /**
     * shiPin_tiaoWeiPin ["调味品概念"]：19;
     */
    public static Map<String, String> shiPin_tiaoWeiPin = new HashMap<>();

    static {
        shiPin_tiaoWeiPin.put("600328", "中盐化工");//347	化学原料     2.62	187.41	1.22	价格区间: 5日:50.23 	10日:63.19 	20日:68.23 	30日:74.04 	60日:74.04 	120日:63.05 	250日:49.67 		,当前价：19.57	,当前：2022-04-18 10:18:03
        shiPin_tiaoWeiPin.put("002053", "云南能投");//325	化学原料     -1   	90.10	2.12	价格区间: 5日:30.23 	10日:11.21 	20日:2.78  	30日:20.32 	60日:25.65 	120日:29.57 	250日:34.77 		,当前价：11.84	,当前：2022-04-18 10:18:05
        shiPin_tiaoWeiPin.put("000505", "京粮控股");//324	农牧饲渔     3.25	85.42	1.28	价格区间: 5日:76.89 	10日:52.19 	20日:64.90 	30日:67.90 	60日:69.68 	120日:69.80 	250日:69.80 		,当前价：11.75	,当前：2022-04-18 10:18:06
        shiPin_tiaoWeiPin.put("002539", "云图控股");//310	化肥行业     0.92	154.44	3.41	价格区间: 5日:69.26 	10日:72.22 	20日:80.52 	30日:82.35 	60日:82.35 	120日:57.28 	250日:46.36 		,当前价：15.29	,当前：2022-04-18 10:18:07
    }

    /**
     * ["在线旅游"]：8;
     */
    public static Map<String, String> lvYou_zaiXianLvYou = new HashMap<>();

    static {
        lvYou_zaiXianLvYou.put("000524", "岭南控股");//337	旅游酒店     1.31	72.32	null	价格区间: 5日:12.67 	10日:12.67 	20日:8.65  	30日:28.63 	60日:42.89 	120日:48.52 	250日:48.52 		,当前价：10.79	,当前：2022-04-19 10:16:59
        lvYou_zaiXianLvYou.put("000796", "凯撒旅业");//318	旅游酒店     2.85	84.15	null	价格区间: 5日:14.96 	10日:14.96 	20日:21.62 	30日:37.37 	60日:49.74 	120日:55.59 	250日:57.12 		,当前价：10.48	,当前：2022-04-19 10:17:01
        lvYou_zaiXianLvYou.put("002707", "众信旅游");//276	旅游酒店     3.26	63.08	null	价格区间: 5日:31.85 	10日:31.62 	20日:31.62 	30日:55.71 	60日:40.27 	120日:57.21 	250日:62.37 		,当前价：6.96	,当前：2022-04-19 10:17:02
        lvYou_zaiXianLvYou.put("600258", "首旅酒店");//266	旅游酒店     0.94	278.33	null	价格区间: 5日:97.70 	10日:98.81 	20日:90.44 	30日:63.39 	60日:49.62 	120日:49.62 	250日:59.14 		,当前价：24.82	,当前：2022-04-19 10:17:03
        lvYou_zaiXianLvYou.put("002244", "滨江集团");//256	房地产开发   1.59	218.73	null	价格区间: 5日:36.52 	10日:34.43 	20日:39.85 	30日:66.53 	60日:67.35 	120日:79.90 	250日:80.39 		,当前价：7.03	,当前：2022-04-19 10:17:05
        lvYou_zaiXianLvYou.put("600640", "新国脉  ");//244	文化传媒     2.17	78.77	null	价格区间: 5日:28.43 	10日:14.87 	20日:14.87 	30日:14.87 	60日:5.51  	120日:4.10  	250日:4.10  		,当前价：9.9	,当前：2022-04-19 10:17:06
        lvYou_zaiXianLvYou.put("000069", "华侨城Ａ");//222	房地产开发   0.42	587.25	null	价格区间: 5日:27.88 	10日:23.58 	20日:51.55 	30日:61.63 	60日:52.98 	120日:52.98 	250日:32.83 		,当前价：7.16	,当前：2022-04-19 10:17:08
        lvYou_zaiXianLvYou.put("600138", "中青旅  ");//196	旅游酒店     1.1 	86.43	null	价格区间: 5日:29.09 	10日:21.77 	20日:22.30 	30日:48.20 	60日:46.62 	120日:61.83 	250日:65.58 		,当前价：11.94	,当前：2022-04-19 10:17:09
    }

    /**
     * lvYou_mianShui ["免税概念"]：22;
     */
    public static Map<String, String> lvYou_mianShui = new HashMap<>();

    static {
        lvYou_mianShui.put("600338", "西藏珠峰");//376	有色金属     -2.23	216.12	2.34	价格区间: 5日:27.62 	10日:10.68 	20日:6.76  	30日:4.94  	60日:3.90  	120日:2.97  	250日:33.25 		,当前价：23.64	,当前：2022-04-15 10:00:02
        lvYou_mianShui.put("000524", "岭南控股");//354	旅游酒店     0.95	78.68	2.01	价格区间: 5日:16.23 	10日:26.00 	20日:22.73 	30日:42.58 	60日:54.05 	120日:58.58 	250日:58.58 		,当前价：11.74	,当前：2022-04-15 10:00:04
        lvYou_mianShui.put("000796", "凯撒旅业");//328	旅游酒店     -1.08	88.01	2.16	价格区间: 5日:9.26  	10日:29.80 	20日:33.78 	30日:47.08 	60日:57.54 	120日:62.48 	250日:63.65 		,当前价：10.96	,当前：2022-04-15 10:00:05
        lvYou_mianShui.put("002707", "众信旅游");//280	旅游酒店     -0.93	67.62	1.8 	价格区间: 5日:46.59 	10日:46.59 	20日:64.12 	30日:77.62 	60日:55.97 	120日:68.46 	250日:72.26 		,当前价：7.46	,当前：2022-04-15 10:00:08
        lvYou_mianShui.put("001979", "招商蛇口");//274	房地产开发   5.58	1394.49	2.74	价格区间: 5日:89.63 	10日:90.51 	20日:93.91 	30日:95.10 	60日:95.10 	120日:96.65 	250日:96.77 		,当前价：17.6	,当前：2022-04-15 10:00:09
        lvYou_mianShui.put("601888", "中国中免");//251	旅游酒店     -0.63	3523.05	2.74	价格区间: 5日:86.19 	10日:86.19 	20日:86.19 	30日:49.93 	60日:34.69 	120日:22.83 	250日:13.95 		,当前价：180.44	,当前：2022-04-15 10:00:10
        lvYou_mianShui.put("002251", "步步高  ");//251	商业百货     9.97	87.69	44.91	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：10.15	,当前：2022-04-15 10:00:12
        lvYou_mianShui.put("002163", "海南发展");//247	玻璃玻纤     -1.56	91.52	1.88	价格区间: 5日:9.09  	10日:43.14 	20日:43.52 	30日:46.79 	60日:46.79 	120日:43.21 	250日:17.32 		,当前价：11.39	,当前：2022-04-15 10:00:13
        lvYou_mianShui.put("000861", "海印股份");//233	综合行业     1.27	73.96	2.29	价格区间: 5日:31.43 	10日:16.42 	20日:15.71 	30日:43.27 	60日:54.26 	120日:67.58 	250日:70.20 		,当前价：3.18	,当前：2022-04-15 10:00:14
        lvYou_mianShui.put("600009", "上海机场");//229	航空机场     0.56	1007.61	1.53	价格区间: 5日:79.01 	10日:79.01 	20日:81.16 	30日:59.72 	60日:50.04 	120日:57.63 	250日:64.13 		,当前价：52.29	,当前：2022-04-15 10:00:14
    }

    /**
     * lvYou_tuiShuiShangDian 退税商店
     */
    public static Map<String, String> lvYou_tuiShuiShangDian = new HashMap<>();

    static {
        lvYou_tuiShuiShangDian.put("600415", "小商品城");//182	商业百货     -0.18	303.67	0.83	价格区间: 5日:65.52 	10日:69.70 	20日:79.80 	30日:85.71 	60日:85.71 	120日:85.71 	250日:74.53 		,当前价：5.53	,当前：2022-04-18 11:24:20
        lvYou_tuiShuiShangDian.put("600828", "茂业商业");//180	商业百货     5.76	76.38	1.23	价格区间: 5日:71.19 	10日:74.24 	20日:82.65 	30日:85.71 	60日:86.18 	120日:86.72 	250日:86.72 		,当前价：4.41	,当前：2022-04-18 11:24:21
        lvYou_tuiShuiShangDian.put("600655", "豫园股份");//169	珠宝首饰     0.2 	393.32	0.38	价格区间: 5日:43.40 	10日:20.72 	20日:56.00 	30日:64.37 	60日:64.37 	120日:64.37 	250日:26.90 		,当前价：10.11	,当前：2022-04-18 11:24:22
        lvYou_tuiShuiShangDian.put("600827", "百联股份");//163	商业百货     0.33	217.49	1.1 	价格区间: 5日:49.41 	10日:63.56 	20日:67.18 	30日:73.29 	60日:61.46 	120日:46.64 	250日:15.88 		,当前价：12.19	,当前：2022-04-18 11:24:24
        lvYou_tuiShuiShangDian.put("002187", "广百股份");//161	商业百货     4.57	66.04	1.61	价格区间: 5日:88.30 	10日:90.52 	20日:93.37 	30日:94.69 	60日:94.69 	120日:81.22 	250日:84.46 		,当前价：9.38	,当前：2022-04-18 11:24:25
        lvYou_tuiShuiShangDian.put("600814", "杭州解百");//158	商业百货     0.62	60.02	4.39	价格区间: 5日:45.04 	10日:52.00 	20日:65.55 	30日:70.25 	60日:73.63 	120日:78.12 	250日:80.22 		,当前价：8.15	,当前：2022-04-18 11:24:26
    }

    /**
     * lvYou_hangKongJiChang 航空机场
     */
    public static Map<String, String> lvYou_hangKongJiChang = new HashMap<>();

    static {
        lvYou_hangKongJiChang.put("600004", "白云机场");//230	航空机场	3.84	301.05	2.56	价格区间: 5日:90.43 	10日:65.82 	20日:71.43 	30日:51.24 	60日:42.75 	120日:50.89 	250日:67.11 		,当前价：12.72	,当前：2022-04-01 11:39:04
        lvYou_hangKongJiChang.put("601111", "中国国航");//224	航空机场	4.94	1388.57	2.28	价格区间: 5日:87.50 	10日:73.04 	20日:73.82 	30日:62.95 	60日:46.23 	120日:55.91 	250日:68.16 		,当前价：9.56	,当前：2022-04-01 11:39:05
        lvYou_hangKongJiChang.put("002928", "华夏航空");//223	航空机场	1.36	105.72	2.56	价格区间: 5日:43.75 	10日:37.23 	20日:32.84 	30日:18.23 	60日:14.93 	120日:14.93 	250日:17.28 		,当前价：10.43	,当前：2022-04-01 11:39:07
        lvYou_hangKongJiChang.put("600009", "上海机场");//210	航空机场	2.62	972.92	1.76	价格区间: 5日:91.75 	10日:66.73 	20日:56.71 	30日:47.23 	60日:39.57 	120日:48.75 	250日:54.94 		,当前价：50.49	,当前：2022-04-01 11:39:08
    }

    /**
     * lvYou 旅游
     */
    public static Map<String, String> lvYou = new HashMap<>();

    static {
        lvYou.putAll(lvYou_zaiXianLvYou);//在线旅游
        lvYou.putAll(lvYou_mianShui);//免税概念
        lvYou.putAll(lvYou_tuiShuiShangDian);//退税商店
        lvYou.putAll(lvYou_hangKongJiChang);//航空机场
    }

    /**
     * yuZhiCaiGaiNian ["预制菜概念"]：16;
     */
    public static Map<String, String> shiPin_yuZhiCai = new HashMap<>();

    static {
        shiPin_yuZhiCai.put("605089", "味知香  ");//350	食品饮料     0.58	69.10	2.19	价格区间: 5日:67.73 	10日:73.90 	20日:73.90 	30日:77.05 	60日:30.28 	120日:30.28 	250日:27.80 		,当前价：69.1	,当前：2022-04-18 10:15:55
        shiPin_yuZhiCai.put("000524", "岭南控股");//333	旅游酒店     0.09	73.25	0.74	价格区间: 5日:14.49 	10日:14.49 	20日:9.73  	30日:31.86 	60日:45.48 	120日:50.85 	250日:50.85 		,当前价：10.93	,当前：2022-04-18 10:15:57
        shiPin_yuZhiCai.put("603345", "安井食品");//266	食品饮料     0.32	366.05	1.45	价格区间: 5日:78.90 	10日:78.90 	20日:78.90 	30日:78.90 	60日:37.44 	120日:20.60 	250日:13.49 		,当前价：124.8	,当前：2022-04-18 10:15:58
        shiPin_yuZhiCai.put("002124", "天邦股份");//255	农牧饲渔     1.62	161.67	2.12	价格区间: 5日:83.76 	10日:78.40 	20日:86.05 	30日:87.91 	60日:87.94 	120日:87.94 	250日:60.55 		,当前价：8.79	,当前：2022-04-18 10:15:59
        shiPin_yuZhiCai.put("600965", "福成股份");//251	农牧饲渔     10.06	64.51	7.59	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:50.12 	120日:50.12 	250日:58.35 		,当前价：7.88	,当前：2022-04-18 10:16:00
        shiPin_yuZhiCai.put("002481", "双塔食品");//241	食品饮料     -0.32	114.52	8.27	价格区间: 5日:91.04 	10日:91.04 	20日:84.33 	30日:85.77 	60日:60.83 	120日:55.59 	250日:29.96 		,当前价：9.21	,当前：2022-04-18 10:16:01
        shiPin_yuZhiCai.put("000019", "深粮控股");//238	贸易行业     1.3 	99.12	1.17	价格区间: 5日:25.49 	10日:35.29 	20日:50.59 	30日:56.55 	60日:61.11 	120日:63.16 	250日:63.16 		,当前价：8.6	,当前：2022-04-18 10:16:02
        shiPin_yuZhiCai.put("000876", "新希望  ");//219	农牧饲渔     2.05	718.58	1.31	价格区间: 5日:84.35 	10日:40.08 	20日:50.68 	30日:64.55 	60日:54.66 	120日:51.87 	250日:61.15 		,当前价：15.95	,当前：2022-04-18 10:16:03
        shiPin_yuZhiCai.put("601933", "永辉超市");//203	商业百货     2.71	412.91	1.74	价格区间: 5日:27.59 	10日:41.67 	20日:49.19 	30日:66.84 	60日:66.84 	120日:66.84 	250日:36.60 		,当前价：4.55	,当前：2022-04-18 10:16:04
    }

    /**
     * shiPin_sheQuTuanGou ["社区团购"]：18;
     */
    public static Map<String, String> shiPin_sheQuTuanGou = new HashMap<>();

    static {
        shiPin_sheQuTuanGou.put("002251", "步步高  ");//277	商业百货     10.05	96.50	21.7	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：11.17	,当前：2022-04-18 10:23:29
        shiPin_sheQuTuanGou.put("000607", "华媒控股");//269	文化传媒     0.8 	51.39	0.57	价格区间: 5日:15.52 	10日:10.23 	20日:10.23 	30日:13.66 	60日:15.88 	120日:40.26 	250日:43.45 		,当前价：5.05	,当前：2022-04-18 10:23:30
        shiPin_sheQuTuanGou.put("600327", "大东方  ");//252	汽车服务     1.34	53.35	0.7 	价格区间: 5日:100.00	10日:51.90 	20日:23.84 	30日:20.60 	60日:31.60 	120日:38.28 	250日:43.17 		,当前价：6.03	,当前：2022-04-18 10:23:31
        shiPin_sheQuTuanGou.put("002183", "怡亚通  ");//212	物流行业     2.16	135.30	0.74	价格区间: 5日:32.86 	10日:44.71 	20日:51.55 	30日:60.17 	60日:43.56 	120日:30.34 	250日:24.11 		,当前价：5.21	,当前：2022-04-18 10:23:32
        shiPin_sheQuTuanGou.put("601933", "永辉超市");//209	商业百货     3.16	414.73	1.74	价格区间: 5日:22.99 	10日:37.96 	20日:45.97 	30日:64.74 	60日:64.74 	120日:64.74 	250日:35.45 		,当前价：4.57	,当前：2022-04-18 10:23:34
    }

    /**
     * shiPin_ruYe ["乳业"]：14;
     */
    public static Map<String, String> shiPin_ruYe = new HashMap<>();

    static {
        shiPin_ruYe.put("605337", "李子园  ");//304	食品饮料     -1.72	75.46	6.15	价格区间: 5日:86.65 	10日:86.65 	20日:86.65 	30日:77.75 	60日:32.64 	120日:28.77 	250日:22.15 		,当前价：34.82	,当前：2022-04-15 10:51:06
        shiPin_ruYe.put("605388", "均瑶健康");//298	食品饮料     0.46	85.18	3.26	价格区间: 5日:90.97 	10日:90.97 	20日:49.61 	30日:56.97 	60日:52.76 	120日:43.70 	250日:24.78 		,当前价：19.81	,当前：2022-04-15 10:51:07
        shiPin_ruYe.put("002557", "洽洽食品");//264	食品饮料     -0.88	281.34	1.06	价格区间: 5日:35.01 	10日:59.43 	20日:74.59 	30日:76.77 	60日:70.45 	120日:52.03 	250日:64.59 		,当前价：55.49	,当前：2022-04-15 10:51:09
        shiPin_ruYe.put("002385", "大北农  ");//261	农牧饲渔     -0.35	355.32	2.64	价格区间: 5日:76.58 	10日:76.58 	20日:82.78 	30日:78.11 	60日:56.27 	120日:37.92 	250日:47.12 		,当前价：8.58	,当前：2022-04-15 10:51:10
        shiPin_ruYe.put("600882", "妙可蓝多");//252	食品饮料     -2.2	169.78	4.29	价格区间: 5日:88.79 	10日:65.88 	20日:48.82 	30日:35.65 	60日:15.07 	120日:10.97 	250日:6.83  		,当前价：32.89	,当前：2022-04-15 10:51:11
        shiPin_ruYe.put("601515", "东风股份");//242	包装材料     1.45	107.20	7.88	价格区间: 5日:15.15 	10日:44.55 	20日:58.82 	30日:67.44 	60日:34.73 	120日:29.52 	250日:36.47 		,当前价：6.98	,当前：2022-04-15 10:51:12
        shiPin_ruYe.put("002505", "鹏都农牧");//232	贸易行业     3.67	198.24	3.17	价格区间: 5日:89.29 	10日:43.86 	20日:28.74 	30日:28.74 	60日:22.73 	120日:16.56 	250日:47.50 		,当前价：3.11	,当前：2022-04-15 10:51:14
    }

    /**
     * shiPin_renZaoRou ["人造肉"]：6;
     */
    public static Map<String, String> shiPin_renZaoRou = new HashMap<>();

    static {
        shiPin_renZaoRou.put("002810", "山东赫达");//274	化学制品     -4.64	127.51	3.37	价格区间: 5日:35.53 	10日:17.45 	20日:17.41 	30日:9.13  	60日:8.57  	120日:6.61  	250日:10.85 		,当前价：37.22	,当前：2022-04-15 10:55:19
        shiPin_renZaoRou.put("002481", "双塔食品");//234	食品饮料     2.31	110.16	11.51	价格区间: 5日:86.89 	10日:86.89 	20日:73.27 	30日:75.73 	60日:49.32 	120日:49.32 	250日:26.58 		,当前价：8.86	,当前：2022-04-15 10:55:21
    }

    /**
     * shiPin 食品: 预制菜概念,社区团购,调味品概念
     */
    public static Map<String, String> shiPin = new HashMap<>();

    static {
        shiPin.putAll(shiPin_yuZhiCai);
        shiPin.putAll(shiPin_tiaoWeiPin);
        shiPin.putAll(shiPin_sheQuTuanGou);
        shiPin.putAll(shiPin_ruYe);//乳业
        shiPin.putAll(shiPin_renZaoRou);//人造肉
    }

    /**
     * jiuShui_baiJiu ["白酒"]：37;
     */
    public static Map<String, String> jiuShui_baiJiu = new HashMap<>();

    static {
        jiuShui_baiJiu.put("600199", "金种子酒");//446	酿酒行业     4.1 	190.23	4.18	价格区间: 5日:91.97 	10日:93.00 	20日:61.08 	30日:61.08 	60日:79.59 	120日:79.59 	250日:80.20 		,当前价：28.92	,当前：2022-04-14 10:12:51
        jiuShui_baiJiu.put("600381", "青海春天");//382	食品饮料     2.38	116.00	4.42	价格区间: 5日:80.99 	10日:89.99 	20日:91.45 	30日:93.59 	60日:94.47 	120日:94.69 	250日:94.93 		,当前价：19.76	,当前：2022-04-14 10:12:52
        jiuShui_baiJiu.put("600238", "海南椰岛");//355	酿酒行业     0.71	64.00	3.26	价格区间: 5日:94.38 	10日:94.68 	20日:95.20 	30日:95.20 	60日:56.18 	120日:36.57 	250日:28.31 		,当前价：14.28	,当前：2022-04-14 10:12:53
        jiuShui_baiJiu.put("600771", "广誉远  ");//340	中药         1.91	154.68	0.96	价格区间: 5日:33.82 	10日:17.16 	20日:31.60 	30日:31.60 	60日:25.63 	120日:24.37 	250日:41.55 		,当前价：31.44	,当前：2022-04-14 10:12:55
        jiuShui_baiJiu.put("600702", "舍得酒业");//323	酿酒行业     2.54	507.47	0.7 	价格区间: 5日:82.68 	10日:60.00 	20日:37.75 	30日:27.63 	60日:23.78 	120日:13.39 	250日:40.85 		,当前价：152.82	,当前：2022-04-14 10:12:56
    }

    /**
     * jiuShui_piJiu ["啤酒概念"]：6;
     */
    public static Map<String, String> jiuShui_piJiu = new HashMap<>();

    static {
        jiuShui_piJiu.put("600132", "重庆啤酒");//281	酿酒行业     1.12	599.50	1.35	价格区间: 5日:91.60 	10日:91.70 	20日:92.84 	30日:72.05 	60日:58.93 	120日:37.85 	250日:24.54 		,当前价：123.87	,当前：2022-04-15 10:57:53
        jiuShui_piJiu.put("600600", "青岛啤酒");//247	酿酒行业     -0.77	1149.88	1.98	价格区间: 5日:92.07 	10日:92.07 	20日:78.90 	30日:43.63 	60日:40.77 	120日:34.65 	250日:27.73 		,当前价：84.28	,当前：2022-04-15 10:57:55
        jiuShui_piJiu.put("600108", "亚盛集团");//244	农牧饲渔     -2.05	74.57	1.62	价格区间: 5日:26.67 	10日:23.21 	20日:52.75 	30日:59.81 	60日:63.56 	120日:65.87 	250日:73.62 		,当前价：3.83	,当前：2022-04-15 10:57:56
    }

    /**
     * jiuShui 酒水
     */
    public static Map<String, String> jiuShui = new HashMap<>();

    static {
        jiuShui.putAll(jiuShui_baiJiu);
        jiuShui.putAll(jiuShui_piJiu);//啤酒概念
    }




    /**
     * wuLiu_kuaiDi ["快递概念"]：23;
     */
    public static Map<String, String> wuLiu_kuaiDi = new HashMap<>();

    static {
        wuLiu_kuaiDi.put("002210", "飞马国际");//301	物流行业     -3.14	81.97	1.87	价格区间: 5日:20.45 	10日:35.19 	20日:35.19 	30日:35.19 	60日:35.19 	120日:25.10 	250日:32.59 		,当前价：3.08	,当前：2022-04-18 13:59:58
        wuLiu_kuaiDi.put("603056", "德邦股份");//265	物流行业     5.01	148.40	2.25	价格区间: 5日:59.57 	10日:30.55 	20日:9.66  	30日:33.16 	60日:35.26 	120日:37.82 	250日:38.35 		,当前价：14.45	,当前：2022-04-18 13:59:59
        wuLiu_kuaiDi.put("600153", "建发股份");//260	贸易行业     -3.96	388.85	0.8 	价格区间: 5日:38.36 	10日:39.41 	20日:69.18 	30日:75.26 	60日:75.47 	120日:80.83 	250日:81.92 		,当前价：13.58	,当前：2022-04-18 14:00:00
        wuLiu_kuaiDi.put("002120", "韵达股份");//251	物流行业     -0.69	499.57	0.37	价格区间: 5日:52.27 	10日:52.27 	20日:44.27 	30日:31.81 	60日:21.68 	120日:18.31 	250日:42.75 		,当前价：17.21	,当前：2022-04-18 14:00:01
        wuLiu_kuaiDi.put("600233", "圆通速递");//246	物流行业     -1.44	564.82	0.35	价格区间: 5日:70.63 	10日:51.45 	20日:49.44 	30日:43.73 	60日:43.73 	120日:52.71 	250日:71.50 		,当前价：16.44	,当前：2022-04-18 14:00:03
        wuLiu_kuaiDi.put("600787", "中储股份");//242	物流行业     2.8 	129.13	2.52	价格区间: 5日:16.98 	10日:31.25 	20日:33.67 	30日:39.17 	60日:39.17 	120日:37.78 	250日:36.48 		,当前价：5.87	,当前：2022-04-18 14:00:04
        wuLiu_kuaiDi.put("002183", "怡亚通  ");//230	物流行业     8.43	143.61	0.74	价格区间: 5日:75.71 	10日:80.00 	20日:81.44 	30日:84.75 	60日:61.35 	120日:42.74 	250日:32.05 		,当前价：5.53	,当前：2022-04-18 14:00:05
    }

    /**
     * wuLiu_tongYiDaShiChang ["统一大市场"]：11;
     */
    public static Map<String, String> wuLiu_tongYiDaShiChang = new HashMap<>();

    static {
        wuLiu_tongYiDaShiChang.put("002314", "南山控股");//327	房地产开发   -0.65	124.56	null	价格区间: 5日:27.27 	10日:12.79 	20日:32.63 	30日:40.00 	60日:40.00 	120日:47.67 	250日:47.67 		,当前价：4.6	,当前：2022-04-19 11:17:26
        wuLiu_tongYiDaShiChang.put("002210", "飞马国际");//296	物流行业     -1.66	79.04	null	价格区间: 5日:4.55  	10日:19.23 	20日:22.22 	30日:22.22 	60日:22.22 	120日:19.34 	250日:27.41 		,当前价：2.97	,当前：2022-04-19 11:17:28
        wuLiu_tongYiDaShiChang.put("600787", "中储股份");//236	物流行业     0.69	128.47	null	价格区间: 5日:15.09 	10日:29.69 	20日:32.16 	30日:37.79 	60日:37.79 	120日:36.44 	250日:35.50 		,当前价：5.84	,当前：2022-04-19 11:17:29
        wuLiu_tongYiDaShiChang.put("002183", "怡亚通  ");//227	物流行业     0.18	142.84	null	价格区间: 5日:66.18 	10日:72.94 	20日:76.29 	30日:80.51 	60日:62.91 	120日:40.60 	250日:30.68 		,当前价：5.5	,当前：2022-04-19 11:17:30
        wuLiu_tongYiDaShiChang.put("002010", "传化智联");//221	物流行业     1.57	199.03	null	价格区间: 5日:25.20 	10日:25.20 	20日:25.20 	30日:20.95 	60日:11.92 	120日:8.33  	250日:14.77 		,当前价：6.48	,当前：2022-04-19 11:17:31
        wuLiu_tongYiDaShiChang.put("600603", "广汇物流");//218	房地产开发   -8.84	58.32	null	价格区间: 5日:10.00 	10日:38.31 	20日:45.20 	30日:48.84 	60日:48.84 	120日:48.84 	250日:48.84 		,当前价：4.64	,当前：2022-04-19 11:17:32
        wuLiu_tongYiDaShiChang.put("001213", "中铁特货");//206	物流行业     -0.74	236.89	null	价格区间: 5日:9.24  	10日:10.74 	20日:14.29 	30日:16.28 	60日:16.28 	120日:9.66  	250日:13.06 		,当前价：5.33	,当前：2022-04-19 11:17:33
        wuLiu_tongYiDaShiChang.put("000927", "中国铁物");//197	物流行业     -0.94	191.80	null	价格区间: 5日:2.11  	10日:2.11  	20日:2.11  	30日:8.55  	60日:8.55  	120日:8.55  	250日:8.55  		,当前价：3.17	,当前：2022-04-19 11:17:34
    }

    /**
     * wuLiu_haiYangJingJi ["海洋经济"]：17;
     */
    public static Map<String, String> wuLiu_haiYangJingJi = new HashMap<>();

    static {
        wuLiu_haiYangJingJi.put("002639", "雪人股份");//380	通用设备     5.71	94.33	null	价格区间: 5日:47.86 	10日:48.95 	20日:40.00 	30日:59.12 	60日:54.84 	120日:47.88 	250日:50.42 		,当前价：12.21	,当前：2022-04-19 10:58:48
        wuLiu_haiYangJingJi.put("600522", "中天科技");//345	通信设备     -1.09	525.25	null	价格区间: 5日:58.12 	10日:37.37 	20日:24.29 	30日:20.29 	60日:20.06 	120日:55.65 	250日:61.24 		,当前价：15.39	,当前：2022-04-19 10:58:49
        wuLiu_haiYangJingJi.put("600026", "中远海能");//302	航运港口     2.22	351.01	null	价格区间: 5日:62.63 	10日:75.33 	20日:84.84 	30日:84.84 	60日:87.71 	120日:87.71 	250日:87.71 		,当前价：7.37	,当前：2022-04-19 10:58:50
        wuLiu_haiYangJingJi.put("601890", "亚星锚链");//278	船舶制造     -2.13	75.12	null	价格区间: 5日:29.41 	10日:62.50 	20日:62.50 	30日:56.74 	60日:23.39 	120日:37.02 	250日:50.94 		,当前价：7.83	,当前：2022-04-19 10:58:51
        wuLiu_haiYangJingJi.put("601919", "中远海控");//275	航运港口     1.61	2422.95	null	价格区间: 5日:46.15 	10日:23.30 	20日:19.51 	30日:13.08 	60日:11.79 	120日:11.37 	250日:28.15 		,当前价：15.13	,当前：2022-04-19 10:58:52
    }

    /**
     * wuLiu_rcep ["RCEP概念"]：13;
     */
    public static Map<String, String> wuLiu_rcep = new HashMap<>();

    static {
        wuLiu_rcep.put("000811", "冰轮环境");//287	通用设备     0.84	80.92	1.92	价格区间: 5日:41.86 	10日:36.73 	20日:23.15 	30日:22.86 	60日:12.24 	120日:11.52 	250日:37.50 		,当前价：10.85	,当前：2022-04-12 13:51:45
        wuLiu_rcep.put("002803", "吉宏股份");//277	文化传媒     -0.61	50.41	1.17	价格区间: 5日:14.00 	10日:12.21 	20日:19.25 	30日:19.25 	60日:5.38  	120日:5.38  	250日:3.30  		,当前价：13.01	,当前：2022-04-12 13:51:47
        wuLiu_rcep.put("002612", "朗姿股份");//244	纺织服装     -0.57	91.98	1.73	价格区间: 5日:16.50 	10日:13.51 	20日:11.65 	30日:7.29  	60日:5.82  	120日:3.11  	250日:1.31  		,当前价：20.79	,当前：2022-04-12 13:51:48
        wuLiu_rcep.put("000582", "北部湾港");//239	航运港口     10   	186.86	8.54	价格区间: 5日:100.00	10日:100.00	20日:100.00	30日:100.00	60日:100.00	120日:100.00	250日:100.00		,当前价：11.44	,当前：2022-04-12 13:51:49
        wuLiu_rcep.put("603565", "中谷物流");//236	航运港口     -1.6	253.21	2.92	价格区间: 5日:45.39 	10日:38.78 	20日:64.35 	30日:38.87 	60日:28.60 	120日:28.60 	250日:22.37 		,当前价：26.41	,当前：2022-04-12 13:51:50
        wuLiu_rcep.put("600190", "锦州港  ");//231	航运港口     6.68	83.10	2.66	价格区间: 5日:85.71 	10日:86.67 	20日:32.91 	30日:32.55 	60日:50.69 	120日:51.85 	250日:51.85 		,当前价：4.15	,当前：2022-04-12 13:51:51
    }

    /**
     * wuLiu_zhongEMaoYi ["中俄贸易概念"]：11;
     */
    public static Map<String, String> wuLiu_zhongEMaoYi = new HashMap<>();

    static {
        wuLiu_zhongEMaoYi.put("002758", "浙农股份");//265	综合行业     3.94	76.91	2.11	价格区间: 5日:66.50 	10日:39.71 	20日:51.96 	30日:35.16 	60日:48.24 	120日:51.91 	250日:55.95 		,当前价：15.3	,当前：2022-04-13 11:39:49
        wuLiu_zhongEMaoYi.put("600251", "冠农股份");//263	农牧饲渔     1.59	84.79	5.21	价格区间: 5日:82.86 	10日:83.33 	20日:86.67 	30日:77.53 	60日:85.71 	120日:85.71 	250日:71.61 		,当前价：10.85	,当前：2022-04-13 11:39:50
        wuLiu_zhongEMaoYi.put("600798", "宁波海运");//260	航运港口     -1.47	64.55	7   	价格区间: 5日:63.92 	10日:70.83 	20日:76.03 	30日:57.81 	60日:66.25 	120日:66.25 	250日:66.25 		,当前价：5.35	,当前：2022-04-13 11:39:52
        wuLiu_zhongEMaoYi.put("002353", "杰瑞股份");//259	专用设备     -0.15	382.57	2.26	价格区间: 5日:42.25 	10日:23.81 	20日:20.34 	30日:17.61 	60日:17.61 	120日:16.89 	250日:40.98 		,当前价：39.94	,当前：2022-04-13 11:39:53
        wuLiu_zhongEMaoYi.put("600190", "锦州港  ");//230	航运港口     -1.94	80.89	5.33	价格区间: 5日:62.50 	10日:63.79 	20日:36.45 	30日:20.00 	60日:46.21 	120日:47.47 	250日:47.47 		,当前价：4.04	,当前：2022-04-13 11:39:54
    }

    /**
     * wuLiu_jinKouBoLan ["进口博览"]：11;
     */
    public static Map<String, String> wuLiu_jinKouBoLan = new HashMap<>();

    static {
        wuLiu_jinKouBoLan.put("002183", "怡亚通  ");//230	物流行业     8.43	143.61	0.74	价格区间: 5日:71.43 	10日:76.47 	20日:79.38 	30日:83.05 	60日:60.12 	120日:41.88 	250日:31.51 		,当前价：5.53	,当前：2022-04-18 14:11:42
        wuLiu_jinKouBoLan.put("600115", "中国东航");//183	航空机场     2.69	936.17	1.5 	价格区间: 5日:92.00 	10日:92.00 	20日:35.38 	30日:31.72 	60日:27.06 	120日:27.06 	250日:37.06 		,当前价：4.96	,当前：2022-04-18 14:11:43
        wuLiu_jinKouBoLan.put("600655", "豫园股份");//169	珠宝首饰     0.1 	392.93	0.38	价格区间: 5日:41.51 	10日:19.82 	20日:55.50 	30日:63.97 	60日:63.97 	120日:63.97 	250日:26.73 		,当前价：10.1	,当前：2022-04-18 14:11:44
    }

    /**
     * wuLiu 物流
     */
    public static Map<String, String> wuLiu = new HashMap<>();

    static {
        wuLiu.putAll(wuLiu_kuaiDi);//快递概念
        wuLiu.putAll(wuLiu_tongYiDaShiChang);//统一大市场
        wuLiu.putAll(wuLiu_haiYangJingJi);//海洋经济
        wuLiu.putAll(wuLiu_rcep);//RCEP概念
        wuLiu.putAll(wuLiu_jinKouBoLan);//RCEP概念
    }

    /**
     * allZiYuan
     */
    public static Map<String, String> all = new HashMap<>();

    static {

        all.putAll(shiPin); //食品
        all.putAll(jiuShui); //酒水
        all.putAll(wuLiu); //物流

        all.putAll(lvYou); //旅游
    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);//        String date = "2022-03-25";
        StockStatDemo.checkMaDemo(ContMapStXiaoFei.all, date);//all nongYe
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.lvYou, date);//all nongYe lvYou
//        StockStatDemo.checkMaDemo(ContMapStXiaoFei.shiPin, date);//
    }
}
